Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/* ---------------------------------------------------------------------------- */
/*                  Atmel Microcontroller Software Support                      */
/* ---------------------------------------------------------------------------- */
/* Copyright (c) 2012, Atmel Corporation                                        */
/*                                                                              */
/* All rights reserved.                                                         */
/*                                                                              */
/* Redistribution and use in source and binary forms, with or without           */
/* modification, are permitted provided that the following condition is met:    */
/*                                                                              */
/* - Redistributions of source code must retain the above copyright notice,     */
/* this list of conditions and the disclaimer below.                            */
/*                                                                              */
/* Atmel's name may not be used to endorse or promote products derived from     */
/* this software without specific prior written permission.                     */
/*                                                                              */
/* DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   */
/* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF */
/* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   */
/* DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      */
/* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT */
/* LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  */
/* OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    */
/* LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         */
/* NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, */
/* EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           */
/* ---------------------------------------------------------------------------- */
/*                                                                              */
/* File Name    : SAM4L4.h */
/* Object       : SAM4L4 definitions */
/* Generated by : AT91 SW Application Group */
/* Generated on : 2012-08-07 */

#ifndef SAM4L4_H
#define SAM4L4_H

/** \addtogroup SAM4L4_definitions SAM4L4 definitions
  This file defines all structures and symbols for SAM4L4:
    - registers and bitfields
    - peripheral base address
    - peripheral ID
    - PIO definitions
*/
/*@{*/

#ifdef __cplusplus
 extern "C" {
#endif

#ifndef __ASSEMBLY__
#include <stdint.h>
#ifndef __cplusplus
typedef volatile const uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile const uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile const uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#else
typedef volatile       uint32_t RoReg;   /**< Read only 32-bit register (volatile const unsigned int) */
typedef volatile       uint16_t RoReg16; /**< Read only 16-bit register (volatile const unsigned int) */
typedef volatile       uint8_t  RoReg8;  /**< Read only  8-bit register (volatile const unsigned int) */
#endif
typedef volatile       uint32_t WoReg;   /**< Write only 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t WoReg16; /**< Write only 16-bit register (volatile unsigned int) */
typedef volatile       uint32_t WoReg8;  /**< Write only  8-bit register (volatile unsigned int) */
typedef volatile       uint32_t RwReg;   /**< Read-Write 32-bit register (volatile unsigned int) */
typedef volatile       uint16_t RwReg16; /**< Read-Write 16-bit register (volatile unsigned int) */
typedef volatile       uint8_t  RwReg8;  /**< Read-Write  8-bit register (volatile unsigned int) */
#define CAST(type, value) ((type *)(value))
#define REG_ACCESS(type, address) (*(type*)(address)) /**< C code: Register value */
#else
#define CAST(type, value) (value)
#define REG_ACCESS(type, address) (address) /**< Assembly code: Register address */
#endif

/* ************************************************************************** */
/*   CMSIS DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_cmsis CMSIS Definitions */
/*@{*/


/**< Interrupt Number Definition */
typedef enum IRQn
{
/******  Cortex-M4 Processor Exceptions Numbers ******************************/
  NonMaskableInt_IRQn   = -14, /**<  2 Non Maskable Interrupt                */
  HardFault_IRQn        = -13, /**<  3 Cortex-M4 Hard Fault Interrupt        */
  MemoryManagement_IRQn = -12, /**<  4 Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11, /**<  5 Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10, /**<  6 Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,  /**< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,  /**< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,  /**< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,  /**< 15 Cortex-M4 System Tick Interrupt       */
  /******  SAM4L4 specific Interrupt Numbers *********************************/
  HFLASHC_IRQn          =  0, /**<  0 SAM4L4 Flash Controller (HFLASHC) */
  PDCA_0_IRQn           =  1, /**<  1 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_1_IRQn           =  2, /**<  2 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_2_IRQn           =  3, /**<  3 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_3_IRQn           =  4, /**<  4 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_4_IRQn           =  5, /**<  5 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_5_IRQn           =  6, /**<  6 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_6_IRQn           =  7, /**<  7 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_7_IRQn           =  8, /**<  8 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_8_IRQn           =  9, /**<  9 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_9_IRQn           = 10, /**< 10 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_10_IRQn          = 11, /**< 11 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_11_IRQn          = 12, /**< 12 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_12_IRQn          = 13, /**< 13 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_13_IRQn          = 14, /**< 14 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_14_IRQn          = 15, /**< 15 SAM4L4 Peripheral DMA Controller (PDCA) */
  PDCA_15_IRQn          = 16, /**< 16 SAM4L4 Peripheral DMA Controller (PDCA) */
  CRCCU_IRQn            = 17, /**< 17 SAM4L4 CRC Calculation Unit (CRCCU) */
  USBC_IRQn             = 18, /**< 18 SAM4L4 USB 2.0 Interface (USBC) */
  PEVC_TR_IRQn          = 19, /**< 19 SAM4L4 Peripheral Event Controller (PEVC) */
  PEVC_OV_IRQn          = 20, /**< 20 SAM4L4 Peripheral Event Controller (PEVC) */
  AESA_IRQn             = 21, /**< 21 SAM4L4 Advanced Encryption Standard (AESA) */
  PM_IRQn               = 22, /**< 22 SAM4L4 Power Manager (PM) */
  SCIF_IRQn             = 23, /**< 23 SAM4L4 System Control Interface (SCIF) */
  FREQM_IRQn            = 24, /**< 24 SAM4L4 Frequency Meter (FREQM) */
  GPIO_0_IRQn           = 25, /**< 25 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_1_IRQn           = 26, /**< 26 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_2_IRQn           = 27, /**< 27 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_3_IRQn           = 28, /**< 28 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_4_IRQn           = 29, /**< 29 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_5_IRQn           = 30, /**< 30 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_6_IRQn           = 31, /**< 31 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_7_IRQn           = 32, /**< 32 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_8_IRQn           = 33, /**< 33 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_9_IRQn           = 34, /**< 34 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_10_IRQn          = 35, /**< 35 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  GPIO_11_IRQn          = 36, /**< 36 SAM4L4 General-Purpose Input/Output Controller (GPIO) */
  BPM_IRQn              = 37, /**< 37 SAM4L4 Backup Power Manager (BPM) */
  BSCIF_IRQn            = 38, /**< 38 SAM4L4 Backup System Control Interface (BSCIF) */
  AST_ALARM_IRQn        = 39, /**< 39 SAM4L4 Asynchronous Timer (AST) */
  AST_PER_IRQn          = 40, /**< 40 SAM4L4 Asynchronous Timer (AST) */
  AST_OVF_IRQn          = 41, /**< 41 SAM4L4 Asynchronous Timer (AST) */
  AST_READY_IRQn        = 42, /**< 42 SAM4L4 Asynchronous Timer (AST) */
  AST_CLKREADY_IRQn     = 43, /**< 43 SAM4L4 Asynchronous Timer (AST) */
  WDT_IRQn              = 44, /**< 44 SAM4L4 Watchdog Timer (WDT) */
  EIC_1_IRQn            = 45, /**< 45 SAM4L4 External Interrupt Controller (EIC) */
  EIC_2_IRQn            = 46, /**< 46 SAM4L4 External Interrupt Controller (EIC) */
  EIC_3_IRQn            = 47, /**< 47 SAM4L4 External Interrupt Controller (EIC) */
  EIC_4_IRQn            = 48, /**< 48 SAM4L4 External Interrupt Controller (EIC) */
  EIC_5_IRQn            = 49, /**< 49 SAM4L4 External Interrupt Controller (EIC) */
  EIC_6_IRQn            = 50, /**< 50 SAM4L4 External Interrupt Controller (EIC) */
  EIC_7_IRQn            = 51, /**< 51 SAM4L4 External Interrupt Controller (EIC) */
  EIC_8_IRQn            = 52, /**< 52 SAM4L4 External Interrupt Controller (EIC) */
  IISC_IRQn             = 53, /**< 53 SAM4L4 Inter-IC Sound (I2S) Controller (IISC) */
  SPI_IRQn              = 54, /**< 54 SAM4L4 Serial Peripheral Interface (SPI) */
  TC00_IRQn             = 55, /**< 55 SAM4L4 Timer/Counter 0 (TC0) */
  TC01_IRQn             = 56, /**< 56 SAM4L4 Timer/Counter 0 (TC0) */
  TC02_IRQn             = 57, /**< 57 SAM4L4 Timer/Counter 0 (TC0) */
  TC10_IRQn             = 58, /**< 58 SAM4L4 Timer/Counter 1 (TC1) */
  TC11_IRQn             = 59, /**< 59 SAM4L4 Timer/Counter 1 (TC1) */
  TC12_IRQn             = 60, /**< 60 SAM4L4 Timer/Counter 1 (TC1) */
  TWIM0_IRQn            = 61, /**< 61 SAM4L4 Two-wire Master Interface 0 (TWIM0) */
  TWIS0_IRQn            = 62, /**< 62 SAM4L4 Two-wire Slave Interface 0 (TWIS0) */
  TWIM1_IRQn            = 63, /**< 63 SAM4L4 Two-wire Master Interface 1 (TWIM1) */
  TWIS1_IRQn            = 64, /**< 64 SAM4L4 Two-wire Slave Interface 1 (TWIS1) */
  USART0_IRQn           = 65, /**< 65 SAM4L4 Universal Synchronous Asynchronous Receiver Transmitter 0 (USART0) */
  USART1_IRQn           = 66, /**< 66 SAM4L4 Universal Synchronous Asynchronous Receiver Transmitter 1 (USART1) */
  USART2_IRQn           = 67, /**< 67 SAM4L4 Universal Synchronous Asynchronous Receiver Transmitter 2 (USART2) */
  USART3_IRQn           = 68, /**< 68 SAM4L4 Universal Synchronous Asynchronous Receiver Transmitter 3 (USART3) */
  ADCIFE_IRQn           = 69, /**< 69 SAM4L4 ADC controller interface (ADCIFE) */
  DACC_IRQn             = 70, /**< 70 SAM4L4 DAC Controller (DACC) */
  ACIFC_IRQn            = 71, /**< 71 SAM4L4 Analog Comparator Interface (ACIFC) */
  ABDACB_IRQn           = 72, /**< 72 SAM4L4 Audio Bitstream DAC (ABDACB) */
  TRNG_IRQn             = 73, /**< 73 SAM4L4 True Random Number Generator (TRNG) */
  PARC_IRQn             = 74, /**< 74 SAM4L4 Parallel Capture (PARC) */
  CATB_IRQn             = 75, /**< 75 SAM4L4 Capacitive Touch Module B (CATB) */
  PTC_IRQn              = 76, /**< 76 SAM4L4  (PTC) */
  TWIM2_IRQn            = 77, /**< 77 SAM4L4 Two-wire Master Interface 2 (TWIM2) */
  TWIM3_IRQn            = 78, /**< 78 SAM4L4 Two-wire Master Interface 3 (TWIM3) */
  LCDCA_IRQn            = 79  /**< 79 SAM4L4 LCD Controller (LCDCA) */
} IRQn_Type;


/* Cortex-M4 core handlers */
void Reset_Handler      ( void );
void NMI_Handler        ( void );
void HardFault_Handler  ( void );
void MemManage_Handler  ( void );
void BusFault_Handler   ( void );
void UsageFault_Handler ( void );
void SVC_Handler        ( void );
void DebugMon_Handler   ( void );
void PendSV_Handler     ( void );
void SysTick_Handler    ( void );

/* Peripherals handlers */

void HFLASHC_Handler( void );
void PDCA_0_Handler( void );
void PDCA_1_Handler( void );
void PDCA_2_Handler( void );
void PDCA_3_Handler( void );
void PDCA_4_Handler( void );
void PDCA_5_Handler( void );
void PDCA_6_Handler( void );
void PDCA_7_Handler( void );
void PDCA_8_Handler( void );
void PDCA_9_Handler( void );
void PDCA_10_Handler( void );
void PDCA_11_Handler( void );
void PDCA_12_Handler( void );
void PDCA_13_Handler( void );
void PDCA_14_Handler( void );
void PDCA_15_Handler( void );
void CRCCU_Handler( void );
void USBC_Handler( void );
void PEVC_TR_Handler( void );
void PEVC_OV_Handler( void );
void AESA_Handler( void );
void PM_Handler( void );
void SCIF_Handler( void );
void FREQM_Handler( void );
void GPIO_0_Handler( void );
void GPIO_1_Handler( void );
void GPIO_2_Handler( void );
void GPIO_3_Handler( void );
void GPIO_4_Handler( void );
void GPIO_5_Handler( void );
void GPIO_6_Handler( void );
void GPIO_7_Handler( void );
void GPIO_8_Handler( void );
void GPIO_9_Handler( void );
void GPIO_10_Handler( void );
void GPIO_11_Handler( void );
void BPM_Handler( void );
void BSCIF_Handler( void );
void AST_ALARM_Handler( void );
void AST_PER_Handler( void );
void AST_OVF_Handler( void );
void AST_READY_Handler( void );
void AST_CLKREADY_Handler( void );
void WDT_Handler( void );
void EIC_1_Handler( void );
void EIC_2_Handler( void );
void EIC_3_Handler( void );
void EIC_4_Handler( void );
void EIC_5_Handler( void );
void EIC_6_Handler( void );
void EIC_7_Handler( void );
void EIC_8_Handler( void );
void IISC_Handler( void );
void SPI_Handler( void );
void TC00_Handler( void );
void TC01_Handler( void );
void TC02_Handler( void );
void TC10_Handler( void );
void TC11_Handler( void );
void TC12_Handler( void );
void TWIM0_Handler( void );
void TWIS0_Handler( void );
void TWIM1_Handler( void );
void TWIS1_Handler( void );
void USART0_Handler( void );
void USART1_Handler( void );
void USART2_Handler( void );
void USART3_Handler( void );
void ADCIFE_Handler( void );
void DACC_Handler( void );
void ACIFC_Handler( void );
void ABDACB_Handler( void );
void TRNG_Handler( void );
void PARC_Handler( void );
void CATB_Handler( void );
void PTC_Handler( void );
void TWIM2_Handler( void );
void TWIM3_Handler( void );
void LCDCA_Handler( void );

