Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/*
 * \brief Configuration of the Cortex-M4 Processor and Core Peripherals
 */

#define __MPU_PRESENT          1 /**< SAM4L4 does provide a MPU */
#define __NVIC_PRIO_BITS       4 /**< SAM4L4 uses 4 Bits for the Priority Levels */
#define __Vendor_SysTickConfig 0 /**< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT          0 /**< SAM4L4 does not provide a FPU */

/**
 * \brief CMSIS includes
 */

#include <core_cm4.h>

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_api Peripheral Software API */
/*@{*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR ABDACB */
/* ============================================================================= */
/** \addtogroup SAM4L4_ABDACB Audio Bitstream DAC */
/*@{*/

#define REV_ABDACB     0x100

#ifndef __ASSEMBLY__
/** \brief ABDACB hardware registers */
typedef struct {
  RwReg   CR;          /**< \brief (ABDACB Offset: 0x00) Control Register */
  RwReg   SDR0;        /**< \brief (ABDACB Offset: 0x04) Sample Data Register 0 */
  RwReg   SDR1;        /**< \brief (ABDACB Offset: 0x08) Sample Data Register 1 */
  RwReg   VCR0;        /**< \brief (ABDACB Offset: 0x0C) Volume Control Register 0 */
  RwReg   VCR1;        /**< \brief (ABDACB Offset: 0x10) Volume Control Register 1 */
  WoReg   IER;         /**< \brief (ABDACB Offset: 0x14) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (ABDACB Offset: 0x18) Interupt Disable Register */
  RoReg   IMR;         /**< \brief (ABDACB Offset: 0x1C) Interrupt Mask Register */
  RoReg   SR;          /**< \brief (ABDACB Offset: 0x20) Status Register */
  WoReg   SCR;         /**< \brief (ABDACB Offset: 0x24) Status Clear Register */
  RoReg   PARAMETER;   /**< \brief (ABDACB Offset: 0x28) Parameter Register */
  RoReg   VERSION;     /**< \brief (ABDACB Offset: 0x2C) Version Register */
} Abdacb;
#endif /* __ASSEMBLY__ */
/* -------- ABDACB_CR : (ABDACB Offset: 0x00) Control Register -------- */
#define ABDACB_CR_EN                (0x1u <<  0) /**< \brief (ABDACB_CR) Enable */
#define   ABDACB_CR_EN_0            (0x0u <<  0) /**< \brief (ABDACB_CR) Audio DAC is disabled */
#define   ABDACB_CR_EN_1            (0x1u <<  0) /**< \brief (ABDACB_CR) Audio DAC is enabled */
#define ABDACB_CR_SWAP              (0x1u <<  1) /**< \brief (ABDACB_CR) Swap Channels */
#define   ABDACB_CR_SWAP_0          (0x0u <<  1) /**< \brief (ABDACB_CR) The CHANNEL0 and CHANNEL1 samples will not be swapped when writing the Audio DAC Sample Data Register (SDR) */
#define   ABDACB_CR_SWAP_1          (0x1u <<  1) /**< \brief (ABDACB_CR) The CHANNEL0 and CHANNEL1 samples will be swapped when writing the Audio DAC Sample Data Register (SDR) */
#define ABDACB_CR_ALTUPR            (0x1u <<  3) /**< \brief (ABDACB_CR) Alternative up-sampling ratio */
#define ABDACB_CR_CMOC              (0x1u <<  4) /**< \brief (ABDACB_CR) Common mode offset control */
#define ABDACB_CR_MONO              (0x1u <<  5) /**< \brief (ABDACB_CR) Mono mode */
#define ABDACB_CR_SWRST             (0x1u <<  7) /**< \brief (ABDACB_CR) Software reset */
#define ABDACB_CR_DATAFORMAT_Pos    16
#define ABDACB_CR_DATAFORMAT_Msk    (0x7u << ABDACB_CR_DATAFORMAT_Pos) /**< \brief (ABDACB_CR) Data word format */
#define ABDACB_CR_DATAFORMAT(value) ((ABDACB_CR_DATAFORMAT_Msk & ((value) << ABDACB_CR_DATAFORMAT_Pos)))
#define ABDACB_CR_FS_Pos            24
#define ABDACB_CR_FS_Msk            (0xFu << ABDACB_CR_FS_Pos) /**< \brief (ABDACB_CR) Sampling frequency */
#define ABDACB_CR_FS(value)         ((ABDACB_CR_FS_Msk & ((value) << ABDACB_CR_FS_Pos)))
/* -------- ABDACB_SDR0 : (ABDACB Offset: 0x04) Sample Data Register 0 -------- */
#define ABDACB_SDR0_DATA_Pos        0
#define ABDACB_SDR0_DATA_Msk        (0xFFFFFFFFu << ABDACB_SDR0_DATA_Pos) /**< \brief (ABDACB_SDR0) Sample Data */
#define ABDACB_SDR0_DATA(value)     ((ABDACB_SDR0_DATA_Msk & ((value) << ABDACB_SDR0_DATA_Pos)))
/* -------- ABDACB_SDR1 : (ABDACB Offset: 0x08) Sample Data Register 1 -------- */
#define ABDACB_SDR1_DATA_Pos        0
#define ABDACB_SDR1_DATA_Msk        (0xFFFFFFFFu << ABDACB_SDR1_DATA_Pos) /**< \brief (ABDACB_SDR1) Sample Data */
#define ABDACB_SDR1_DATA(value)     ((ABDACB_SDR1_DATA_Msk & ((value) << ABDACB_SDR1_DATA_Pos)))
/* -------- ABDACB_VCR0 : (ABDACB Offset: 0x0C) Volume Control Register 0 -------- */
#define ABDACB_VCR0_VOLUME_Pos      0
#define ABDACB_VCR0_VOLUME_Msk      (0x7FFFu << ABDACB_VCR0_VOLUME_Pos) /**< \brief (ABDACB_VCR0) Volume Control */
#define ABDACB_VCR0_VOLUME(value)   ((ABDACB_VCR0_VOLUME_Msk & ((value) << ABDACB_VCR0_VOLUME_Pos)))
#define ABDACB_VCR0_MUTE            (0x1u << 31) /**< \brief (ABDACB_VCR0) Mute */
/* -------- ABDACB_VCR1 : (ABDACB Offset: 0x10) Volume Control Register 1 -------- */
#define ABDACB_VCR1_VOLUME_Pos      0
#define ABDACB_VCR1_VOLUME_Msk      (0x7FFFu << ABDACB_VCR1_VOLUME_Pos) /**< \brief (ABDACB_VCR1) Volume Control */
#define ABDACB_VCR1_VOLUME(value)   ((ABDACB_VCR1_VOLUME_Msk & ((value) << ABDACB_VCR1_VOLUME_Pos)))
#define ABDACB_VCR1_MUTE            (0x1u << 31) /**< \brief (ABDACB_VCR1) Mute */
/* -------- ABDACB_IER : (ABDACB Offset: 0x14) Interrupt Enable Register -------- */
#define ABDACB_IER_TXRDY            (0x1u <<  1) /**< \brief (ABDACB_IER) Transmit Ready Interrupt Enable */
#define   ABDACB_IER_TXRDY_0        (0x0u <<  1) /**< \brief (ABDACB_IER) No effect */
#define   ABDACB_IER_TXRDY_1        (0x1u <<  1) /**< \brief (ABDACB_IER) Enables the Audio DAC TX Ready interrupt */
#define ABDACB_IER_TXUR             (0x1u <<  2) /**< \brief (ABDACB_IER) Transmit Underrun Interrupt Enable */
#define   ABDACB_IER_TXUR_0         (0x0u <<  2) /**< \brief (ABDACB_IER) No effect */
#define   ABDACB_IER_TXUR_1         (0x1u <<  2) /**< \brief (ABDACB_IER) Enables the Audio DAC Underrun interrupt */
/* -------- ABDACB_IDR : (ABDACB Offset: 0x18) Interupt Disable Register -------- */
#define ABDACB_IDR_TXRDY            (0x1u <<  1) /**< \brief (ABDACB_IDR) Transmit Ready Interrupt Disable */
#define   ABDACB_IDR_TXRDY_0        (0x0u <<  1) /**< \brief (ABDACB_IDR) No effect */
#define   ABDACB_IDR_TXRDY_1        (0x1u <<  1) /**< \brief (ABDACB_IDR) Disable the Audio DAC TX Ready interrupt */
#define ABDACB_IDR_TXUR             (0x1u <<  2) /**< \brief (ABDACB_IDR) Transmit Underrun Interrupt Disable */
#define   ABDACB_IDR_TXUR_0         (0x0u <<  2) /**< \brief (ABDACB_IDR) No effect */
#define   ABDACB_IDR_TXUR_1         (0x1u <<  2) /**< \brief (ABDACB_IDR) Disable the Audio DAC Underrun interrupt */
/* -------- ABDACB_IMR : (ABDACB Offset: 0x1C) Interrupt Mask Register -------- */
#define ABDACB_IMR_TXRDY            (0x1u <<  1) /**< \brief (ABDACB_IMR) Transmit Ready Interrupt Mask */
#define   ABDACB_IMR_TXRDY_0        (0x0u <<  1) /**< \brief (ABDACB_IMR) The Audio DAC TX Ready interrupt is disabled */
#define   ABDACB_IMR_TXRDY_1        (0x1u <<  1) /**< \brief (ABDACB_IMR) The Audio DAC TX Ready interrupt is enabled */
#define ABDACB_IMR_TXUR             (0x1u <<  2) /**< \brief (ABDACB_IMR) Transmit Underrun Interrupt Mask */
#define   ABDACB_IMR_TXUR_0         (0x0u <<  2) /**< \brief (ABDACB_IMR) The Audio DAC Underrun interrupt is disabled */
#define   ABDACB_IMR_TXUR_1         (0x1u <<  2) /**< \brief (ABDACB_IMR) The Audio DAC Underrun interrupt is enabled */
/* -------- ABDACB_SR : (ABDACB Offset: 0x20) Status Register -------- */
#define ABDACB_SR_BUSY              (0x1u <<  0) /**< \brief (ABDACB_SR) ABDACB Busy */
#define ABDACB_SR_TXRDY             (0x1u <<  1) /**< \brief (ABDACB_SR) Transmit Ready */
#define   ABDACB_SR_TXRDY_0         (0x0u <<  1) /**< \brief (ABDACB_SR) No Audio DAC TX Ready has occured since the last time ISR was read or since reset */
#define   ABDACB_SR_TXRDY_1         (0x1u <<  1) /**< \brief (ABDACB_SR) At least one Audio DAC TX Ready has occured since the last time ISR was read or since reset */
#define ABDACB_SR_TXUR              (0x1u <<  2) /**< \brief (ABDACB_SR) Transmit Underrun */
#define   ABDACB_SR_TXUR_0          (0x0u <<  2) /**< \brief (ABDACB_SR) No Audio DAC Underrun has occured since the last time ISR was read or since reset */
#define   ABDACB_SR_TXUR_1          (0x1u <<  2) /**< \brief (ABDACB_SR) At least one Audio DAC Underrun has occured since the last time ISR was read or since reset */
/* -------- ABDACB_SCR : (ABDACB Offset: 0x24) Status Clear Register -------- */
#define ABDACB_SCR_TXRDY            (0x1u <<  1) /**< \brief (ABDACB_SCR) Transmit Ready Interrupt Clear */
#define   ABDACB_SCR_TXRDY_0        (0x0u <<  1) /**< \brief (ABDACB_SCR) No effect */
#define   ABDACB_SCR_TXRDY_1        (0x1u <<  1) /**< \brief (ABDACB_SCR) Clear the Audio DAC TX Ready interrupt */
#define ABDACB_SCR_TXUR             (0x1u <<  2) /**< \brief (ABDACB_SCR) Transmit Underrun Interrupt Clear */
#define   ABDACB_SCR_TXUR_0         (0x0u <<  2) /**< \brief (ABDACB_SCR) No effect */
#define   ABDACB_SCR_TXUR_1         (0x1u <<  2) /**< \brief (ABDACB_SCR) Clear the Audio DAC Underrun interrupt */
/* -------- ABDACB_VERSION : (ABDACB Offset: 0x2C) Version Register -------- */
#define ABDACB_VERSION_VERSION_Pos    0
#define ABDACB_VERSION_VERSION_Msk    (0xFFFu << ABDACB_VERSION_VERSION_Pos) /**< \brief (ABDACB_VERSION) Version Number */
#define ABDACB_VERSION_VERSION(value) ((ABDACB_VERSION_VERSION_Msk & ((value) << ABDACB_VERSION_VERSION_Pos)))
#define ABDACB_VERSION_VARIANT_Pos    16
#define ABDACB_VERSION_VARIANT_Msk    (0xFu << ABDACB_VERSION_VARIANT_Pos) /**< \brief (ABDACB_VERSION) Variant Number */
#define ABDACB_VERSION_VARIANT(value) ((ABDACB_VERSION_VARIANT_Msk & ((value) << ABDACB_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR ACIFC */
/* ============================================================================= */
/** \addtogroup SAM4L4_ACIFC Analog Comparator Interface */
/*@{*/

#define REV_ACIFC      0x101

