Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief AcifcConf hardware registers */
typedef struct {
  RwReg   CONF;        /**< \brief (AcifcConf Offset: 0x00) AC Configuration Register */
} AcifcConf;
/** \brief AcifcConfw hardware registers */
typedef struct {
  RwReg   CONFW;       /**< \brief (AcifcConfw Offset: 0x00) Window configuration Register */
} AcifcConfw;
/** \brief ACIFC hardware registers */
typedef struct {
  RwReg   CTRL;        /**< \brief (ACIFC Offset: 0x00) Control Register */
  RoReg   SR;          /**< \brief (ACIFC Offset: 0x04) Status Register */
  RoReg   Reserved1[2];
  WoReg   IER;         /**< \brief (ACIFC Offset: 0x10) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (ACIFC Offset: 0x14) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (ACIFC Offset: 0x18) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (ACIFC Offset: 0x1C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (ACIFC Offset: 0x20) Interrupt Status Clear Register */
  RwReg   TR;          /**< \brief (ACIFC Offset: 0x24) Test Register */
  RoReg   Reserved2[2];
  RoReg   PARAMETER;   /**< \brief (ACIFC Offset: 0x30) Parameter Register */
  RoReg   VERSION;     /**< \brief (ACIFC Offset: 0x34) Version Register */
  RoReg   Reserved3[18];
  AcifcConfw Confw[4]; /**< \brief (ACIFC Offset: 0x80) AcifcConfw groups */
  RoReg   Reserved4[16];
  AcifcConf Conf[8]; /**< \brief (ACIFC Offset: 0xD0) AcifcConf groups */
} Acifc;
#endif /* __ASSEMBLY__ */
/* -------- ACIFC_CTRL : (ACIFC Offset: 0x00) Control Register -------- */
#define ACIFC_CTRL_EN               (0x1u <<  0) /**< \brief (ACIFC_CTRL) ACIFC Enable */
#define ACIFC_CTRL_EVENTEN          (0x1u <<  1) /**< \brief (ACIFC_CTRL) Peripheral Event Trigger Enable */
#define ACIFC_CTRL_USTART           (0x1u <<  4) /**< \brief (ACIFC_CTRL) User Start Single Comparison */
#define ACIFC_CTRL_ESTART           (0x1u <<  5) /**< \brief (ACIFC_CTRL) Peripheral Event Start Single Comparison */
#define ACIFC_CTRL_ACTEST           (0x1u <<  7) /**< \brief (ACIFC_CTRL) Analog Comparator Test Mode */
/* -------- ACIFC_SR : (ACIFC Offset: 0x04) Status Register -------- */
#define ACIFC_SR_ACCS0              (0x1u <<  0) /**< \brief (ACIFC_SR) AC0 Current Comparison Status */
#define ACIFC_SR_ACRDY0             (0x1u <<  1) /**< \brief (ACIFC_SR) AC0 Ready */
#define ACIFC_SR_ACCS1              (0x1u <<  2) /**< \brief (ACIFC_SR) AC1 Current Comparison Status */
#define ACIFC_SR_ACRDY1             (0x1u <<  3) /**< \brief (ACIFC_SR) AC1 Ready */
#define ACIFC_SR_ACCS2              (0x1u <<  4) /**< \brief (ACIFC_SR) AC2 Current Comparison Status */
#define ACIFC_SR_ACRDY2             (0x1u <<  5) /**< \brief (ACIFC_SR) AC2 Ready */
#define ACIFC_SR_ACCS3              (0x1u <<  6) /**< \brief (ACIFC_SR) AC3 Current Comparison Status */
#define ACIFC_SR_ACRDY3             (0x1u <<  7) /**< \brief (ACIFC_SR) AC3 Ready */
#define ACIFC_SR_ACCS4              (0x1u <<  8) /**< \brief (ACIFC_SR) AC4 Current Comparison Status */
#define ACIFC_SR_ACRDY4             (0x1u <<  9) /**< \brief (ACIFC_SR) AC4 Ready */
#define ACIFC_SR_ACCS5              (0x1u << 10) /**< \brief (ACIFC_SR) AC5 Current Comparison Status */
#define ACIFC_SR_ACRDY5             (0x1u << 11) /**< \brief (ACIFC_SR) AC5 Ready */
#define ACIFC_SR_ACCS6              (0x1u << 12) /**< \brief (ACIFC_SR) AC6 Current Comparison Status */
#define ACIFC_SR_ACRDY6             (0x1u << 13) /**< \brief (ACIFC_SR) AC6 Ready */
#define ACIFC_SR_ACCS7              (0x1u << 14) /**< \brief (ACIFC_SR) AC7 Current Comparison Status */
#define ACIFC_SR_ACRDY7             (0x1u << 15) /**< \brief (ACIFC_SR) AC7 Ready */
#define ACIFC_SR_WFCS0              (0x1u << 24) /**< \brief (ACIFC_SR) Window0 Mode Current Status */
#define ACIFC_SR_WFCS1              (0x1u << 25) /**< \brief (ACIFC_SR) Window1 Mode Current Status */
#define ACIFC_SR_WFCS2              (0x1u << 26) /**< \brief (ACIFC_SR) Window2 Mode Current Status */
#define ACIFC_SR_WFCS3              (0x1u << 27) /**< \brief (ACIFC_SR) Window3 Mode Current Status */
/* -------- ACIFC_IER : (ACIFC Offset: 0x10) Interrupt Enable Register -------- */
#define ACIFC_IER_ACINT0            (0x1u <<  0) /**< \brief (ACIFC_IER) AC0 Interrupt Enable */
#define ACIFC_IER_SUTINT0           (0x1u <<  1) /**< \brief (ACIFC_IER) AC0 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT1            (0x1u <<  2) /**< \brief (ACIFC_IER) AC1 Interrupt Enable */
#define ACIFC_IER_SUTINT1           (0x1u <<  3) /**< \brief (ACIFC_IER) AC1 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT2            (0x1u <<  4) /**< \brief (ACIFC_IER) AC2 Interrupt Enable */
#define ACIFC_IER_SUTINT2           (0x1u <<  5) /**< \brief (ACIFC_IER) AC2 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT3            (0x1u <<  6) /**< \brief (ACIFC_IER) AC3 Interrupt Enable */
#define ACIFC_IER_SUTINT3           (0x1u <<  7) /**< \brief (ACIFC_IER) AC3 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT4            (0x1u <<  8) /**< \brief (ACIFC_IER) AC4 Interrupt Enable */
#define ACIFC_IER_SUTINT4           (0x1u <<  9) /**< \brief (ACIFC_IER) AC4 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT5            (0x1u << 10) /**< \brief (ACIFC_IER) AC5 Interrupt Enable */
#define ACIFC_IER_SUTINT5           (0x1u << 11) /**< \brief (ACIFC_IER) AC5 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT6            (0x1u << 12) /**< \brief (ACIFC_IER) AC6 Interrupt Enable */
#define ACIFC_IER_SUTINT6           (0x1u << 13) /**< \brief (ACIFC_IER) AC6 Startup Time Interrupt Enable */
#define ACIFC_IER_ACINT7            (0x1u << 14) /**< \brief (ACIFC_IER) AC7 Interrupt Enable */
#define ACIFC_IER_SUTINT7           (0x1u << 15) /**< \brief (ACIFC_IER) AC7 Startup Time Interrupt Enable */
#define ACIFC_IER_WFINT0            (0x1u << 24) /**< \brief (ACIFC_IER) Window0 Mode Interrupt Enable */
#define ACIFC_IER_WFINT1            (0x1u << 25) /**< \brief (ACIFC_IER) Window1 Mode Interrupt Enable */
#define ACIFC_IER_WFINT2            (0x1u << 26) /**< \brief (ACIFC_IER) Window2 Mode Interrupt Enable */
#define ACIFC_IER_WFINT3            (0x1u << 27) /**< \brief (ACIFC_IER) Window3 Mode Interrupt Enable */
/* -------- ACIFC_IDR : (ACIFC Offset: 0x14) Interrupt Disable Register -------- */
#define ACIFC_IDR_ACINT0            (0x1u <<  0) /**< \brief (ACIFC_IDR) AC0 Interrupt Disable */
#define ACIFC_IDR_SUTINT0           (0x1u <<  1) /**< \brief (ACIFC_IDR) AC0 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT1            (0x1u <<  2) /**< \brief (ACIFC_IDR) AC1 Interrupt Disable */
#define ACIFC_IDR_SUTINT1           (0x1u <<  3) /**< \brief (ACIFC_IDR) AC1 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT2            (0x1u <<  4) /**< \brief (ACIFC_IDR) AC2 Interrupt Disable */
#define ACIFC_IDR_SUTINT2           (0x1u <<  5) /**< \brief (ACIFC_IDR) AC2 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT3            (0x1u <<  6) /**< \brief (ACIFC_IDR) AC3 Interrupt Disable */
#define ACIFC_IDR_SUTINT3           (0x1u <<  7) /**< \brief (ACIFC_IDR) AC3 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT4            (0x1u <<  8) /**< \brief (ACIFC_IDR) AC4 Interrupt Disable */
#define ACIFC_IDR_SUTINT4           (0x1u <<  9) /**< \brief (ACIFC_IDR) AC4 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT5            (0x1u << 10) /**< \brief (ACIFC_IDR) AC5 Interrupt Disable */
#define ACIFC_IDR_SUTINT5           (0x1u << 11) /**< \brief (ACIFC_IDR) AC5 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT6            (0x1u << 12) /**< \brief (ACIFC_IDR) AC6 Interrupt Disable */
#define ACIFC_IDR_SUTINT6           (0x1u << 13) /**< \brief (ACIFC_IDR) AC6 Startup Time Interrupt Disable */
#define ACIFC_IDR_ACINT7            (0x1u << 14) /**< \brief (ACIFC_IDR) AC7 Interrupt Disable */
#define ACIFC_IDR_SUTINT7           (0x1u << 15) /**< \brief (ACIFC_IDR) AC7 Startup Time Interrupt Disable */
#define ACIFC_IDR_WFINT0            (0x1u << 24) /**< \brief (ACIFC_IDR) Window0 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT1            (0x1u << 25) /**< \brief (ACIFC_IDR) Window1 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT2            (0x1u << 26) /**< \brief (ACIFC_IDR) Window2 Mode Interrupt Disable */
#define ACIFC_IDR_WFINT3            (0x1u << 27) /**< \brief (ACIFC_IDR) Window3 Mode Interrupt Disable */
/* -------- ACIFC_IMR : (ACIFC Offset: 0x18) Interrupt Mask Register -------- */
#define ACIFC_IMR_ACINT0            (0x1u <<  0) /**< \brief (ACIFC_IMR) AC0 Interrupt Mask */
#define ACIFC_IMR_SUTINT0           (0x1u <<  1) /**< \brief (ACIFC_IMR) AC0 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT1            (0x1u <<  2) /**< \brief (ACIFC_IMR) AC1 Interrupt Mask */
#define ACIFC_IMR_SUTINT1           (0x1u <<  3) /**< \brief (ACIFC_IMR) AC1 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT2            (0x1u <<  4) /**< \brief (ACIFC_IMR) AC2 Interrupt Mask */
#define ACIFC_IMR_SUTINT2           (0x1u <<  5) /**< \brief (ACIFC_IMR) AC2 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT3            (0x1u <<  6) /**< \brief (ACIFC_IMR) AC3 Interrupt Mask */
#define ACIFC_IMR_SUTINT3           (0x1u <<  7) /**< \brief (ACIFC_IMR) AC3 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT4            (0x1u <<  8) /**< \brief (ACIFC_IMR) AC4 Interrupt Mask */
#define ACIFC_IMR_SUTINT4           (0x1u <<  9) /**< \brief (ACIFC_IMR) AC4 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT5            (0x1u << 10) /**< \brief (ACIFC_IMR) AC5 Interrupt Mask */
#define ACIFC_IMR_SUTINT5           (0x1u << 11) /**< \brief (ACIFC_IMR) AC5 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT6            (0x1u << 12) /**< \brief (ACIFC_IMR) AC6 Interrupt Mask */
#define ACIFC_IMR_SUTINT6           (0x1u << 13) /**< \brief (ACIFC_IMR) AC6 Startup Time Interrupt Mask */
#define ACIFC_IMR_ACINT7            (0x1u << 14) /**< \brief (ACIFC_IMR) AC7 Interrupt Mask */
#define ACIFC_IMR_SUTINT7           (0x1u << 15) /**< \brief (ACIFC_IMR) AC7 Startup Time Interrupt Mask */
#define ACIFC_IMR_WFINT0            (0x1u << 24) /**< \brief (ACIFC_IMR) Window0 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT1            (0x1u << 25) /**< \brief (ACIFC_IMR) Window1 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT2            (0x1u << 26) /**< \brief (ACIFC_IMR) Window2 Mode Interrupt Mask */
#define ACIFC_IMR_WFINT3            (0x1u << 27) /**< \brief (ACIFC_IMR) Window3 Mode Interrupt Mask */
/* -------- ACIFC_ISR : (ACIFC Offset: 0x1C) Interrupt Status Register -------- */
#define ACIFC_ISR_ACINT0            (0x1u <<  0) /**< \brief (ACIFC_ISR) AC0 Interrupt Status */
#define ACIFC_ISR_SUTINT0           (0x1u <<  1) /**< \brief (ACIFC_ISR) AC0 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT1            (0x1u <<  2) /**< \brief (ACIFC_ISR) AC1 Interrupt Status */
#define ACIFC_ISR_SUTINT1           (0x1u <<  3) /**< \brief (ACIFC_ISR) AC1 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT2            (0x1u <<  4) /**< \brief (ACIFC_ISR) AC2 Interrupt Status */
#define ACIFC_ISR_SUTINT2           (0x1u <<  5) /**< \brief (ACIFC_ISR) AC2 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT3            (0x1u <<  6) /**< \brief (ACIFC_ISR) AC3 Interrupt Status */
#define ACIFC_ISR_SUTINT3           (0x1u <<  7) /**< \brief (ACIFC_ISR) AC3 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT4            (0x1u <<  8) /**< \brief (ACIFC_ISR) AC4 Interrupt Status */
#define ACIFC_ISR_SUTINT4           (0x1u <<  9) /**< \brief (ACIFC_ISR) AC4 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT5            (0x1u << 10) /**< \brief (ACIFC_ISR) AC5 Interrupt Status */
#define ACIFC_ISR_SUTINT5           (0x1u << 11) /**< \brief (ACIFC_ISR) AC5 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT6            (0x1u << 12) /**< \brief (ACIFC_ISR) AC6 Interrupt Status */
#define ACIFC_ISR_SUTINT6           (0x1u << 13) /**< \brief (ACIFC_ISR) AC6 Startup Time Interrupt Status */
#define ACIFC_ISR_ACINT7            (0x1u << 14) /**< \brief (ACIFC_ISR) AC7 Interrupt Status */
#define ACIFC_ISR_SUTINT7           (0x1u << 15) /**< \brief (ACIFC_ISR) AC7 Startup Time Interrupt Status */
#define ACIFC_ISR_WFINT0            (0x1u << 24) /**< \brief (ACIFC_ISR) Window0 Mode Interrupt Status */
#define ACIFC_ISR_WFINT1            (0x1u << 25) /**< \brief (ACIFC_ISR) Window1 Mode Interrupt Status */
#define ACIFC_ISR_WFINT2            (0x1u << 26) /**< \brief (ACIFC_ISR) Window2 Mode Interrupt Status */
#define ACIFC_ISR_WFINT3            (0x1u << 27) /**< \brief (ACIFC_ISR) Window3 Mode Interrupt Status */
/* -------- ACIFC_ICR : (ACIFC Offset: 0x20) Interrupt Status Clear Register -------- */
#define ACIFC_ICR_ACINT0            (0x1u <<  0) /**< \brief (ACIFC_ICR) AC0 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT0           (0x1u <<  1) /**< \brief (ACIFC_ICR) AC0 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT1            (0x1u <<  2) /**< \brief (ACIFC_ICR) AC1 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT1           (0x1u <<  3) /**< \brief (ACIFC_ICR) AC1 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT2            (0x1u <<  4) /**< \brief (ACIFC_ICR) AC2 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT2           (0x1u <<  5) /**< \brief (ACIFC_ICR) AC2 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT3            (0x1u <<  6) /**< \brief (ACIFC_ICR) AC3 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT3           (0x1u <<  7) /**< \brief (ACIFC_ICR) AC3 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT4            (0x1u <<  8) /**< \brief (ACIFC_ICR) AC4 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT4           (0x1u <<  9) /**< \brief (ACIFC_ICR) AC4 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT5            (0x1u << 10) /**< \brief (ACIFC_ICR) AC5 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT5           (0x1u << 11) /**< \brief (ACIFC_ICR) AC5 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT6            (0x1u << 12) /**< \brief (ACIFC_ICR) AC6 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT6           (0x1u << 13) /**< \brief (ACIFC_ICR) AC6 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_ACINT7            (0x1u << 14) /**< \brief (ACIFC_ICR) AC7 Interrupt Status Clear */
#define ACIFC_ICR_SUTINT7           (0x1u << 15) /**< \brief (ACIFC_ICR) AC7 Startup Time Interrupt Status Clear */
#define ACIFC_ICR_WFINT0            (0x1u << 24) /**< \brief (ACIFC_ICR) Window0 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT1            (0x1u << 25) /**< \brief (ACIFC_ICR) Window1 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT2            (0x1u << 26) /**< \brief (ACIFC_ICR) Window2 Mode Interrupt Status Clear */
#define ACIFC_ICR_WFINT3            (0x1u << 27) /**< \brief (ACIFC_ICR) Window3 Mode Interrupt Status Clear */
/* -------- ACIFC_TR : (ACIFC Offset: 0x24) Test Register -------- */
#define ACIFC_TR_ACTEST0            (0x1u <<  0) /**< \brief (ACIFC_TR) AC0 Output Override Value */
#define ACIFC_TR_ACTEST1            (0x1u <<  1) /**< \brief (ACIFC_TR) AC1 Output Override Value */
#define ACIFC_TR_ACTEST2            (0x1u <<  2) /**< \brief (ACIFC_TR) AC2 Output Override Value */
#define ACIFC_TR_ACTEST3            (0x1u <<  3) /**< \brief (ACIFC_TR) AC3 Output Override Value */
#define ACIFC_TR_ACTEST4            (0x1u <<  4) /**< \brief (ACIFC_TR) AC4 Output Override Value */
#define ACIFC_TR_ACTEST5            (0x1u <<  5) /**< \brief (ACIFC_TR) AC5 Output Override Value */
#define ACIFC_TR_ACTEST6            (0x1u <<  6) /**< \brief (ACIFC_TR) AC6 Output Override Value */
#define ACIFC_TR_ACTEST7            (0x1u <<  7) /**< \brief (ACIFC_TR) AC7 Output Override Value */
/* -------- ACIFC_PARAMETER : (ACIFC Offset: 0x30) Parameter Register -------- */
#define ACIFC_PARAMETER_ACIMPL0     (0x1u <<  0) /**< \brief (ACIFC_PARAMETER) Analog Comparator 0 Implemented */
#define ACIFC_PARAMETER_ACIMPL1     (0x1u <<  1) /**< \brief (ACIFC_PARAMETER) Analog Comparator 1 Implemented */
#define ACIFC_PARAMETER_ACIMPL2     (0x1u <<  2) /**< \brief (ACIFC_PARAMETER) Analog Comparator 2 Implemented */
#define ACIFC_PARAMETER_ACIMPL3     (0x1u <<  3) /**< \brief (ACIFC_PARAMETER) Analog Comparator 3 Implemented */
#define ACIFC_PARAMETER_ACIMPL4     (0x1u <<  4) /**< \brief (ACIFC_PARAMETER) Analog Comparator 4 Implemented */
#define ACIFC_PARAMETER_ACIMPL5     (0x1u <<  5) /**< \brief (ACIFC_PARAMETER) Analog Comparator 5 Implemented */
#define ACIFC_PARAMETER_ACIMPL6     (0x1u <<  6) /**< \brief (ACIFC_PARAMETER) Analog Comparator 6 Implemented */
#define ACIFC_PARAMETER_ACIMPL7     (0x1u <<  7) /**< \brief (ACIFC_PARAMETER) Analog Comparator 7 Implemented */
#define ACIFC_PARAMETER_WIMPL0      (0x1u << 16) /**< \brief (ACIFC_PARAMETER) Window0 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL1      (0x1u << 17) /**< \brief (ACIFC_PARAMETER) Window1 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL2      (0x1u << 18) /**< \brief (ACIFC_PARAMETER) Window2 Mode  Implemented */
#define ACIFC_PARAMETER_WIMPL3      (0x1u << 19) /**< \brief (ACIFC_PARAMETER) Window3 Mode  Implemented */
/* -------- ACIFC_VERSION : (ACIFC Offset: 0x34) Version Register -------- */
#define ACIFC_VERSION_VERSION_Pos    0
#define ACIFC_VERSION_VERSION_Msk    (0xFFFu << ACIFC_VERSION_VERSION_Pos) /**< \brief (ACIFC_VERSION) Version Number */
#define ACIFC_VERSION_VERSION(value) ((ACIFC_VERSION_VERSION_Msk & ((value) << ACIFC_VERSION_VERSION_Pos)))
#define ACIFC_VERSION_VARIANT_Pos    16
#define ACIFC_VERSION_VARIANT_Msk    (0xFu << ACIFC_VERSION_VARIANT_Pos) /**< \brief (ACIFC_VERSION) Variant Number */
#define ACIFC_VERSION_VARIANT(value) ((ACIFC_VERSION_VARIANT_Msk & ((value) << ACIFC_VERSION_VARIANT_Pos)))
/* -------- ACIFC_CONFW : (ACIFC Offset: 0x80) Confw Window configuration Register -------- */
#define ACIFC_CONFW_WIS_Pos         0
#define ACIFC_CONFW_WIS_Msk         (0x7u << ACIFC_CONFW_WIS_Pos) /**< \brief (ACIFC_CONFW) Window Mode Interrupt Settings */
#define ACIFC_CONFW_WIS(value)      ((ACIFC_CONFW_WIS_Msk & ((value) << ACIFC_CONFW_WIS_Pos)))
#define ACIFC_CONFW_WEVSRC_Pos      8
#define ACIFC_CONFW_WEVSRC_Msk      (0x7u << ACIFC_CONFW_WEVSRC_Pos) /**< \brief (ACIFC_CONFW) Peripheral Event Sourse Selection for Window Mode */
#define ACIFC_CONFW_WEVSRC(value)   ((ACIFC_CONFW_WEVSRC_Msk & ((value) << ACIFC_CONFW_WEVSRC_Pos)))
#define ACIFC_CONFW_WEVEN           (0x1u << 11) /**< \brief (ACIFC_CONFW) Window Peripheral Event Enable */
#define ACIFC_CONFW_WFEN            (0x1u << 16) /**< \brief (ACIFC_CONFW) Window Mode Enable */
/* -------- ACIFC_CONF : (ACIFC Offset: 0xD0) Conf AC Configuration Register -------- */
#define ACIFC_CONF_IS_Pos           0
#define ACIFC_CONF_IS_Msk           (0x3u << ACIFC_CONF_IS_Pos) /**< \brief (ACIFC_CONF) Interupt Settings */
#define ACIFC_CONF_IS(value)        ((ACIFC_CONF_IS_Msk & ((value) << ACIFC_CONF_IS_Pos)))
#define ACIFC_CONF_MODE_Pos         4
#define ACIFC_CONF_MODE_Msk         (0x3u << ACIFC_CONF_MODE_Pos) /**< \brief (ACIFC_CONF) Analog Comparator Mode */
#define ACIFC_CONF_MODE(value)      ((ACIFC_CONF_MODE_Msk & ((value) << ACIFC_CONF_MODE_Pos)))
#define ACIFC_CONF_INSELN_Pos       8
#define ACIFC_CONF_INSELN_Msk       (0x3u << ACIFC_CONF_INSELN_Pos) /**< \brief (ACIFC_CONF) Negative Input Select */
#define ACIFC_CONF_INSELN(value)    ((ACIFC_CONF_INSELN_Msk & ((value) << ACIFC_CONF_INSELN_Pos)))
#define ACIFC_CONF_EVENN            (0x1u << 16) /**< \brief (ACIFC_CONF) Peripheral Event Enable Negative */
#define ACIFC_CONF_EVENP            (0x1u << 17) /**< \brief (ACIFC_CONF) Peripheral Event Enable Positive */
#define ACIFC_CONF_HYS_Pos          24
#define ACIFC_CONF_HYS_Msk          (0x3u << ACIFC_CONF_HYS_Pos) /**< \brief (ACIFC_CONF) Hysteresis Voltage Value */
#define ACIFC_CONF_HYS(value)       ((ACIFC_CONF_HYS_Msk & ((value) << ACIFC_CONF_HYS_Pos)))
#define ACIFC_CONF_FAST             (0x1u << 26) /**< \brief (ACIFC_CONF) Fast Mode Enable */
#define ACIFC_CONF_ALWAYSON         (0x1u << 27) /**< \brief (ACIFC_CONF) Always On */

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR ADCIFE */
/* ============================================================================= */
/** \addtogroup SAM4L4_ADCIFE ADC controller interface */
/*@{*/

#define REV_ADCIFE     0x100

