Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief ADCIFE hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (ADCIFE Offset: 0x00) Control Register */
  RwReg   CFG;         /**< \brief (ADCIFE Offset: 0x04) Configuration Register */
  RoReg   SR;          /**< \brief (ADCIFE Offset: 0x08) Status Register */
  WoReg   SCR;         /**< \brief (ADCIFE Offset: 0x0C) Status Clear Register */
  RwReg   RTS;         /**< \brief (ADCIFE Offset: 0x10) Resistive Touch Screen Register */
  RwReg   SEQCFG;      /**< \brief (ADCIFE Offset: 0x14) Sequencer Configuration Register */
  WoReg   CDMA;        /**< \brief (ADCIFE Offset: 0x18) Configuration Direct Memory Access Register */
  RwReg   TIM;         /**< \brief (ADCIFE Offset: 0x1C) Timing Configuration Register */
  RwReg   ITIMER;      /**< \brief (ADCIFE Offset: 0x20) Internal Timer Register */
  RwReg   WCFG;        /**< \brief (ADCIFE Offset: 0x24) Window Monitor Configuration Register */
  RwReg   WTH;         /**< \brief (ADCIFE Offset: 0x28) Window Monitor Threshold Configuration Register */
  RoReg   LCV;         /**< \brief (ADCIFE Offset: 0x2C) Sequencer Last Converted Value Register */
  WoReg   IER;         /**< \brief (ADCIFE Offset: 0x30) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (ADCIFE Offset: 0x34) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (ADCIFE Offset: 0x38) Interrupt Mask Register */
  RwReg   CALIB;       /**< \brief (ADCIFE Offset: 0x3C) Calibration Register */
  RoReg   VERSION;     /**< \brief (ADCIFE Offset: 0x40) Version Register */
  RoReg   PARAMETER;   /**< \brief (ADCIFE Offset: 0x44) Parameter Register */
} Adcife;
#endif /* __ASSEMBLY__ */
/* -------- ADCIFE_CR : (ADCIFE Offset: 0x00) Control Register -------- */
#define ADCIFE_CR_SWRST             (0x1u <<  0) /**< \brief (ADCIFE_CR) Software reset */
#define ADCIFE_CR_TSTOP             (0x1u <<  1) /**< \brief (ADCIFE_CR) Internal timer stop bit */
#define ADCIFE_CR_TSTART            (0x1u <<  2) /**< \brief (ADCIFE_CR) Internal timer start bit */
#define ADCIFE_CR_STRIG             (0x1u <<  3) /**< \brief (ADCIFE_CR) Sequencer trigger */
#define ADCIFE_CR_REFBUFEN          (0x1u <<  4) /**< \brief (ADCIFE_CR) Reference buffer enable */
#define ADCIFE_CR_REFBUFDIS         (0x1u <<  5) /**< \brief (ADCIFE_CR) Reference buffer disable */
#define ADCIFE_CR_EN                (0x1u <<  8) /**< \brief (ADCIFE_CR) ADCIFD enable */
#define ADCIFE_CR_DIS               (0x1u <<  9) /**< \brief (ADCIFE_CR) ADCIFD disable */
#define ADCIFE_CR_BGREQEN           (0x1u << 10) /**< \brief (ADCIFE_CR) Bandgap buffer request enable */
#define ADCIFE_CR_BGREQDIS          (0x1u << 11) /**< \brief (ADCIFE_CR) Bandgap buffer request disable */
/* -------- ADCIFE_CFG : (ADCIFE Offset: 0x04) Configuration Register -------- */
#define ADCIFE_CFG_REFSEL_Pos       1
#define ADCIFE_CFG_REFSEL_Msk       (0x7u << ADCIFE_CFG_REFSEL_Pos) /**< \brief (ADCIFE_CFG) ADC Reference Selection */
#define ADCIFE_CFG_REFSEL(value)    ((ADCIFE_CFG_REFSEL_Msk & ((value) << ADCIFE_CFG_REFSEL_Pos)))
#define ADCIFE_CFG_SPEED_Pos        4
#define ADCIFE_CFG_SPEED_Msk        (0x3u << ADCIFE_CFG_SPEED_Pos) /**< \brief (ADCIFE_CFG) ADC current reduction */
#define ADCIFE_CFG_SPEED(value)     ((ADCIFE_CFG_SPEED_Msk & ((value) << ADCIFE_CFG_SPEED_Pos)))
#define ADCIFE_CFG_CLKSEL           (0x1u <<  6) /**< \brief (ADCIFE_CFG) Clock Selection for sequencer/ADC cell */
#define ADCIFE_CFG_PRESCAL_Pos      8
#define ADCIFE_CFG_PRESCAL_Msk      (0x7u << ADCIFE_CFG_PRESCAL_Pos) /**< \brief (ADCIFE_CFG) Prescaler Rate Selection */
#define ADCIFE_CFG_PRESCAL(value)   ((ADCIFE_CFG_PRESCAL_Msk & ((value) << ADCIFE_CFG_PRESCAL_Pos)))
/* -------- ADCIFE_SR : (ADCIFE Offset: 0x08) Status Register -------- */
#define ADCIFE_SR_SEOC              (0x1u <<  0) /**< \brief (ADCIFE_SR) Sequencer end of conversion */
#define ADCIFE_SR_LOVR              (0x1u <<  1) /**< \brief (ADCIFE_SR) Sequencer last converted value overrun */
#define ADCIFE_SR_WM                (0x1u <<  2) /**< \brief (ADCIFE_SR) Window monitor */
#define ADCIFE_SR_SMTRG             (0x1u <<  3) /**< \brief (ADCIFE_SR) Sequencer missed trigger event */
#define ADCIFE_SR_SUTD              (0x1u <<  4) /**< \brief (ADCIFE_SR) Start-up time done */
#define ADCIFE_SR_TTO               (0x1u <<  5) /**< \brief (ADCIFE_SR) Timer time-out */
#define ADCIFE_SR_EN                (0x1u << 24) /**< \brief (ADCIFE_SR) Enable Status */
#define ADCIFE_SR_TBUSY             (0x1u << 25) /**< \brief (ADCIFE_SR) Timer busy */
#define ADCIFE_SR_SBUSY             (0x1u << 26) /**< \brief (ADCIFE_SR) Sequencer busy */
#define ADCIFE_SR_CBUSY             (0x1u << 27) /**< \brief (ADCIFE_SR) Conversion busy */
#define ADCIFE_SR_REFBUF            (0x1u << 28) /**< \brief (ADCIFE_SR) Reference buffer status */
/* -------- ADCIFE_SCR : (ADCIFE Offset: 0x0C) Status Clear Register -------- */
#define ADCIFE_SCR_SEOC             (0x1u <<  0) /**< \brief (ADCIFE_SCR) Sequencer end of conversion */
#define ADCIFE_SCR_LOVR             (0x1u <<  1) /**< \brief (ADCIFE_SCR) Sequencer last converted value overrun */
#define ADCIFE_SCR_WM               (0x1u <<  2) /**< \brief (ADCIFE_SCR) Window monitor */
#define ADCIFE_SCR_SMTRG            (0x1u <<  3) /**< \brief (ADCIFE_SCR) Sequencer missed trigger event */
#define ADCIFE_SCR_SUTD             (0x1u <<  4) /**< \brief (ADCIFE_SCR) Start-up time done */
#define ADCIFE_SCR_TTO              (0x1u <<  5) /**< \brief (ADCIFE_SCR) Timer time-out */
/* -------- ADCIFE_RTS : (ADCIFE Offset: 0x10) Resistive Touch Screen Register -------- */
/* -------- ADCIFE_SEQCFG : (ADCIFE Offset: 0x14) Sequencer Configuration Register -------- */
#define ADCIFE_SEQCFG_HWLA          (0x1u <<  0) /**< \brief (ADCIFE_SEQCFG) Half word left adjust */
#define ADCIFE_SEQCFG_BIPOLAR       (0x1u <<  2) /**< \brief (ADCIFE_SEQCFG) Bipolar Mode */
#define ADCIFE_SEQCFG_GAIN_Pos      4
#define ADCIFE_SEQCFG_GAIN_Msk      (0x7u << ADCIFE_SEQCFG_GAIN_Pos) /**< \brief (ADCIFE_SEQCFG) Gain factor */
#define ADCIFE_SEQCFG_GAIN(value)   ((ADCIFE_SEQCFG_GAIN_Msk & ((value) << ADCIFE_SEQCFG_GAIN_Pos)))
#define ADCIFE_SEQCFG_GCOMP         (0x1u <<  7) /**< \brief (ADCIFE_SEQCFG) Gain Compensation */
#define ADCIFE_SEQCFG_TRGSEL_Pos    8
#define ADCIFE_SEQCFG_TRGSEL_Msk    (0x7u << ADCIFE_SEQCFG_TRGSEL_Pos) /**< \brief (ADCIFE_SEQCFG) Trigger selection */
#define ADCIFE_SEQCFG_TRGSEL(value) ((ADCIFE_SEQCFG_TRGSEL_Msk & ((value) << ADCIFE_SEQCFG_TRGSEL_Pos)))
#define ADCIFE_SEQCFG_RES           (0x1u << 12) /**< \brief (ADCIFE_SEQCFG) Resolution */
#define ADCIFE_SEQCFG_INTERNAL_Pos    14
#define ADCIFE_SEQCFG_INTERNAL_Msk    (0x3u << ADCIFE_SEQCFG_INTERNAL_Pos) /**< \brief (ADCIFE_SEQCFG) Internal Voltage Source Selection */
#define ADCIFE_SEQCFG_INTERNAL(value) ((ADCIFE_SEQCFG_INTERNAL_Msk & ((value) << ADCIFE_SEQCFG_INTERNAL_Pos)))
#define ADCIFE_SEQCFG_MUXPOS_Pos    16
#define ADCIFE_SEQCFG_MUXPOS_Msk    (0xFu << ADCIFE_SEQCFG_MUXPOS_Pos) /**< \brief (ADCIFE_SEQCFG) MUX selection on Positive ADC input channel */
#define ADCIFE_SEQCFG_MUXPOS(value) ((ADCIFE_SEQCFG_MUXPOS_Msk & ((value) << ADCIFE_SEQCFG_MUXPOS_Pos)))
#define ADCIFE_SEQCFG_MUXNEG_Pos    20
#define ADCIFE_SEQCFG_MUXNEG_Msk    (0x7u << ADCIFE_SEQCFG_MUXNEG_Pos) /**< \brief (ADCIFE_SEQCFG) MUX selection on Negative ADC input channel */
#define ADCIFE_SEQCFG_MUXNEG(value) ((ADCIFE_SEQCFG_MUXNEG_Msk & ((value) << ADCIFE_SEQCFG_MUXNEG_Pos)))
#define ADCIFE_SEQCFG_ZOOMRANGE_Pos    28
#define ADCIFE_SEQCFG_ZOOMRANGE_Msk    (0x7u << ADCIFE_SEQCFG_ZOOMRANGE_Pos) /**< \brief (ADCIFE_SEQCFG) Zoom shift/unipolar reference source selection */
#define ADCIFE_SEQCFG_ZOOMRANGE(value) ((ADCIFE_SEQCFG_ZOOMRANGE_Msk & ((value) << ADCIFE_SEQCFG_ZOOMRANGE_Pos)))
/* -------- ADCIFE_FIRST_DMA_WORD_CDMA : (ADCIFE Offset: 0x18) Configuration Direct Memory Access Register -------- */
#define ADCIFE_FIRST_DMA_WORD_CDMA_HWLA (0x1u <<  0) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_BIPOLAR (0x1u <<  2) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_STRIG (0x1u <<  3) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_GAIN_Pos    4
#define ADCIFE_FIRST_DMA_WORD_CDMA_GAIN_Msk    (0x7u << ADCIFE_FIRST_DMA_WORD_CDMA_GAIN_Pos) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_GAIN(value) ((ADCIFE_FIRST_DMA_WORD_CDMA_GAIN_Msk & ((value) << ADCIFE_FIRST_DMA_WORD_CDMA_GAIN_Pos)))
#define ADCIFE_FIRST_DMA_WORD_CDMA_GCOMP (0x1u <<  7) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_ENSTUP (0x1u <<  8) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_RES (0x1u << 12) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_TSS (0x1u << 13) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA) Internal timer start or stop bit */
#define ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL_Pos    14
#define ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL_Msk    (0x3u << ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL_Pos) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL(value) ((ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL_Msk & ((value) << ADCIFE_FIRST_DMA_WORD_CDMA_INTERNAL_Pos)))
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS_Pos    16
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS_Msk    (0xFu << ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS_Pos) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS(value) ((ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS_Msk & ((value) << ADCIFE_FIRST_DMA_WORD_CDMA_MUXPOS_Pos)))
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG_Pos    20
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG_Msk    (0x7u << ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG_Pos) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG(value) ((ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG_Msk & ((value) << ADCIFE_FIRST_DMA_WORD_CDMA_MUXNEG_Pos)))
#define ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE_Pos    28
#define ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE_Msk    (0x7u << ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE_Pos) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA)  */
#define ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE(value) ((ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE_Msk & ((value) << ADCIFE_FIRST_DMA_WORD_CDMA_ZOOMRANGE_Pos)))
#define ADCIFE_FIRST_DMA_WORD_CDMA_DW (0x1u << 31) /**< \brief (ADCIFE_FIRST_DMA_WORD_CDMA) Double Word transmitting */
/* -------- ADCIFE_SECOND_DMA_WORD_CDMA : (ADCIFE Offset: 0x18) Configuration Direct Memory Access Register -------- */
#define ADCIFE_SECOND_DMA_WORD_CDMA_LT_Pos    0
#define ADCIFE_SECOND_DMA_WORD_CDMA_LT_Msk    (0xFFFu << ADCIFE_SECOND_DMA_WORD_CDMA_LT_Pos) /**< \brief (ADCIFE_SECOND_DMA_WORD_CDMA)  */
#define ADCIFE_SECOND_DMA_WORD_CDMA_LT(value) ((ADCIFE_SECOND_DMA_WORD_CDMA_LT_Msk & ((value) << ADCIFE_SECOND_DMA_WORD_CDMA_LT_Pos)))
#define ADCIFE_SECOND_DMA_WORD_CDMA_WM_Pos    12
#define ADCIFE_SECOND_DMA_WORD_CDMA_WM_Msk    (0x7u << ADCIFE_SECOND_DMA_WORD_CDMA_WM_Pos) /**< \brief (ADCIFE_SECOND_DMA_WORD_CDMA)  */
#define ADCIFE_SECOND_DMA_WORD_CDMA_WM(value) ((ADCIFE_SECOND_DMA_WORD_CDMA_WM_Msk & ((value) << ADCIFE_SECOND_DMA_WORD_CDMA_WM_Pos)))
#define ADCIFE_SECOND_DMA_WORD_CDMA_HT_Pos    16
#define ADCIFE_SECOND_DMA_WORD_CDMA_HT_Msk    (0xFFFu << ADCIFE_SECOND_DMA_WORD_CDMA_HT_Pos) /**< \brief (ADCIFE_SECOND_DMA_WORD_CDMA)  */
#define ADCIFE_SECOND_DMA_WORD_CDMA_HT(value) ((ADCIFE_SECOND_DMA_WORD_CDMA_HT_Msk & ((value) << ADCIFE_SECOND_DMA_WORD_CDMA_HT_Pos)))
#define ADCIFE_SECOND_DMA_WORD_CDMA_DW (0x1u << 31) /**< \brief (ADCIFE_SECOND_DMA_WORD_CDMA)  */
/* -------- ADCIFE_TIM : (ADCIFE Offset: 0x1C) Timing Configuration Register -------- */
#define ADCIFE_TIM_STARTUP_Pos      0
#define ADCIFE_TIM_STARTUP_Msk      (0x1Fu << ADCIFE_TIM_STARTUP_Pos) /**< \brief (ADCIFE_TIM) Startup time */
#define ADCIFE_TIM_STARTUP(value)   ((ADCIFE_TIM_STARTUP_Msk & ((value) << ADCIFE_TIM_STARTUP_Pos)))
#define ADCIFE_TIM_ENSTUP           (0x1u <<  8) /**< \brief (ADCIFE_TIM) Enable Startup */
/* -------- ADCIFE_ITIMER : (ADCIFE Offset: 0x20) Internal Timer Register -------- */
#define ADCIFE_ITIMER_ITMC_Pos      0
#define ADCIFE_ITIMER_ITMC_Msk      (0xFFFFu << ADCIFE_ITIMER_ITMC_Pos) /**< \brief (ADCIFE_ITIMER) Internal timer max counter */
#define ADCIFE_ITIMER_ITMC(value)   ((ADCIFE_ITIMER_ITMC_Msk & ((value) << ADCIFE_ITIMER_ITMC_Pos)))
/* -------- ADCIFE_WCFG : (ADCIFE Offset: 0x24) Window Monitor Configuration Register -------- */
#define ADCIFE_WCFG_WM_Pos          12
#define ADCIFE_WCFG_WM_Msk          (0x7u << ADCIFE_WCFG_WM_Pos) /**< \brief (ADCIFE_WCFG) Window Monitor Mode */
#define ADCIFE_WCFG_WM(value)       ((ADCIFE_WCFG_WM_Msk & ((value) << ADCIFE_WCFG_WM_Pos)))
/* -------- ADCIFE_WTH : (ADCIFE Offset: 0x28) Window Monitor Threshold Configuration Register -------- */
#define ADCIFE_WTH_LT_Pos           0
#define ADCIFE_WTH_LT_Msk           (0xFFFu << ADCIFE_WTH_LT_Pos) /**< \brief (ADCIFE_WTH) Low threshold */
#define ADCIFE_WTH_LT(value)        ((ADCIFE_WTH_LT_Msk & ((value) << ADCIFE_WTH_LT_Pos)))
#define ADCIFE_WTH_HT_Pos           16
#define ADCIFE_WTH_HT_Msk           (0xFFFu << ADCIFE_WTH_HT_Pos) /**< \brief (ADCIFE_WTH) High Threshold */
#define ADCIFE_WTH_HT(value)        ((ADCIFE_WTH_HT_Msk & ((value) << ADCIFE_WTH_HT_Pos)))
/* -------- ADCIFE_LCV : (ADCIFE Offset: 0x2C) Sequencer Last Converted Value Register -------- */
#define ADCIFE_LCV_LCV_Pos          0
#define ADCIFE_LCV_LCV_Msk          (0xFFFFu << ADCIFE_LCV_LCV_Pos) /**< \brief (ADCIFE_LCV) Last converted value */
#define ADCIFE_LCV_LCV(value)       ((ADCIFE_LCV_LCV_Msk & ((value) << ADCIFE_LCV_LCV_Pos)))
#define ADCIFE_LCV_LCPC_Pos         16
#define ADCIFE_LCV_LCPC_Msk         (0xFu << ADCIFE_LCV_LCPC_Pos) /**< \brief (ADCIFE_LCV) Last converted positive channel */
#define ADCIFE_LCV_LCPC(value)      ((ADCIFE_LCV_LCPC_Msk & ((value) << ADCIFE_LCV_LCPC_Pos)))
#define ADCIFE_LCV_LCNC_Pos         20
#define ADCIFE_LCV_LCNC_Msk         (0x7u << ADCIFE_LCV_LCNC_Pos) /**< \brief (ADCIFE_LCV) Last converted negative channel */
#define ADCIFE_LCV_LCNC(value)      ((ADCIFE_LCV_LCNC_Msk & ((value) << ADCIFE_LCV_LCNC_Pos)))
/* -------- ADCIFE_IER : (ADCIFE Offset: 0x30) Interrupt Enable Register -------- */
#define ADCIFE_IER_SEOC             (0x1u <<  0) /**< \brief (ADCIFE_IER) Sequencer end of conversion Interrupt Enable */
#define ADCIFE_IER_LOVR             (0x1u <<  1) /**< \brief (ADCIFE_IER) Sequencer last converted value overrun Interrupt Enable */
#define ADCIFE_IER_WM               (0x1u <<  2) /**< \brief (ADCIFE_IER) Window monitor Interrupt Enable */
#define ADCIFE_IER_SMTRG            (0x1u <<  3) /**< \brief (ADCIFE_IER) Sequencer missed trigger event Interrupt Enable */
#define ADCIFE_IER_SUTD             (0x1u <<  4) /**< \brief (ADCIFE_IER) Start-up time done */
#define ADCIFE_IER_TTO              (0x1u <<  5) /**< \brief (ADCIFE_IER) Timer time-out Interrupt Enable */
/* -------- ADCIFE_IDR : (ADCIFE Offset: 0x34) Interrupt Disable Register -------- */
#define ADCIFE_IDR_SEOC             (0x1u <<  0) /**< \brief (ADCIFE_IDR) Sequencer end of conversion Interrupt Disable */
#define ADCIFE_IDR_LOVR             (0x1u <<  1) /**< \brief (ADCIFE_IDR) Sequencer last converted value overrun Interrupt Disable */
#define ADCIFE_IDR_WM               (0x1u <<  2) /**< \brief (ADCIFE_IDR) Window monitor Interrupt Disable */
#define ADCIFE_IDR_SMTRG            (0x1u <<  3) /**< \brief (ADCIFE_IDR) Sequencer missed trigger event Interrupt Disable */
#define ADCIFE_IDR_SUTD             (0x1u <<  4) /**< \brief (ADCIFE_IDR) Start-up time done */
#define ADCIFE_IDR_TTO              (0x1u <<  5) /**< \brief (ADCIFE_IDR) Timer time-out Interrupt Disable */
/* -------- ADCIFE_IMR : (ADCIFE Offset: 0x38) Interrupt Mask Register -------- */
#define ADCIFE_IMR_SEOC             (0x1u <<  0) /**< \brief (ADCIFE_IMR) Sequencer end of conversion Interrupt Mask */
#define ADCIFE_IMR_LOVR             (0x1u <<  1) /**< \brief (ADCIFE_IMR) Sequencer last converted value overrun Interrupt Mask */
#define ADCIFE_IMR_WM               (0x1u <<  2) /**< \brief (ADCIFE_IMR) Window monitor Interrupt Mask */
#define ADCIFE_IMR_SMTRG            (0x1u <<  3) /**< \brief (ADCIFE_IMR) Sequencer missed trigger event Interrupt Mask */
#define ADCIFE_IMR_SUTD             (0x1u <<  4) /**< \brief (ADCIFE_IMR) Start-up time done */
#define ADCIFE_IMR_TTO              (0x1u <<  5) /**< \brief (ADCIFE_IMR) Timer time-out Interrupt Mask */
/* -------- ADCIFE_CALIB : (ADCIFE Offset: 0x3C) Calibration Register -------- */
#define ADCIFE_CALIB_CALIB_Pos      0
#define ADCIFE_CALIB_CALIB_Msk      (0xFFu << ADCIFE_CALIB_CALIB_Pos) /**< \brief (ADCIFE_CALIB) Calibration Value */
#define ADCIFE_CALIB_CALIB(value)   ((ADCIFE_CALIB_CALIB_Msk & ((value) << ADCIFE_CALIB_CALIB_Pos)))
#define ADCIFE_CALIB_BIASSEL        (0x1u <<  8) /**< \brief (ADCIFE_CALIB) Select bias mode */
#define ADCIFE_CALIB_BIASCAL_Pos    12
#define ADCIFE_CALIB_BIASCAL_Msk    (0xFu << ADCIFE_CALIB_BIASCAL_Pos) /**< \brief (ADCIFE_CALIB) Bias Calibration */
#define ADCIFE_CALIB_BIASCAL(value) ((ADCIFE_CALIB_BIASCAL_Msk & ((value) << ADCIFE_CALIB_BIASCAL_Pos)))
#define ADCIFE_CALIB_FCD            (0x1u << 16) /**< \brief (ADCIFE_CALIB) Flash Calibration Done */
/* -------- ADCIFE_VERSION : (ADCIFE Offset: 0x40) Version Register -------- */
#define ADCIFE_VERSION_VERSION_Pos    0
#define ADCIFE_VERSION_VERSION_Msk    (0xFFFu << ADCIFE_VERSION_VERSION_Pos) /**< \brief (ADCIFE_VERSION) Version number */
#define ADCIFE_VERSION_VERSION(value) ((ADCIFE_VERSION_VERSION_Msk & ((value) << ADCIFE_VERSION_VERSION_Pos)))
#define ADCIFE_VERSION_VARIANT_Pos    16
#define ADCIFE_VERSION_VARIANT_Msk    (0xFu << ADCIFE_VERSION_VARIANT_Pos) /**< \brief (ADCIFE_VERSION) Variant number */
#define ADCIFE_VERSION_VARIANT(value) ((ADCIFE_VERSION_VARIANT_Msk & ((value) << ADCIFE_VERSION_VARIANT_Pos)))
/* -------- ADCIFE_PARAMETER : (ADCIFE Offset: 0x44) Parameter Register -------- */
#define ADCIFE_PARAMETER_N_Pos      0
#define ADCIFE_PARAMETER_N_Msk      (0xFFu << ADCIFE_PARAMETER_N_Pos) /**< \brief (ADCIFE_PARAMETER) Number of channels */
#define ADCIFE_PARAMETER_N(value)   ((ADCIFE_PARAMETER_N_Msk & ((value) << ADCIFE_PARAMETER_N_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR AESA */
/* ============================================================================= */
/** \addtogroup SAM4L4_AESA Advanced Encryption Standard */
/*@{*/

#define REV_AESA       0x102

