Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief AesaInitvect hardware registers */
typedef struct {
  WoReg   INITVECT;    /**< \brief (AesaInitvect Offset: 0x00) Initialization Vector Register 0 */
} AesaInitvect;
/** \brief AesaKey hardware registers */
typedef struct {
  WoReg   KEY;         /**< \brief (AesaKey Offset: 0x00) Key Register 0 */
} AesaKey;
/** \brief AESA hardware registers */
typedef struct {
  RwReg   CTRL;        /**< \brief (AESA Offset: 0x00) Control Register */
  RwReg   MODE;        /**< \brief (AESA Offset: 0x04) Mode Register */
  RwReg   DATABUFPTR;  /**< \brief (AESA Offset: 0x08) Data Buffer Pointer Register */
  RoReg   SR;          /**< \brief (AESA Offset: 0x0C) Status Register */
  WoReg   IER;         /**< \brief (AESA Offset: 0x10) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (AESA Offset: 0x14) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (AESA Offset: 0x18) Interrupt Mask Register */
  RoReg   Reserved1[1];
  AesaKey Key[8]; /**< \brief (AESA Offset: 0x20) AesaKey groups */
  AesaInitvect Initvect[4]; /**< \brief (AESA Offset: 0x40) AesaInitvect groups */
  WoReg   IDATA;       /**< \brief (AESA Offset: 0x50) Input Data Register */
  RoReg   Reserved2[3];
  RoReg   ODATA;       /**< \brief (AESA Offset: 0x60) Output Data Register */
  RoReg   Reserved3[3];
  WoReg   DRNGSEED;    /**< \brief (AESA Offset: 0x70) DRNG Seed Register */
  RoReg   Reserved4[33];
  RoReg   PARAMETER;   /**< \brief (AESA Offset: 0xF8) Parameter Register */
  RoReg   VERSION;     /**< \brief (AESA Offset: 0xFC) Version Register */
} Aesa;
#endif /* __ASSEMBLY__ */
/* -------- AESA_CTRL : (AESA Offset: 0x00) Control Register -------- */
#define AESA_CTRL_ENABLE            (0x1u <<  0) /**< \brief (AESA_CTRL) Enable Module */
#define AESA_CTRL_DKEYGEN           (0x1u <<  1) /**< \brief (AESA_CTRL) Decryption Key Generate */
#define AESA_CTRL_NEWMSG            (0x1u <<  2) /**< \brief (AESA_CTRL) New Message */
#define AESA_CTRL_SWRST             (0x1u <<  8) /**< \brief (AESA_CTRL) Software Reset */
/* -------- AESA_MODE : (AESA Offset: 0x04) Mode Register -------- */
#define AESA_MODE_ENCRYPT           (0x1u <<  0) /**< \brief (AESA_MODE) Encryption */
#define AESA_MODE_KEYSIZE_Pos       1
#define AESA_MODE_KEYSIZE_Msk       (0x3u << AESA_MODE_KEYSIZE_Pos) /**< \brief (AESA_MODE) Key Size */
#define AESA_MODE_KEYSIZE(value)    ((AESA_MODE_KEYSIZE_Msk & ((value) << AESA_MODE_KEYSIZE_Pos)))
#define AESA_MODE_DMA               (0x1u <<  3) /**< \brief (AESA_MODE) DMA Mode */
#define AESA_MODE_OPMODE_Pos        4
#define AESA_MODE_OPMODE_Msk        (0x7u << AESA_MODE_OPMODE_Pos) /**< \brief (AESA_MODE) Confidentiality Mode of Operation */
#define AESA_MODE_OPMODE(value)     ((AESA_MODE_OPMODE_Msk & ((value) << AESA_MODE_OPMODE_Pos)))
#define AESA_MODE_CFBS_Pos          8
#define AESA_MODE_CFBS_Msk          (0x7u << AESA_MODE_CFBS_Pos) /**< \brief (AESA_MODE) Cipher Feedback Data Segment Size */
#define AESA_MODE_CFBS(value)       ((AESA_MODE_CFBS_Msk & ((value) << AESA_MODE_CFBS_Pos)))
#define AESA_MODE_CTYPE_Pos         16
#define AESA_MODE_CTYPE_Msk         (0xFu << AESA_MODE_CTYPE_Pos) /**< \brief (AESA_MODE) Countermeasure Type */
#define AESA_MODE_CTYPE(value)      ((AESA_MODE_CTYPE_Msk & ((value) << AESA_MODE_CTYPE_Pos)))
/* -------- AESA_DATABUFPTR : (AESA Offset: 0x08) Data Buffer Pointer Register -------- */
#define AESA_DATABUFPTR_IDATAW_Pos    0
#define AESA_DATABUFPTR_IDATAW_Msk    (0x3u << AESA_DATABUFPTR_IDATAW_Pos) /**< \brief (AESA_DATABUFPTR) Input Data Word */
#define AESA_DATABUFPTR_IDATAW(value) ((AESA_DATABUFPTR_IDATAW_Msk & ((value) << AESA_DATABUFPTR_IDATAW_Pos)))
#define AESA_DATABUFPTR_ODATAW_Pos    4
#define AESA_DATABUFPTR_ODATAW_Msk    (0x3u << AESA_DATABUFPTR_ODATAW_Pos) /**< \brief (AESA_DATABUFPTR) Output Data Word */
#define AESA_DATABUFPTR_ODATAW(value) ((AESA_DATABUFPTR_ODATAW_Msk & ((value) << AESA_DATABUFPTR_ODATAW_Pos)))
/* -------- AESA_SR : (AESA Offset: 0x0C) Status Register -------- */
#define AESA_SR_ODATARDY            (0x1u <<  0) /**< \brief (AESA_SR) Output Data Ready */
#define AESA_SR_IBUFRDY             (0x1u << 16) /**< \brief (AESA_SR) Input Buffer Ready */
/* -------- AESA_IER : (AESA Offset: 0x10) Interrupt Enable Register -------- */
#define AESA_IER_ODATARDY           (0x1u <<  0) /**< \brief (AESA_IER) Output Data Ready Interrupt Enable */
#define AESA_IER_IBUFRDY            (0x1u << 16) /**< \brief (AESA_IER) Input Buffer Ready Interrupt Enable */
/* -------- AESA_IDR : (AESA Offset: 0x14) Interrupt Disable Register -------- */
#define AESA_IDR_ODATARDY           (0x1u <<  0) /**< \brief (AESA_IDR) Output Data Ready Interrupt Disable */
#define AESA_IDR_IBUFRDY            (0x1u << 16) /**< \brief (AESA_IDR) Input Buffer Ready Interrupt Disable */
/* -------- AESA_IMR : (AESA Offset: 0x18) Interrupt Mask Register -------- */
#define AESA_IMR_ODATARDY           (0x1u <<  0) /**< \brief (AESA_IMR) Output Data Ready Interrupt Mask */
#define AESA_IMR_IBUFRDY            (0x1u << 16) /**< \brief (AESA_IMR) Input Buffer Ready Interrupt Mask */
/* -------- AESA_KEY : (AESA Offset: 0x20) Key Key Register 0 -------- */
#define AESA_KEY_KEY0_Pos           0
#define AESA_KEY_KEY0_Msk           (0xFFFFFFFFu << AESA_KEY_KEY0_Pos) /**< \brief (AESA_KEY) Key Word 0 */
#define AESA_KEY_KEY0(value)        ((AESA_KEY_KEY0_Msk & ((value) << AESA_KEY_KEY0_Pos)))
/* -------- AESA_INITVECT : (AESA Offset: 0x40) Initvect Initialization Vector Register 0 -------- */
#define AESA_INITVECT_INITVECT0_Pos    0
#define AESA_INITVECT_INITVECT0_Msk    (0xFFFFFFFFu << AESA_INITVECT_INITVECT0_Pos) /**< \brief (AESA_INITVECT) Initialization Vector Word 0 */
#define AESA_INITVECT_INITVECT0(value) ((AESA_INITVECT_INITVECT0_Msk & ((value) << AESA_INITVECT_INITVECT0_Pos)))
/* -------- AESA_IDATA : (AESA Offset: 0x50) Input Data Register -------- */
#define AESA_IDATA_IDATA_Pos        0
#define AESA_IDATA_IDATA_Msk        (0xFFFFFFFFu << AESA_IDATA_IDATA_Pos) /**< \brief (AESA_IDATA) Input Data */
#define AESA_IDATA_IDATA(value)     ((AESA_IDATA_IDATA_Msk & ((value) << AESA_IDATA_IDATA_Pos)))
/* -------- AESA_ODATA : (AESA Offset: 0x60) Output Data Register -------- */
#define AESA_ODATA_ODATA_Pos        0
#define AESA_ODATA_ODATA_Msk        (0xFFFFFFFFu << AESA_ODATA_ODATA_Pos) /**< \brief (AESA_ODATA) Output Data */
#define AESA_ODATA_ODATA(value)     ((AESA_ODATA_ODATA_Msk & ((value) << AESA_ODATA_ODATA_Pos)))
/* -------- AESA_DRNGSEED : (AESA Offset: 0x70) DRNG Seed Register -------- */
#define AESA_DRNGSEED_SEED_Pos      0
#define AESA_DRNGSEED_SEED_Msk      (0xFFFFFFFFu << AESA_DRNGSEED_SEED_Pos) /**< \brief (AESA_DRNGSEED) DRNG Seed */
#define AESA_DRNGSEED_SEED(value)   ((AESA_DRNGSEED_SEED_Msk & ((value) << AESA_DRNGSEED_SEED_Pos)))
/* -------- AESA_PARAMETER : (AESA Offset: 0xF8) Parameter Register -------- */
#define AESA_PARAMETER_KEYSIZE_Pos    0
#define AESA_PARAMETER_KEYSIZE_Msk    (0x3u << AESA_PARAMETER_KEYSIZE_Pos) /**< \brief (AESA_PARAMETER) Maximum Key Size */
#define AESA_PARAMETER_KEYSIZE(value) ((AESA_PARAMETER_KEYSIZE_Msk & ((value) << AESA_PARAMETER_KEYSIZE_Pos)))
#define AESA_PARAMETER_OPMODE_Pos    2
#define AESA_PARAMETER_OPMODE_Msk    (0x7u << AESA_PARAMETER_OPMODE_Pos) /**< \brief (AESA_PARAMETER) Maximum Number of Confidentiality Modes of Operation */
#define AESA_PARAMETER_OPMODE(value) ((AESA_PARAMETER_OPMODE_Msk & ((value) << AESA_PARAMETER_OPMODE_Pos)))
#define AESA_PARAMETER_CTRMEAS      (0x1u <<  8) /**< \brief (AESA_PARAMETER) Countermeasures */
/* -------- AESA_VERSION : (AESA Offset: 0xFC) Version Register -------- */
#define AESA_VERSION_VERSION_Pos    0
#define AESA_VERSION_VERSION_Msk    (0xFFFu << AESA_VERSION_VERSION_Pos) /**< \brief (AESA_VERSION) Version Number */
#define AESA_VERSION_VERSION(value) ((AESA_VERSION_VERSION_Msk & ((value) << AESA_VERSION_VERSION_Pos)))
#define AESA_VERSION_VARIANT_Pos    16
#define AESA_VERSION_VARIANT_Msk    (0xFu << AESA_VERSION_VARIANT_Pos) /**< \brief (AESA_VERSION) Variant Number */
#define AESA_VERSION_VARIANT(value) ((AESA_VERSION_VARIANT_Msk & ((value) << AESA_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR AST */
/* ============================================================================= */
/** \addtogroup SAM4L4_AST Asynchronous Timer */
/*@{*/

#define REV_AST        0x311

