Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief AST hardware registers */
typedef struct {
  RwReg   CR;          /**< \brief (AST Offset: 0x00) Control Register */
  RwReg   CV;          /**< \brief (AST Offset: 0x04) Counter Value */
  RoReg   SR;          /**< \brief (AST Offset: 0x08) Status Register */
  WoReg   SCR;         /**< \brief (AST Offset: 0x0C) Status Clear Register */
  WoReg   IER;         /**< \brief (AST Offset: 0x10) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (AST Offset: 0x14) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (AST Offset: 0x18) Interrupt Mask Register */
  RwReg   WER;         /**< \brief (AST Offset: 0x1C) Wake Enable Register */
  RwReg   AR0;         /**< \brief (AST Offset: 0x20) Alarm Register 0 */
  RwReg   AR1;         /**< \brief (AST Offset: 0x24) Alarm Register 1 */
  RoReg   Reserved1[2];
  RwReg   PIR0;        /**< \brief (AST Offset: 0x30) Periodic Interval Register 0 */
  RwReg   PIR1;        /**< \brief (AST Offset: 0x34) Periodic Interval Register 1 */
  RoReg   Reserved2[2];
  RwReg   CLOCK;       /**< \brief (AST Offset: 0x40) Clock Control Register */
  RwReg   DTR;         /**< \brief (AST Offset: 0x44) Digital Tuner Register */
  WoReg   EVE;         /**< \brief (AST Offset: 0x48) Event Enable Register */
  WoReg   EVD;         /**< \brief (AST Offset: 0x4C) Event Disable Register */
  RoReg   EVM;         /**< \brief (AST Offset: 0x50) Event Mask Register */
  RwReg   CALV;        /**< \brief (AST Offset: 0x54) Calendar Value */
  RoReg   Reserved3[38];
  RoReg   PARAMETER;   /**< \brief (AST Offset: 0xF0) Parameter Register */
  RoReg   Reserved4[2];
  RoReg   VERSION;     /**< \brief (AST Offset: 0xFC) Version Register */
} Ast;
#endif /* __ASSEMBLY__ */
/* -------- AST_CR : (AST Offset: 0x00) Control Register -------- */
#define AST_CR_EN                   (0x1u <<  0) /**< \brief (AST_CR) Enable */
#define   AST_CR_EN_0               (0x0u <<  0) /**< \brief (AST_CR) The AST is disabled. */
#define   AST_CR_EN_1               (0x1u <<  0) /**< \brief (AST_CR) The AST is enabled */
#define AST_CR_PCLR                 (0x1u <<  1) /**< \brief (AST_CR) Prescaler Clear */
#define AST_CR_CAL                  (0x1u <<  2) /**< \brief (AST_CR) Calendar mode */
#define AST_CR_CA0                  (0x1u <<  8) /**< \brief (AST_CR) Clear on Alarm 0 */
#define AST_CR_CA1                  (0x1u <<  9) /**< \brief (AST_CR) Clear on Alarm 1 */
#define AST_CR_PSEL_Pos             16
#define AST_CR_PSEL_Msk             (0x1Fu << AST_CR_PSEL_Pos) /**< \brief (AST_CR) Prescaler Select */
#define AST_CR_PSEL(value)          ((AST_CR_PSEL_Msk & ((value) << AST_CR_PSEL_Pos)))
/* -------- AST_CV : (AST Offset: 0x04) Counter Value -------- */
#define AST_CV_VALUE_Pos            0
#define AST_CV_VALUE_Msk            (0xFFFFFFFFu << AST_CV_VALUE_Pos) /**< \brief (AST_CV) AST Value */
#define AST_CV_VALUE(value)         ((AST_CV_VALUE_Msk & ((value) << AST_CV_VALUE_Pos)))
/* -------- AST_SR : (AST Offset: 0x08) Status Register -------- */
#define AST_SR_OVF                  (0x1u <<  0) /**< \brief (AST_SR) Overflow */
#define AST_SR_ALARM0               (0x1u <<  8) /**< \brief (AST_SR) Alarm 0 */
#define AST_SR_ALARM1               (0x1u <<  9) /**< \brief (AST_SR) Alarm 1 */
#define AST_SR_PER0                 (0x1u << 16) /**< \brief (AST_SR) Periodic 0 */
#define AST_SR_PER1                 (0x1u << 17) /**< \brief (AST_SR) Periodic 1 */
#define AST_SR_BUSY                 (0x1u << 24) /**< \brief (AST_SR) AST Busy */
#define   AST_SR_BUSY_0             (0x0u << 24) /**< \brief (AST_SR) The AST accepts writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define   AST_SR_BUSY_1             (0x1u << 24) /**< \brief (AST_SR) The AST is busy and will discard writes to CV, WER, DTR, SCR, AR, PIR and CR */
#define AST_SR_READY                (0x1u << 25) /**< \brief (AST_SR) AST Ready */
#define AST_SR_CLKBUSY              (0x1u << 28) /**< \brief (AST_SR) Clock Busy */
#define   AST_SR_CLKBUSY_0          (0x0u << 28) /**< \brief (AST_SR) The clock is ready and can be changed */
#define   AST_SR_CLKBUSY_1          (0x1u << 28) /**< \brief (AST_SR) CEN has been written and the clock is busy */
#define AST_SR_CLKRDY               (0x1u << 29) /**< \brief (AST_SR) Clock Ready */
/* -------- AST_SCR : (AST Offset: 0x0C) Status Clear Register -------- */
#define AST_SCR_OVF                 (0x1u <<  0) /**< \brief (AST_SCR) Overflow */
#define AST_SCR_ALARM0              (0x1u <<  8) /**< \brief (AST_SCR) Alarm 0 */
#define AST_SCR_ALARM1              (0x1u <<  9) /**< \brief (AST_SCR) Alarm 1 */
#define AST_SCR_PER0                (0x1u << 16) /**< \brief (AST_SCR) Periodic 0 */
#define AST_SCR_PER1                (0x1u << 17) /**< \brief (AST_SCR) Periodic 1 */
#define AST_SCR_READY               (0x1u << 25) /**< \brief (AST_SCR) AST Ready */
#define AST_SCR_CLKRDY              (0x1u << 29) /**< \brief (AST_SCR) Clock Ready */
/* -------- AST_IER : (AST Offset: 0x10) Interrupt Enable Register -------- */
#define AST_IER_OVF                 (0x1u <<  0) /**< \brief (AST_IER) Overflow */
#define   AST_IER_OVF_0             (0x0u <<  0) /**< \brief (AST_IER) No effect */
#define   AST_IER_OVF_1             (0x1u <<  0) /**< \brief (AST_IER) Enable Interrupt. */
#define AST_IER_ALARM0              (0x1u <<  8) /**< \brief (AST_IER) Alarm 0 */
#define   AST_IER_ALARM0_0          (0x0u <<  8) /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM0_1          (0x1u <<  8) /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_ALARM1              (0x1u <<  9) /**< \brief (AST_IER) Alarm 1 */
#define   AST_IER_ALARM1_0          (0x0u <<  9) /**< \brief (AST_IER) No effect */
#define   AST_IER_ALARM1_1          (0x1u <<  9) /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER0                (0x1u << 16) /**< \brief (AST_IER) Periodic 0 */
#define   AST_IER_PER0_0            (0x0u << 16) /**< \brief (AST_IER) No effect */
#define   AST_IER_PER0_1            (0x1u << 16) /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_PER1                (0x1u << 17) /**< \brief (AST_IER) Periodic 1 */
#define   AST_IER_PER1_0            (0x0u << 17) /**< \brief (AST_IER) No effect */
#define   AST_IER_PER1_1            (0x1u << 17) /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_READY               (0x1u << 25) /**< \brief (AST_IER) AST Ready */
#define   AST_IER_READY_0           (0x0u << 25) /**< \brief (AST_IER) No effect */
#define   AST_IER_READY_1           (0x1u << 25) /**< \brief (AST_IER) Enable interrupt */
#define AST_IER_CLKRDY              (0x1u << 29) /**< \brief (AST_IER) Clock Ready */
#define   AST_IER_CLKRDY_0          (0x0u << 29) /**< \brief (AST_IER) No effect */
#define   AST_IER_CLKRDY_1          (0x1u << 29) /**< \brief (AST_IER) Enable interrupt */
/* -------- AST_IDR : (AST Offset: 0x14) Interrupt Disable Register -------- */
#define AST_IDR_OVF                 (0x1u <<  0) /**< \brief (AST_IDR) Overflow */
#define   AST_IDR_OVF_0             (0x0u <<  0) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_OVF_1             (0x1u <<  0) /**< \brief (AST_IDR) Disable Interrupt. */
#define AST_IDR_ALARM0              (0x1u <<  8) /**< \brief (AST_IDR) Alarm 0 */
#define   AST_IDR_ALARM0_0          (0x0u <<  8) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM0_1          (0x1u <<  8) /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_ALARM1              (0x1u <<  9) /**< \brief (AST_IDR) Alarm 1 */
#define   AST_IDR_ALARM1_0          (0x0u <<  9) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_ALARM1_1          (0x1u <<  9) /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_PER0                (0x1u << 16) /**< \brief (AST_IDR) Periodic 0 */
#define   AST_IDR_PER0_0            (0x0u << 16) /**< \brief (AST_IDR) No effet */
#define   AST_IDR_PER0_1            (0x1u << 16) /**< \brief (AST_IDR) Disalbe interrupt */
#define AST_IDR_PER1                (0x1u << 17) /**< \brief (AST_IDR) Periodic 1 */
#define   AST_IDR_PER1_0            (0x0u << 17) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_PER1_1            (0x1u << 17) /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_READY               (0x1u << 25) /**< \brief (AST_IDR) AST Ready */
#define   AST_IDR_READY_0           (0x0u << 25) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_READY_1           (0x1u << 25) /**< \brief (AST_IDR) Disable interrupt */
#define AST_IDR_CLKRDY              (0x1u << 29) /**< \brief (AST_IDR) Clock Ready */
#define   AST_IDR_CLKRDY_0          (0x0u << 29) /**< \brief (AST_IDR) No effect */
#define   AST_IDR_CLKRDY_1          (0x1u << 29) /**< \brief (AST_IDR) Disable interrupt */
/* -------- AST_IMR : (AST Offset: 0x18) Interrupt Mask Register -------- */
#define AST_IMR_OVF                 (0x1u <<  0) /**< \brief (AST_IMR) Overflow */
#define   AST_IMR_OVF_0             (0x0u <<  0) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_OVF_1             (0x1u <<  0) /**< \brief (AST_IMR) Interrupt is enabled. */
#define AST_IMR_ALARM0              (0x1u <<  8) /**< \brief (AST_IMR) Alarm 0 */
#define   AST_IMR_ALARM0_0          (0x0u <<  8) /**< \brief (AST_IMR) Interupt is disabled */
#define   AST_IMR_ALARM0_1          (0x1u <<  8) /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_ALARM1              (0x1u <<  9) /**< \brief (AST_IMR) Alarm 1 */
#define   AST_IMR_ALARM1_0          (0x0u <<  9) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_ALARM1_1          (0x1u <<  9) /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER0                (0x1u << 16) /**< \brief (AST_IMR) Periodic 0 */
#define   AST_IMR_PER0_0            (0x0u << 16) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER0_1            (0x1u << 16) /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_PER1                (0x1u << 17) /**< \brief (AST_IMR) Periodic 1 */
#define   AST_IMR_PER1_0            (0x0u << 17) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_PER1_1            (0x1u << 17) /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_READY               (0x1u << 25) /**< \brief (AST_IMR) AST Ready */
#define   AST_IMR_READY_0           (0x0u << 25) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_READY_1           (0x1u << 25) /**< \brief (AST_IMR) Interrupt is enabled */
#define AST_IMR_CLKRDY              (0x1u << 29) /**< \brief (AST_IMR) Clock Ready */
#define   AST_IMR_CLKRDY_0          (0x0u << 29) /**< \brief (AST_IMR) Interrupt is disabled */
#define   AST_IMR_CLKRDY_1          (0x1u << 29) /**< \brief (AST_IMR) Interrupt is enabled */
/* -------- AST_WER : (AST Offset: 0x1C) Wake Enable Register -------- */
#define AST_WER_OVF                 (0x1u <<  0) /**< \brief (AST_WER) Overflow */
#define   AST_WER_OVF_0             (0x0u <<  0) /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_OVF_1             (0x1u <<  0) /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_ALARM0              (0x1u <<  8) /**< \brief (AST_WER) Alarm 0 */
#define   AST_WER_ALARM0_0          (0x0u <<  8) /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_ALARM0_1          (0x1u <<  8) /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_ALARM1              (0x1u <<  9) /**< \brief (AST_WER) Alarm 1 */
#define   AST_WER_ALARM1_0          (0x0u <<  9) /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_ALARM1_1          (0x1u <<  9) /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_PER0                (0x1u << 16) /**< \brief (AST_WER) Periodic 0 */
#define   AST_WER_PER0_0            (0x0u << 16) /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_PER0_1            (0x1u << 16) /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
#define AST_WER_PER1                (0x1u << 17) /**< \brief (AST_WER) Periodic 1 */
#define   AST_WER_PER1_0            (0x0u << 17) /**< \brief (AST_WER) The corresponing event will not wake up the CPU from sleep mode */
#define   AST_WER_PER1_1            (0x1u << 17) /**< \brief (AST_WER) The corresponding event will wake up the CPU from sleep mode */
/* -------- AST_AR0 : (AST Offset: 0x20) Alarm Register 0 -------- */
#define AST_AR0_VALUE_Pos           0
#define AST_AR0_VALUE_Msk           (0xFFFFFFFFu << AST_AR0_VALUE_Pos) /**< \brief (AST_AR0) Alarm Value */
#define AST_AR0_VALUE(value)        ((AST_AR0_VALUE_Msk & ((value) << AST_AR0_VALUE_Pos)))
/* -------- AST_AR1 : (AST Offset: 0x24) Alarm Register 1 -------- */
#define AST_AR1_VALUE_Pos           0
#define AST_AR1_VALUE_Msk           (0xFFFFFFFFu << AST_AR1_VALUE_Pos) /**< \brief (AST_AR1) Alarm Value */
#define AST_AR1_VALUE(value)        ((AST_AR1_VALUE_Msk & ((value) << AST_AR1_VALUE_Pos)))
/* -------- AST_PIR0 : (AST Offset: 0x30) Periodic Interval Register 0 -------- */
#define AST_PIR0_INSEL_Pos          0
#define AST_PIR0_INSEL_Msk          (0x1Fu << AST_PIR0_INSEL_Pos) /**< \brief (AST_PIR0) Interval Select */
#define AST_PIR0_INSEL(value)       ((AST_PIR0_INSEL_Msk & ((value) << AST_PIR0_INSEL_Pos)))
/* -------- AST_PIR1 : (AST Offset: 0x34) Periodic Interval Register 1 -------- */
#define AST_PIR1_INSEL_Pos          0
#define AST_PIR1_INSEL_Msk          (0x1Fu << AST_PIR1_INSEL_Pos) /**< \brief (AST_PIR1) Interval Select */
#define AST_PIR1_INSEL(value)       ((AST_PIR1_INSEL_Msk & ((value) << AST_PIR1_INSEL_Pos)))
/* -------- AST_CLOCK : (AST Offset: 0x40) Clock Control Register -------- */
#define AST_CLOCK_CEN               (0x1u <<  0) /**< \brief (AST_CLOCK) Clock Enable */
#define   AST_CLOCK_CEN_0           (0x0u <<  0) /**< \brief (AST_CLOCK) The clock is disabled */
#define   AST_CLOCK_CEN_1           (0x1u <<  0) /**< \brief (AST_CLOCK) The clock is enabled */
#define AST_CLOCK_CSSEL_Pos         8
#define AST_CLOCK_CSSEL_Msk         (0x7u << AST_CLOCK_CSSEL_Pos) /**< \brief (AST_CLOCK) Clock Source Selection */
#define AST_CLOCK_CSSEL(value)      ((AST_CLOCK_CSSEL_Msk & ((value) << AST_CLOCK_CSSEL_Pos)))
#define   AST_CLOCK_CSSEL_SLOWCLOCK (0x0u <<  8) /**< \brief (AST_CLOCK) Slow clock */
#define   AST_CLOCK_CSSEL_32KHZCLK  (0x1u <<  8) /**< \brief (AST_CLOCK) 32 kHz clock */
#define   AST_CLOCK_CSSEL_PBCLOCK   (0x2u <<  8) /**< \brief (AST_CLOCK) PB clock */
#define   AST_CLOCK_CSSEL_GCLK      (0x3u <<  8) /**< \brief (AST_CLOCK) Generic clock */
#define   AST_CLOCK_CSSEL_1KHZCLK   (0x4u <<  8) /**< \brief (AST_CLOCK) 1kHz clock from 32 kHz oscillator */
/* -------- AST_DTR : (AST Offset: 0x44) Digital Tuner Register -------- */
#define AST_DTR_EXP_Pos             0
#define AST_DTR_EXP_Msk             (0x1Fu << AST_DTR_EXP_Pos) /**< \brief (AST_DTR) EXP */
#define AST_DTR_EXP(value)          ((AST_DTR_EXP_Msk & ((value) << AST_DTR_EXP_Pos)))
#define AST_DTR_ADD                 (0x1u <<  5) /**< \brief (AST_DTR) ADD */
#define AST_DTR_VALUE_Pos           8
#define AST_DTR_VALUE_Msk           (0xFFu << AST_DTR_VALUE_Pos) /**< \brief (AST_DTR) VALUE */
#define AST_DTR_VALUE(value)        ((AST_DTR_VALUE_Msk & ((value) << AST_DTR_VALUE_Pos)))
/* -------- AST_EVE : (AST Offset: 0x48) Event Enable Register -------- */
#define AST_EVE_OVF                 (0x1u <<  0) /**< \brief (AST_EVE) Overflow */
#define AST_EVE_ALARM0              (0x1u <<  8) /**< \brief (AST_EVE) Alarm 0 */
#define AST_EVE_ALARM1              (0x1u <<  9) /**< \brief (AST_EVE) Alarm 1 */
#define AST_EVE_PER0                (0x1u << 16) /**< \brief (AST_EVE) Perioidc 0 */
#define AST_EVE_PER1                (0x1u << 17) /**< \brief (AST_EVE) Periodic 1 */
/* -------- AST_EVD : (AST Offset: 0x4C) Event Disable Register -------- */
#define AST_EVD_OVF                 (0x1u <<  0) /**< \brief (AST_EVD) Overflow */
#define AST_EVD_ALARM0              (0x1u <<  8) /**< \brief (AST_EVD) Alarm 0 */
#define AST_EVD_ALARM1              (0x1u <<  9) /**< \brief (AST_EVD) Alarm 1 */
#define AST_EVD_PER0                (0x1u << 16) /**< \brief (AST_EVD) Perioidc 0 */
#define AST_EVD_PER1                (0x1u << 17) /**< \brief (AST_EVD) Periodic 1 */
/* -------- AST_EVM : (AST Offset: 0x50) Event Mask Register -------- */
#define AST_EVM_OVF                 (0x1u <<  0) /**< \brief (AST_EVM) Overflow */
#define AST_EVM_ALARM0              (0x1u <<  8) /**< \brief (AST_EVM) Alarm 0 */
#define AST_EVM_ALARM1              (0x1u <<  9) /**< \brief (AST_EVM) Alarm 1 */
#define AST_EVM_PER0                (0x1u << 16) /**< \brief (AST_EVM) Perioidc 0 */
#define AST_EVM_PER1                (0x1u << 17) /**< \brief (AST_EVM) Periodic 1 */
/* -------- AST_CALV : (AST Offset: 0x54) Calendar Value -------- */
#define AST_CALV_SEC_Pos            0
#define AST_CALV_SEC_Msk            (0x3Fu << AST_CALV_SEC_Pos) /**< \brief (AST_CALV) Second */
#define AST_CALV_SEC(value)         ((AST_CALV_SEC_Msk & ((value) << AST_CALV_SEC_Pos)))
#define AST_CALV_MIN_Pos            6
#define AST_CALV_MIN_Msk            (0x3Fu << AST_CALV_MIN_Pos) /**< \brief (AST_CALV) Minute */
#define AST_CALV_MIN(value)         ((AST_CALV_MIN_Msk & ((value) << AST_CALV_MIN_Pos)))
#define AST_CALV_HOUR_Pos           12
#define AST_CALV_HOUR_Msk           (0x1Fu << AST_CALV_HOUR_Pos) /**< \brief (AST_CALV) Hour */
#define AST_CALV_HOUR(value)        ((AST_CALV_HOUR_Msk & ((value) << AST_CALV_HOUR_Pos)))
#define AST_CALV_DAY_Pos            17
#define AST_CALV_DAY_Msk            (0x1Fu << AST_CALV_DAY_Pos) /**< \brief (AST_CALV) Day */
#define AST_CALV_DAY(value)         ((AST_CALV_DAY_Msk & ((value) << AST_CALV_DAY_Pos)))
#define AST_CALV_MONTH_Pos          22
#define AST_CALV_MONTH_Msk          (0xFu << AST_CALV_MONTH_Pos) /**< \brief (AST_CALV) Month */
#define AST_CALV_MONTH(value)       ((AST_CALV_MONTH_Msk & ((value) << AST_CALV_MONTH_Pos)))
#define AST_CALV_YEAR_Pos           26
#define AST_CALV_YEAR_Msk           (0x3Fu << AST_CALV_YEAR_Pos) /**< \brief (AST_CALV) Year */
#define AST_CALV_YEAR(value)        ((AST_CALV_YEAR_Msk & ((value) << AST_CALV_YEAR_Pos)))
/* -------- AST_PARAMETER : (AST Offset: 0xF0) Parameter Register -------- */
#define AST_PARAMETER_DT            (0x1u <<  0) /**< \brief (AST_PARAMETER) Digital Tuner */
#define   AST_PARAMETER_DT_OFF      (0x0u <<  0) /**< \brief (AST_PARAMETER) Digital tuner off */
#define   AST_PARAMETER_DT_ON       (0x1u <<  0) /**< \brief (AST_PARAMETER) Digital tuner on */
#define AST_PARAMETER_DTEXPWA       (0x1u <<  1) /**< \brief (AST_PARAMETER) Digital Tuner Exponent Writeable */
#define   AST_PARAMETER_DTEXPWA_0   (0x0u <<  1) /**< \brief (AST_PARAMETER) Digital tuner exponent is a constant value. Writes to EXP bitfield in DTR will be discarded. */
#define   AST_PARAMETER_DTEXPWA_1   (0x1u <<  1) /**< \brief (AST_PARAMETER) Digital tuner exponent is chosen by writing to EXP bitfield in DTR */
#define AST_PARAMETER_DTEXPVALUE_Pos    2
#define AST_PARAMETER_DTEXPVALUE_Msk    (0x1Fu << AST_PARAMETER_DTEXPVALUE_Pos) /**< \brief (AST_PARAMETER) Digital Tuner Exponent Value */
#define AST_PARAMETER_DTEXPVALUE(value) ((AST_PARAMETER_DTEXPVALUE_Msk & ((value) << AST_PARAMETER_DTEXPVALUE_Pos)))
#define AST_PARAMETER_NUMAR_Pos     8
#define AST_PARAMETER_NUMAR_Msk     (0x3u << AST_PARAMETER_NUMAR_Pos) /**< \brief (AST_PARAMETER) Number of alarm comparators */
#define AST_PARAMETER_NUMAR(value)  ((AST_PARAMETER_NUMAR_Msk & ((value) << AST_PARAMETER_NUMAR_Pos)))
#define   AST_PARAMETER_NUMAR_ZERO  (0x0u <<  8) /**< \brief (AST_PARAMETER) No alarm comparators */
#define   AST_PARAMETER_NUMAR_ONE   (0x1u <<  8) /**< \brief (AST_PARAMETER) One alarm comparator */
#define   AST_PARAMETER_NUMAR_TWO   (0x2u <<  8) /**< \brief (AST_PARAMETER) Two alarm comparators */
#define AST_PARAMETER_NUMPIR        (0x1u << 12) /**< \brief (AST_PARAMETER) Number of periodic comparators */
#define   AST_PARAMETER_NUMPIR_ONE  (0x0u << 12) /**< \brief (AST_PARAMETER) One periodic comparator */
#define   AST_PARAMETER_NUMPIR_TWO  (0x1u << 12) /**< \brief (AST_PARAMETER) Two periodic comparators */
#define AST_PARAMETER_PIR0WA        (0x1u << 14) /**< \brief (AST_PARAMETER) Periodic Interval 0 Writeable */
#define   AST_PARAMETER_PIR0WA_0    (0x0u << 14) /**< \brief (AST_PARAMETER) Periodic alarm prescaler 0 tapping is a constant value. Writes to INSEL bitfield in PIR0 will be discarded. */
#define   AST_PARAMETER_PIR0WA_1    (0x1u << 14) /**< \brief (AST_PARAMETER) Periodic alarm prescaler 0 tapping is chosen by writing to INSEL bitfield in PIR0 */
#define AST_PARAMETER_PIR1WA        (0x1u << 15) /**< \brief (AST_PARAMETER) Periodic Interval 1 Writeable */
#define   AST_PARAMETER_PIR1WA_0    (0x0u << 15) /**< \brief (AST_PARAMETER) Writes to PIR1 will be discarded */
#define   AST_PARAMETER_PIR1WA_1    (0x1u << 15) /**< \brief (AST_PARAMETER) PIR1 can be written */
#define AST_PARAMETER_PER0VALUE_Pos    16
#define AST_PARAMETER_PER0VALUE_Msk    (0x1Fu << AST_PARAMETER_PER0VALUE_Pos) /**< \brief (AST_PARAMETER) Periodic Interval 0 Value */
#define AST_PARAMETER_PER0VALUE(value) ((AST_PARAMETER_PER0VALUE_Msk & ((value) << AST_PARAMETER_PER0VALUE_Pos)))
#define AST_PARAMETER_PER1VALUE_Pos    24
#define AST_PARAMETER_PER1VALUE_Msk    (0x1Fu << AST_PARAMETER_PER1VALUE_Pos) /**< \brief (AST_PARAMETER) Periodic Interval 1 Value */
#define AST_PARAMETER_PER1VALUE(value) ((AST_PARAMETER_PER1VALUE_Msk & ((value) << AST_PARAMETER_PER1VALUE_Pos)))
/* -------- AST_VERSION : (AST Offset: 0xFC) Version Register -------- */
#define AST_VERSION_VERSION_Pos     0
#define AST_VERSION_VERSION_Msk     (0xFFFu << AST_VERSION_VERSION_Pos) /**< \brief (AST_VERSION) Version Number */
#define AST_VERSION_VERSION(value)  ((AST_VERSION_VERSION_Msk & ((value) << AST_VERSION_VERSION_Pos)))
#define AST_VERSION_VARIANT_Pos     16
#define AST_VERSION_VARIANT_Msk     (0xFu << AST_VERSION_VARIANT_Pos) /**< \brief (AST_VERSION) Variant Number */
#define AST_VERSION_VARIANT(value)  ((AST_VERSION_VARIANT_Msk & ((value) << AST_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR BPM */
/* ============================================================================= */
/** \addtogroup SAM4L4_BPM Backup Power Manager */
/*@{*/

#define REV_BPM        0x120

