Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief BPM hardware registers */
typedef struct {
  WoReg   IER;         /**< \brief (BPM Offset: 0x00) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (BPM Offset: 0x04) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (BPM Offset: 0x08) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (BPM Offset: 0x0C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (BPM Offset: 0x10) Interrupt Clear Register */
  RoReg   SR;          /**< \brief (BPM Offset: 0x14) Status Register */
  WoReg   UNLOCK;      /**< \brief (BPM Offset: 0x18) Unlock Register */
  RwReg   PMCON;       /**< \brief (BPM Offset: 0x1C) Power Mode Control Register */
  RoReg   Reserved1[2];
  RoReg   BKUPWCAUSE;  /**< \brief (BPM Offset: 0x28) Backup Wake up Cause Register */
  RwReg   BKUPWEN;     /**< \brief (BPM Offset: 0x2C) Backup Wake up Enable Register */
  RwReg   BKUPPMUX;    /**< \brief (BPM Offset: 0x30) Backup Pin Muxing Register */
  RwReg   IORET;       /**< \brief (BPM Offset: 0x34) Input Output Retention Register */
  RoReg   Reserved2[2];
  RwReg   BPR;         /**< \brief (BPM Offset: 0x40) Bypass Register */
  RoReg   FWRUNPS;     /**< \brief (BPM Offset: 0x44) Factory Word Run PS Register */
  RoReg   FWPSAVEPS;   /**< \brief (BPM Offset: 0x48) Factory Word Power Save PS Register */
  RoReg   Reserved3[44];
  RoReg   VERSION;     /**< \brief (BPM Offset: 0xFC) Version Register */
} Bpm;
#endif /* __ASSEMBLY__ */
/* -------- BPM_IER : (BPM Offset: 0x00) Interrupt Enable Register -------- */
#define BPM_IER_PSOK                (0x1u <<  0) /**< \brief (BPM_IER) Power Scaling OK Interrupt Enable */
#define BPM_IER_AE                  (0x1u << 31) /**< \brief (BPM_IER) Access Error Interrupt Enable */
/* -------- BPM_IDR : (BPM Offset: 0x04) Interrupt Disable Register -------- */
#define BPM_IDR_PSOK                (0x1u <<  0) /**< \brief (BPM_IDR) Power Scaling OK Interrupt Disable */
#define BPM_IDR_AE                  (0x1u << 31) /**< \brief (BPM_IDR) Access Error Interrupt Disable */
/* -------- BPM_IMR : (BPM Offset: 0x08) Interrupt Mask Register -------- */
#define BPM_IMR_PSOK                (0x1u <<  0) /**< \brief (BPM_IMR) Power Scaling OK Interrupt Mask */
#define BPM_IMR_AE                  (0x1u << 31) /**< \brief (BPM_IMR) Access Error Interrupt Mask */
/* -------- BPM_ISR : (BPM Offset: 0x0C) Interrupt Status Register -------- */
#define BPM_ISR_PSOK                (0x1u <<  0) /**< \brief (BPM_ISR) Power Scaling OK Interrupt Status */
#define BPM_ISR_AE                  (0x1u << 31) /**< \brief (BPM_ISR) Access Error Interrupt Status */
/* -------- BPM_ICR : (BPM Offset: 0x10) Interrupt Clear Register -------- */
#define BPM_ICR_PSOK                (0x1u <<  0) /**< \brief (BPM_ICR) Power Scaling OK Interrupt Status Clear */
#define BPM_ICR_AE                  (0x1u << 31) /**< \brief (BPM_ICR) Access Error Interrupt Status Clear */
/* -------- BPM_SR : (BPM Offset: 0x14) Status Register -------- */
#define BPM_SR_PSOK                 (0x1u <<  0) /**< \brief (BPM_SR) Power Scaling OK Status */
/* -------- BPM_UNLOCK : (BPM Offset: 0x18) Unlock Register -------- */
#define BPM_UNLOCK_ADDR_Pos         0
#define BPM_UNLOCK_ADDR_Msk         (0x3FFu << BPM_UNLOCK_ADDR_Pos) /**< \brief (BPM_UNLOCK) Unlock Address */
#define BPM_UNLOCK_ADDR(value)      ((BPM_UNLOCK_ADDR_Msk & ((value) << BPM_UNLOCK_ADDR_Pos)))
#define BPM_UNLOCK_KEY_Pos          24
#define BPM_UNLOCK_KEY_Msk          (0xFFu << BPM_UNLOCK_KEY_Pos) /**< \brief (BPM_UNLOCK) Unlock Key */
#define BPM_UNLOCK_KEY(value)       ((BPM_UNLOCK_KEY_Msk & ((value) << BPM_UNLOCK_KEY_Pos)))
/* -------- BPM_PMCON : (BPM Offset: 0x1C) Power Mode Control Register -------- */
#define BPM_PMCON_PS_Pos            0
#define BPM_PMCON_PS_Msk            (0x3u << BPM_PMCON_PS_Pos) /**< \brief (BPM_PMCON) Power Scaling Configuration Value */
#define BPM_PMCON_PS(value)         ((BPM_PMCON_PS_Msk & ((value) << BPM_PMCON_PS_Pos)))
#define BPM_PMCON_PSCREQ            (0x1u <<  2) /**< \brief (BPM_PMCON) Power Scaling Change Request */
#define BPM_PMCON_PSCM              (0x1u <<  3) /**< \brief (BPM_PMCON) Power Scaling Change Mode */
#define BPM_PMCON_BKUP              (0x1u <<  8) /**< \brief (BPM_PMCON) BACKUP Mode */
#define BPM_PMCON_RET               (0x1u <<  9) /**< \brief (BPM_PMCON) RETENTION Mode */
#define BPM_PMCON_SLEEP_Pos         12
#define BPM_PMCON_SLEEP_Msk         (0x3u << BPM_PMCON_SLEEP_Pos) /**< \brief (BPM_PMCON) SLEEP mode Configuration */
#define BPM_PMCON_SLEEP(value)      ((BPM_PMCON_SLEEP_Msk & ((value) << BPM_PMCON_SLEEP_Pos)))
#define BPM_PMCON_CK32S             (0x1u << 16) /**< \brief (BPM_PMCON) 32Khz-1Khz Clock Source Selection */
#define BPM_PMCON_FASTWKUP          (0x1u << 24) /**< \brief (BPM_PMCON) Fast Wakeup */
/* -------- BPM_BKUPPMUX : (BPM Offset: 0x30) Backup Pin Muxing Register -------- */
#define BPM_BKUPPMUX_BKUPPMUX_Pos    0
#define BPM_BKUPPMUX_BKUPPMUX_Msk    (0x1FFu << BPM_BKUPPMUX_BKUPPMUX_Pos) /**< \brief (BPM_BKUPPMUX) Backup Pin Muxing */
#define BPM_BKUPPMUX_BKUPPMUX(value) ((BPM_BKUPPMUX_BKUPPMUX_Msk & ((value) << BPM_BKUPPMUX_BKUPPMUX_Pos)))
/* -------- BPM_IORET : (BPM Offset: 0x34) Input Output Retention Register -------- */
#define BPM_IORET_RET               (0x1u <<  0) /**< \brief (BPM_IORET) Retention on I/O lines after waking up from the BACKUP mode */
/* -------- BPM_BPR : (BPM Offset: 0x40) Bypass Register -------- */
#define BPM_BPR_RUNPSPB             (0x1u <<  0) /**< \brief (BPM_BPR) Run Mode Power Scaling Preset Bypass */
#define BPM_BPR_PSMPSPB             (0x1u <<  1) /**< \brief (BPM_BPR) Power Save Mode Power Scaling Preset Bypass */
#define BPM_BPR_SEQSTN              (0x1u <<  2) /**< \brief (BPM_BPR) Sequencial Startup from ULP (Active Low) */
#define BPM_BPR_PSBTD               (0x1u <<  3) /**< \brief (BPM_BPR) Power Scaling Bias Timing Disable */
#define BPM_BPR_PSHFD               (0x1u <<  4) /**< \brief (BPM_BPR) Power Scaling Halt Flash Until VREGOK Disable */
#define BPM_BPR_DLYRSTD             (0x1u <<  5) /**< \brief (BPM_BPR) Delaying Reset Disable */
#define BPM_BPR_BIASSEN             (0x1u <<  6) /**< \brief (BPM_BPR) Bias Switch Enable */
#define BPM_BPR_LATSEN              (0x1u <<  7) /**< \brief (BPM_BPR) Latdel Switch Enable */
#define BPM_BPR_BOD18CONT           (0x1u <<  8) /**< \brief (BPM_BPR) BOD18 in continuous mode not disabled in WAIT/RET/BACKUP modes */
#define BPM_BPR_POBS                (0x1u <<  9) /**< \brief (BPM_BPR) Pico Uart Observability */
#define BPM_BPR_FFFW                (0x1u << 10) /**< \brief (BPM_BPR) Force Flash Fast Wakeup */
#define BPM_BPR_FBRDYEN             (0x1u << 11) /**< \brief (BPM_BPR) Flash Bias Ready Enable */
#define BPM_BPR_FVREFSEN            (0x1u << 12) /**< \brief (BPM_BPR) Flash Vref Switch Enable */
/* -------- BPM_FWRUNPS : (BPM Offset: 0x44) Factory Word Run PS Register -------- */
#define BPM_FWRUNPS_REGLEVEL_Pos    0
#define BPM_FWRUNPS_REGLEVEL_Msk    (0xFu << BPM_FWRUNPS_REGLEVEL_Pos) /**< \brief (BPM_FWRUNPS) Regulator Voltage Level */
#define BPM_FWRUNPS_REGLEVEL(value) ((BPM_FWRUNPS_REGLEVEL_Msk & ((value) << BPM_FWRUNPS_REGLEVEL_Pos)))
#define BPM_FWRUNPS_REGTYPE_Pos     4
#define BPM_FWRUNPS_REGTYPE_Msk     (0x3u << BPM_FWRUNPS_REGTYPE_Pos) /**< \brief (BPM_FWRUNPS) Regulator Type */
#define BPM_FWRUNPS_REGTYPE(value)  ((BPM_FWRUNPS_REGTYPE_Msk & ((value) << BPM_FWRUNPS_REGTYPE_Pos)))
#define   BPM_FWRUNPS_REGTYPE_NORMAL (0x0u <<  4) /**< \brief (BPM_FWRUNPS)  */
#define   BPM_FWRUNPS_REGTYPE_LP    (0x1u <<  4) /**< \brief (BPM_FWRUNPS)  */
#define   BPM_FWRUNPS_REGTYPE_XULP  (0x2u <<  4) /**< \brief (BPM_FWRUNPS)  */
#define BPM_FWRUNPS_REFTYPE_Pos     6
#define BPM_FWRUNPS_REFTYPE_Msk     (0x3u << BPM_FWRUNPS_REFTYPE_Pos) /**< \brief (BPM_FWRUNPS) Reference Type */
#define BPM_FWRUNPS_REFTYPE(value)  ((BPM_FWRUNPS_REFTYPE_Msk & ((value) << BPM_FWRUNPS_REFTYPE_Pos)))
#define   BPM_FWRUNPS_REFTYPE_BOTH  (0x0u <<  6) /**< \brief (BPM_FWRUNPS)  */
#define   BPM_FWRUNPS_REFTYPE_BG    (0x1u <<  6) /**< \brief (BPM_FWRUNPS)  */
#define   BPM_FWRUNPS_REFTYPE_LPBG  (0x2u <<  6) /**< \brief (BPM_FWRUNPS)  */
#define   BPM_FWRUNPS_REFTYPE_INTERNAL (0x3u <<  6) /**< \brief (BPM_FWRUNPS)  */
#define BPM_FWRUNPS_FLASHLATDEL_Pos    8
#define BPM_FWRUNPS_FLASHLATDEL_Msk    (0x1Fu << BPM_FWRUNPS_FLASHLATDEL_Pos) /**< \brief (BPM_FWRUNPS) Flash Latch Delay Value */
#define BPM_FWRUNPS_FLASHLATDEL(value) ((BPM_FWRUNPS_FLASHLATDEL_Msk & ((value) << BPM_FWRUNPS_FLASHLATDEL_Pos)))
#define BPM_FWRUNPS_FLASHBIAS_Pos    13
#define BPM_FWRUNPS_FLASHBIAS_Msk    (0xFu << BPM_FWRUNPS_FLASHBIAS_Pos) /**< \brief (BPM_FWRUNPS) Flash Bias Value */
#define BPM_FWRUNPS_FLASHBIAS(value) ((BPM_FWRUNPS_FLASHBIAS_Msk & ((value) << BPM_FWRUNPS_FLASHBIAS_Pos)))
#define BPM_FWRUNPS_FPPW            (0x1u << 17) /**< \brief (BPM_FWRUNPS) Flash Pico Power Mode */
#define BPM_FWRUNPS_RC115_Pos       18
#define BPM_FWRUNPS_RC115_Msk       (0x7Fu << BPM_FWRUNPS_RC115_Pos) /**< \brief (BPM_FWRUNPS) RC 115KHZ Calibration Value */
#define BPM_FWRUNPS_RC115(value)    ((BPM_FWRUNPS_RC115_Msk & ((value) << BPM_FWRUNPS_RC115_Pos)))
#define BPM_FWRUNPS_RCFAST_Pos      25
#define BPM_FWRUNPS_RCFAST_Msk      (0x7Fu << BPM_FWRUNPS_RCFAST_Pos) /**< \brief (BPM_FWRUNPS) RCFAST Calibration Value */
#define BPM_FWRUNPS_RCFAST(value)   ((BPM_FWRUNPS_RCFAST_Msk & ((value) << BPM_FWRUNPS_RCFAST_Pos)))
/* -------- BPM_FWPSAVEPS : (BPM Offset: 0x48) Factory Word Power Save PS Register -------- */
#define BPM_FWPSAVEPS_WREGLEVEL_Pos    0
#define BPM_FWPSAVEPS_WREGLEVEL_Msk    (0xFu << BPM_FWPSAVEPS_WREGLEVEL_Pos) /**< \brief (BPM_FWPSAVEPS) Wait mode Regulator Level */
#define BPM_FWPSAVEPS_WREGLEVEL(value) ((BPM_FWPSAVEPS_WREGLEVEL_Msk & ((value) << BPM_FWPSAVEPS_WREGLEVEL_Pos)))
#define BPM_FWPSAVEPS_WBIAS_Pos     4
#define BPM_FWPSAVEPS_WBIAS_Msk     (0xFu << BPM_FWPSAVEPS_WBIAS_Pos) /**< \brief (BPM_FWPSAVEPS) Bias in wait mode */
#define BPM_FWPSAVEPS_WBIAS(value)  ((BPM_FWPSAVEPS_WBIAS_Msk & ((value) << BPM_FWPSAVEPS_WBIAS_Pos)))
#define BPM_FWPSAVEPS_WLATDEL_Pos    8
#define BPM_FWPSAVEPS_WLATDEL_Msk    (0x1Fu << BPM_FWPSAVEPS_WLATDEL_Pos) /**< \brief (BPM_FWPSAVEPS) Flash Latdel in wait mode */
#define BPM_FWPSAVEPS_WLATDEL(value) ((BPM_FWPSAVEPS_WLATDEL_Msk & ((value) << BPM_FWPSAVEPS_WLATDEL_Pos)))
#define BPM_FWPSAVEPS_RREGLEVEL_Pos    13
#define BPM_FWPSAVEPS_RREGLEVEL_Msk    (0xFu << BPM_FWPSAVEPS_RREGLEVEL_Pos) /**< \brief (BPM_FWPSAVEPS) Retention mode Regulator Level */
#define BPM_FWPSAVEPS_RREGLEVEL(value) ((BPM_FWPSAVEPS_RREGLEVEL_Msk & ((value) << BPM_FWPSAVEPS_RREGLEVEL_Pos)))
#define BPM_FWPSAVEPS_RBIAS_Pos     17
#define BPM_FWPSAVEPS_RBIAS_Msk     (0xFu << BPM_FWPSAVEPS_RBIAS_Pos) /**< \brief (BPM_FWPSAVEPS) Bias in Retention mode */
#define BPM_FWPSAVEPS_RBIAS(value)  ((BPM_FWPSAVEPS_RBIAS_Msk & ((value) << BPM_FWPSAVEPS_RBIAS_Pos)))
#define BPM_FWPSAVEPS_RLATDEL_Pos    21
#define BPM_FWPSAVEPS_RLATDEL_Msk    (0x1Fu << BPM_FWPSAVEPS_RLATDEL_Pos) /**< \brief (BPM_FWPSAVEPS) Flash Latdel in Retention mode */
#define BPM_FWPSAVEPS_RLATDEL(value) ((BPM_FWPSAVEPS_RLATDEL_Msk & ((value) << BPM_FWPSAVEPS_RLATDEL_Pos)))
#define BPM_FWPSAVEPS_BREGLEVEL_Pos    26
#define BPM_FWPSAVEPS_BREGLEVEL_Msk    (0xFu << BPM_FWPSAVEPS_BREGLEVEL_Pos) /**< \brief (BPM_FWPSAVEPS) Backup mode Regulator Level */
#define BPM_FWPSAVEPS_BREGLEVEL(value) ((BPM_FWPSAVEPS_BREGLEVEL_Msk & ((value) << BPM_FWPSAVEPS_BREGLEVEL_Pos)))
#define BPM_FWPSAVEPS_POR18DIS      (0x1u << 30) /**< \brief (BPM_FWPSAVEPS) POR 18 Disable */
#define BPM_FWPSAVEPS_FWSAS         (0x1u << 31) /**< \brief (BPM_FWPSAVEPS) Flash Wait State Automatic Switching */
/* -------- BPM_VERSION : (BPM Offset: 0xFC) Version Register -------- */
#define BPM_VERSION_VERSION_Pos     0
#define BPM_VERSION_VERSION_Msk     (0xFFFu << BPM_VERSION_VERSION_Pos) /**< \brief (BPM_VERSION) Version Number */
#define BPM_VERSION_VERSION(value)  ((BPM_VERSION_VERSION_Msk & ((value) << BPM_VERSION_VERSION_Pos)))
#define BPM_VERSION_VARIANT_Pos     16
#define BPM_VERSION_VARIANT_Msk     (0xFu << BPM_VERSION_VARIANT_Pos) /**< \brief (BPM_VERSION) Variant Number */
#define BPM_VERSION_VARIANT(value)  ((BPM_VERSION_VARIANT_Msk & ((value) << BPM_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR BSCIF */
/* ============================================================================= */
/** \addtogroup SAM4L4_BSCIF Backup System Control Interface */
/*@{*/

