Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REV_BSCIF      0x100

#ifndef __ASSEMBLY__
/** \brief BscifBr hardware registers */
typedef struct {
  RwReg   BR;          /**< \brief (BscifBr Offset: 0x000) Backup Register */
} BscifBr;
/** \brief BSCIF hardware registers */
typedef struct {
  WoReg   IER;         /**< \brief (BSCIF Offset: 0x000) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (BSCIF Offset: 0x004) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (BSCIF Offset: 0x008) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (BSCIF Offset: 0x00C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (BSCIF Offset: 0x010) Interrupt Clear Register */
  RoReg   PCLKSR;      /**< \brief (BSCIF Offset: 0x014) Power and Clocks Status Register */
  WoReg   UNLOCK;      /**< \brief (BSCIF Offset: 0x018) Unlock Register */
  RwReg   CSCR;        /**< \brief (BSCIF Offset: 0x01C) Chip Specific Configuration Register */
  RwReg   OSCCTRL32;   /**< \brief (BSCIF Offset: 0x020) Oscillator 32 Control Register */
  RwReg   RC32KCR;     /**< \brief (BSCIF Offset: 0x024) 32 kHz RC Oscillator Control Register */
  RwReg   RC32KTUNE;   /**< \brief (BSCIF Offset: 0x028) 32kHz RC Oscillator Tuning Register */
  RwReg   BOD33CTRL;   /**< \brief (BSCIF Offset: 0x02C) BOD33 Control Register */
  RwReg   BOD33LEVEL;  /**< \brief (BSCIF Offset: 0x030) BOD33 Level Register */
  RwReg   BOD33SAMPLING; /**< \brief (BSCIF Offset: 0x034) BOD33 Sampling Control Register */
  RwReg   BOD18CTRL;   /**< \brief (BSCIF Offset: 0x038) BOD18 Control Register */
  RwReg   BOD18LEVEL;  /**< \brief (BSCIF Offset: 0x03C) BOD18 Level Register */
  RwReg   BOD18SAMPLING;
  RwReg   VREGCR;      /**< \brief (BSCIF Offset: 0x044) Voltage Regulator Configuration Register */
  RoReg   Reserved2[1];
  RwReg   VREGNCSR;    /**< \brief (BSCIF Offset: 0x04C) Normal Mode Control and Status Register */
  RwReg   VREGLPCSR;   /**< \brief (BSCIF Offset: 0x050) LP Mode Control and Status Register */
  RoReg   Reserved3[1];
  RwReg   RC1MCR;      /**< \brief (BSCIF Offset: 0x058) 1MHz RC Clock Configuration Register */
  RwReg   BGCR;        /**< \brief (BSCIF Offset: 0x05C) Bandgap Calibration Register */
  RwReg   BGCTRL;      /**< \brief (BSCIF Offset: 0x060) Bandgap Control Register */
  RoReg   BGSR;        /**< \brief (BSCIF Offset: 0x064) Bandgap Status Register */
  RoReg   Reserved4[4];
  BscifBr Br[4]; /**< \brief (BSCIF Offset: 0x078) BscifBr groups */
  RoReg   Reserved5[215];
  RoReg   BRIFBVERSION; /**< \brief (BSCIF Offset: 0x3E4) Backup Register Interface Version Register */
  RoReg   BGREFIFBVERSION; /**< \brief (BSCIF Offset: 0x3E8) BGREFIFB Version Register */
  RoReg   VREGIFGVERSION; /**< \brief (BSCIF Offset: 0x3EC) VREGIFA Version Register */
  RoReg   BODIFCVERSION; /**< \brief (BSCIF Offset: 0x3F0) BODIFC Version Register */
  RoReg   RC32KIFBVERSION; /**< \brief (BSCIF Offset: 0x3F4) 32 kHz RC Oscillator Version Register */
  RoReg   OSC32IFAVERSION; /**< \brief (BSCIF Offset: 0x3F8) 32 KHz Oscillator Version Register */
  RoReg   VERSION;     /**< \brief (BSCIF Offset: 0x3FC) BSCIF Version Register */
} Bscif;
#endif /* __ASSEMBLY__ */
/* -------- BSCIF_IER : (BSCIF Offset: 0x000) Interrupt Enable Register -------- */
#define BSCIF_IER_OSC32RDY          (0x1u <<  0) /**< \brief (BSCIF_IER)  */
#define BSCIF_IER_RC32KRDY          (0x1u <<  1) /**< \brief (BSCIF_IER)  */
#define BSCIF_IER_RC32KLOCK         (0x1u <<  2) /**< \brief (BSCIF_IER)  */
#define BSCIF_IER_RC32KREFE         (0x1u <<  3) /**< \brief (BSCIF_IER)  */
#define BSCIF_IER_RC32KSAT          (0x1u <<  4) /**< \brief (BSCIF_IER)  */
#define BSCIF_IER_BOD33DET          (0x1u <<  5) /**< \brief (BSCIF_IER) BOD33 Detected */
#define BSCIF_IER_BOD18DET          (0x1u <<  6) /**< \brief (BSCIF_IER) BOD18 Detected */
#define BSCIF_IER_BOD33SYNRDY       (0x1u <<  7) /**< \brief (BSCIF_IER) BOD33 Synchronization Ready */
#define BSCIF_IER_BOD18SYNRDY       (0x1u <<  8) /**< \brief (BSCIF_IER) BOD18 Synchronization Ready */
#define BSCIF_IER_SSWRDY            (0x1u <<  9) /**< \brief (BSCIF_IER) VREG Stop Switching Ready */
#define BSCIF_IER_VREGOK            (0x1u << 10) /**< \brief (BSCIF_IER) Main VREG OK */
#define BSCIF_IER_LPBGRDY           (0x1u << 12) /**< \brief (BSCIF_IER) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IER_AE                (0x1u << 31) /**< \brief (BSCIF_IER) Access Error */
/* -------- BSCIF_IDR : (BSCIF Offset: 0x004) Interrupt Disable Register -------- */
#define BSCIF_IDR_OSC32RDY          (0x1u <<  0) /**< \brief (BSCIF_IDR)  */
#define BSCIF_IDR_RC32KRDY          (0x1u <<  1) /**< \brief (BSCIF_IDR)  */
#define BSCIF_IDR_RC32KLOCK         (0x1u <<  2) /**< \brief (BSCIF_IDR)  */
#define BSCIF_IDR_RC32KREFE         (0x1u <<  3) /**< \brief (BSCIF_IDR)  */
#define BSCIF_IDR_RC32KSAT          (0x1u <<  4) /**< \brief (BSCIF_IDR)  */
#define BSCIF_IDR_BOD33DET          (0x1u <<  5) /**< \brief (BSCIF_IDR) BOD33 Detected */
#define BSCIF_IDR_BOD18DET          (0x1u <<  6) /**< \brief (BSCIF_IDR) BOD18 Detected */
#define BSCIF_IDR_BOD33SYNRDY       (0x1u <<  7) /**< \brief (BSCIF_IDR) BOD33 Synchronization Ready */
#define BSCIF_IDR_BOD18SYNRDY       (0x1u <<  8) /**< \brief (BSCIF_IDR) BOD18 Synchronization Ready */
#define BSCIF_IDR_SSWRDY            (0x1u <<  9) /**< \brief (BSCIF_IDR) VREG Stop Switching Ready */
#define BSCIF_IDR_VREGOK            (0x1u << 10) /**< \brief (BSCIF_IDR) Mai n VREG OK */
#define BSCIF_IDR_LPBGRDY           (0x1u << 12) /**< \brief (BSCIF_IDR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IDR_AE                (0x1u << 31) /**< \brief (BSCIF_IDR) Access Error */
/* -------- BSCIF_IMR : (BSCIF Offset: 0x008) Interrupt Mask Register -------- */
#define BSCIF_IMR_OSC32RDY          (0x1u <<  0) /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KRDY          (0x1u <<  1) /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KLOCK         (0x1u <<  2) /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KREFE         (0x1u <<  3) /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_RC32KSAT          (0x1u <<  4) /**< \brief (BSCIF_IMR)  */
#define BSCIF_IMR_BOD33DET          (0x1u <<  5) /**< \brief (BSCIF_IMR) BOD33 Detected */
#define BSCIF_IMR_BOD18DET          (0x1u <<  6) /**< \brief (BSCIF_IMR) BOD18 Detected */
#define BSCIF_IMR_BOD33SYNRDY       (0x1u <<  7) /**< \brief (BSCIF_IMR) BOD33 Synchronization Ready */
#define BSCIF_IMR_BOD18SYNRDY       (0x1u <<  8) /**< \brief (BSCIF_IMR) BOD18 Synchronization Ready */
#define BSCIF_IMR_SSWRDY            (0x1u <<  9) /**< \brief (BSCIF_IMR) VREG Stop Switching Ready */
#define BSCIF_IMR_VREGOK            (0x1u << 10) /**< \brief (BSCIF_IMR) Main VREG OK */
#define BSCIF_IMR_LPBGRDY           (0x1u << 12) /**< \brief (BSCIF_IMR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IMR_AE                (0x1u << 31) /**< \brief (BSCIF_IMR) Access Error */
/* -------- BSCIF_ISR : (BSCIF Offset: 0x00C) Interrupt Status Register -------- */
#define BSCIF_ISR_OSC32RDY          (0x1u <<  0) /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KRDY          (0x1u <<  1) /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KLOCK         (0x1u <<  2) /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KREFE         (0x1u <<  3) /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_RC32KSAT          (0x1u <<  4) /**< \brief (BSCIF_ISR)  */
#define BSCIF_ISR_BOD33DET          (0x1u <<  5) /**< \brief (BSCIF_ISR) BOD33 Detected */
#define BSCIF_ISR_BOD18DET          (0x1u <<  6) /**< \brief (BSCIF_ISR) BOD18 Detected */
#define BSCIF_ISR_BOD33SYNRDY       (0x1u <<  7) /**< \brief (BSCIF_ISR) BOD33 Synchronization Ready */
#define BSCIF_ISR_BOD18SYNRDY       (0x1u <<  8) /**< \brief (BSCIF_ISR) BOD18 Synchronization Ready */
#define BSCIF_ISR_SSWRDY            (0x1u <<  9) /**< \brief (BSCIF_ISR) VREG Stop Switching Ready */
#define BSCIF_ISR_VREGOK            (0x1u << 10) /**< \brief (BSCIF_ISR) Main VREG OK */
#define BSCIF_ISR_LPBGRDY           (0x1u << 12) /**< \brief (BSCIF_ISR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_ISR_AE                (0x1u << 31) /**< \brief (BSCIF_ISR) Access Error */
/* -------- BSCIF_ICR : (BSCIF Offset: 0x010) Interrupt Clear Register -------- */
#define BSCIF_ICR_OSC32RDY          (0x1u <<  0) /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KRDY          (0x1u <<  1) /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KLOCK         (0x1u <<  2) /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KREFE         (0x1u <<  3) /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_RC32KSAT          (0x1u <<  4) /**< \brief (BSCIF_ICR)  */
#define BSCIF_ICR_BOD33DET          (0x1u <<  5) /**< \brief (BSCIF_ICR) BOD33 Detected */
#define BSCIF_ICR_BOD18DET          (0x1u <<  6) /**< \brief (BSCIF_ICR) BOD18 Detected */
#define BSCIF_ICR_BOD33SYNRDY       (0x1u <<  7) /**< \brief (BSCIF_ICR) BOD33 Synchronization Ready */
#define BSCIF_ICR_BOD18SYNRDY       (0x1u <<  8) /**< \brief (BSCIF_ICR) BOD18 Synchronization Ready */
#define BSCIF_ICR_SSWRDY            (0x1u <<  9) /**< \brief (BSCIF_ICR) VREG Stop Switching Ready */
#define BSCIF_ICR_VREGOK            (0x1u << 10) /**< \brief (BSCIF_ICR) Main VREG OK */
#define BSCIF_ICR_LPBGRDY           (0x1u << 12) /**< \brief (BSCIF_ICR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_ICR_AE                (0x1u << 31) /**< \brief (BSCIF_ICR) Access Error */
/* -------- BSCIF_PCLKSR : (BSCIF Offset: 0x014) Power and Clocks Status Register -------- */
#define BSCIF_PCLKSR_OSC32RDY       (0x1u <<  0) /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KRDY       (0x1u <<  1) /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KLOCK      (0x1u <<  2) /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KREFE      (0x1u <<  3) /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_RC32KSAT       (0x1u <<  4) /**< \brief (BSCIF_PCLKSR)  */
#define BSCIF_PCLKSR_BOD33DET       (0x1u <<  5) /**< \brief (BSCIF_PCLKSR) BOD33 Detected */
#define BSCIF_PCLKSR_BOD18DET       (0x1u <<  6) /**< \brief (BSCIF_PCLKSR) BOD18 Detected */
#define BSCIF_PCLKSR_BOD33SYNRDY    (0x1u <<  7) /**< \brief (BSCIF_PCLKSR) BOD33 Synchronization Ready */
#define BSCIF_PCLKSR_BOD18SYNRDY    (0x1u <<  8) /**< \brief (BSCIF_PCLKSR) BOD18 Synchronization Ready */
#define BSCIF_PCLKSR_SSWRDY         (0x1u <<  9) /**< \brief (BSCIF_PCLKSR) VREG Stop Switching Ready */
#define BSCIF_PCLKSR_VREGOK         (0x1u << 10) /**< \brief (BSCIF_PCLKSR) Main VREG OK */
#define BSCIF_PCLKSR_RC1MRDY        (0x1u << 11) /**< \brief (BSCIF_PCLKSR) RC 1MHz Oscillator Ready */
#define BSCIF_PCLKSR_LPBGRDY        (0x1u << 12) /**< \brief (BSCIF_PCLKSR) Low Power Bandgap Voltage Reference Ready */
/* -------- BSCIF_UNLOCK : (BSCIF Offset: 0x018) Unlock Register -------- */
#define BSCIF_UNLOCK_ADDR_Pos       0
#define BSCIF_UNLOCK_ADDR_Msk       (0x3FFu << BSCIF_UNLOCK_ADDR_Pos) /**< \brief (BSCIF_UNLOCK) Unlock Address */
#define BSCIF_UNLOCK_ADDR(value)    ((BSCIF_UNLOCK_ADDR_Msk & ((value) << BSCIF_UNLOCK_ADDR_Pos)))
#define BSCIF_UNLOCK_KEY_Pos        24
#define BSCIF_UNLOCK_KEY_Msk        (0xFFu << BSCIF_UNLOCK_KEY_Pos) /**< \brief (BSCIF_UNLOCK) Unlock Key */
#define BSCIF_UNLOCK_KEY(value)     ((BSCIF_UNLOCK_KEY_Msk & ((value) << BSCIF_UNLOCK_KEY_Pos)))
#define   BSCIF_UNLOCK_KEY_VALID    (0xAAu << 24) /**< \brief (BSCIF_UNLOCK) Valid Key to Unlock register */
/* -------- BSCIF_CSCR : (BSCIF Offset: 0x01C) Chip Specific Configuration Register -------- */
/* -------- BSCIF_OSCCTRL32 : (BSCIF Offset: 0x020) Oscillator 32 Control Register -------- */
#define BSCIF_OSCCTRL32_OSC32EN     (0x1u <<  0) /**< \brief (BSCIF_OSCCTRL32) 32 KHz Oscillator Enable */
#define BSCIF_OSCCTRL32_PINSEL      (0x1u <<  1) /**< \brief (BSCIF_OSCCTRL32) Pins Select */
#define BSCIF_OSCCTRL32_EN32K       (0x1u <<  2) /**< \brief (BSCIF_OSCCTRL32) 32 KHz output Enable */
#define BSCIF_OSCCTRL32_EN1K        (0x1u <<  3) /**< \brief (BSCIF_OSCCTRL32) 1 KHz output Enable */
#define BSCIF_OSCCTRL32_MODE_Pos    8
#define BSCIF_OSCCTRL32_MODE_Msk    (0x7u << BSCIF_OSCCTRL32_MODE_Pos) /**< \brief (BSCIF_OSCCTRL32) Oscillator Mode */
#define BSCIF_OSCCTRL32_MODE(value) ((BSCIF_OSCCTRL32_MODE_Msk & ((value) << BSCIF_OSCCTRL32_MODE_Pos)))
#define BSCIF_OSCCTRL32_SELCURR_Pos    12
#define BSCIF_OSCCTRL32_SELCURR_Msk    (0xFu << BSCIF_OSCCTRL32_SELCURR_Pos) /**< \brief (BSCIF_OSCCTRL32) Current selection */
#define BSCIF_OSCCTRL32_SELCURR(value) ((BSCIF_OSCCTRL32_SELCURR_Msk & ((value) << BSCIF_OSCCTRL32_SELCURR_Pos)))
#define BSCIF_OSCCTRL32_STARTUP_Pos    16
#define BSCIF_OSCCTRL32_STARTUP_Msk    (0x7u << BSCIF_OSCCTRL32_STARTUP_Pos) /**< \brief (BSCIF_OSCCTRL32) Oscillator Start-up Time */
#define BSCIF_OSCCTRL32_STARTUP(value) ((BSCIF_OSCCTRL32_STARTUP_Msk & ((value) << BSCIF_OSCCTRL32_STARTUP_Pos)))
/* -------- BSCIF_RC32KCR : (BSCIF Offset: 0x024) 32 kHz RC Oscillator Control Register -------- */
#define BSCIF_RC32KCR_EN            (0x1u <<  0) /**< \brief (BSCIF_RC32KCR) Enable as Generic clock source */
#define BSCIF_RC32KCR_TCEN          (0x1u <<  1) /**< \brief (BSCIF_RC32KCR) Temperature Compensation Enable */
#define BSCIF_RC32KCR_EN32K         (0x1u <<  2) /**< \brief (BSCIF_RC32KCR) Enable 32 KHz output */
#define BSCIF_RC32KCR_EN1K          (0x1u <<  3) /**< \brief (BSCIF_RC32KCR) Enable 1 kHz output */
#define BSCIF_RC32KCR_MODE          (0x1u <<  4) /**< \brief (BSCIF_RC32KCR) Mode Selection */
#define BSCIF_RC32KCR_REF           (0x1u <<  5) /**< \brief (BSCIF_RC32KCR) Reference select */
#define BSCIF_RC32KCR_FCD           (0x1u <<  7) /**< \brief (BSCIF_RC32KCR) Flash calibration done */
/* -------- BSCIF_RC32KTUNE : (BSCIF Offset: 0x028) 32kHz RC Oscillator Tuning Register -------- */
#define BSCIF_RC32KTUNE_FINE_Pos    0
#define BSCIF_RC32KTUNE_FINE_Msk    (0x3Fu << BSCIF_RC32KTUNE_FINE_Pos) /**< \brief (BSCIF_RC32KTUNE) Fine value */
#define BSCIF_RC32KTUNE_FINE(value) ((BSCIF_RC32KTUNE_FINE_Msk & ((value) << BSCIF_RC32KTUNE_FINE_Pos)))
#define BSCIF_RC32KTUNE_COARSE_Pos    16
#define BSCIF_RC32KTUNE_COARSE_Msk    (0x7Fu << BSCIF_RC32KTUNE_COARSE_Pos) /**< \brief (BSCIF_RC32KTUNE) Coarse Value */
#define BSCIF_RC32KTUNE_COARSE(value) ((BSCIF_RC32KTUNE_COARSE_Msk & ((value) << BSCIF_RC32KTUNE_COARSE_Pos)))
/* -------- BSCIF_BOD33CTRL : (BSCIF Offset: 0x02C) BOD33 Control Register -------- */
#define BSCIF_BOD33CTRL_EN          (0x1u <<  0) /**< \brief (BSCIF_BOD33CTRL) Enable */
#define BSCIF_BOD33CTRL_HYST        (0x1u <<  1) /**< \brief (BSCIF_BOD33CTRL) BOD Hysteresis */
#define BSCIF_BOD33CTRL_ACTION_Pos    8
#define BSCIF_BOD33CTRL_ACTION_Msk    (0x3u << BSCIF_BOD33CTRL_ACTION_Pos) /**< \brief (BSCIF_BOD33CTRL) Action */
#define BSCIF_BOD33CTRL_ACTION(value) ((BSCIF_BOD33CTRL_ACTION_Msk & ((value) << BSCIF_BOD33CTRL_ACTION_Pos)))
#define BSCIF_BOD33CTRL_MODE        (0x1u << 16) /**< \brief (BSCIF_BOD33CTRL) Operation modes */
#define BSCIF_BOD33CTRL_FCD         (0x1u << 30) /**< \brief (BSCIF_BOD33CTRL) BOD Fuse Calibration Done */
#define BSCIF_BOD33CTRL_SFV         (0x1u << 31) /**< \brief (BSCIF_BOD33CTRL) BOD Control Register Store Final Value */
/* -------- BSCIF_BOD33LEVEL : (BSCIF Offset: 0x030) BOD33 Level Register -------- */
#define BSCIF_BOD33LEVEL_VAL_Pos    0
#define BSCIF_BOD33LEVEL_VAL_Msk    (0x3Fu << BSCIF_BOD33LEVEL_VAL_Pos) /**< \brief (BSCIF_BOD33LEVEL) BOD Value */
#define BSCIF_BOD33LEVEL_VAL(value) ((BSCIF_BOD33LEVEL_VAL_Msk & ((value) << BSCIF_BOD33LEVEL_VAL_Pos)))
/* -------- BSCIF_BOD33SAMPLING : (BSCIF Offset: 0x034) BOD33 Sampling Control Register -------- */
#define BSCIF_BOD33SAMPLING_CEN     (0x1u <<  0) /**< \brief (BSCIF_BOD33SAMPLING) Clock Enable */
#define BSCIF_BOD33SAMPLING_CSSEL   (0x1u <<  1) /**< \brief (BSCIF_BOD33SAMPLING) Clock Source Select */
#define BSCIF_BOD33SAMPLING_PSEL_Pos    8
#define BSCIF_BOD33SAMPLING_PSEL_Msk    (0xFu << BSCIF_BOD33SAMPLING_PSEL_Pos) /**< \brief (BSCIF_BOD33SAMPLING) Prescaler Select */
#define BSCIF_BOD33SAMPLING_PSEL(value) ((BSCIF_BOD33SAMPLING_PSEL_Msk & ((value) << BSCIF_BOD33SAMPLING_PSEL_Pos)))
/* -------- BSCIF_BOD18CTRL : (BSCIF Offset: 0x038) BOD18 Control Register -------- */
#define BSCIF_BOD18CTRL_EN          (0x1u <<  0) /**< \brief (BSCIF_BOD18CTRL) Enable */
#define BSCIF_BOD18CTRL_HYST        (0x1u <<  1) /**< \brief (BSCIF_BOD18CTRL) BOD Hysteresis */
#define BSCIF_BOD18CTRL_ACTION_Pos    8
#define BSCIF_BOD18CTRL_ACTION_Msk    (0x3u << BSCIF_BOD18CTRL_ACTION_Pos) /**< \brief (BSCIF_BOD18CTRL) Action */
#define BSCIF_BOD18CTRL_ACTION(value) ((BSCIF_BOD18CTRL_ACTION_Msk & ((value) << BSCIF_BOD18CTRL_ACTION_Pos)))
#define BSCIF_BOD18CTRL_MODE        (0x1u << 16) /**< \brief (BSCIF_BOD18CTRL) Operation modes */
#define BSCIF_BOD18CTRL_FCD         (0x1u << 30) /**< \brief (BSCIF_BOD18CTRL) BOD Fuse Calibration Done */
#define BSCIF_BOD18CTRL_SFV         (0x1u << 31) /**< \brief (BSCIF_BOD18CTRL) BOD Control Register Store Final Value */
/* -------- BSCIF_BOD18LEVEL : (BSCIF Offset: 0x03C) BOD18 Level Register -------- */
#define BSCIF_BOD18LEVEL_VAL_Pos    0
#define BSCIF_BOD18LEVEL_VAL_Msk    (0x3Fu << BSCIF_BOD18LEVEL_VAL_Pos) /**< \brief (BSCIF_BOD18LEVEL) BOD Value */
#define BSCIF_BOD18LEVEL_VAL(value) ((BSCIF_BOD18LEVEL_VAL_Msk & ((value) << BSCIF_BOD18LEVEL_VAL_Pos)))
#define BSCIF_BOD18LEVEL_RANGE      (0x1u << 31) /**< \brief (BSCIF_BOD18LEVEL) BOD Threshold Range */
/* -------- BSCIF_VREGCR : (BSCIF Offset: 0x044) Voltage Regulator Configuration Register -------- */
#define BSCIF_VREGCR_DIS            (0x1u <<  0) /**< \brief (BSCIF_VREGCR) Voltage Regulator disable */
#define BSCIF_VREGCR_SSG            (0x1u <<  8) /**< \brief (BSCIF_VREGCR) Spread Spectrum Generator Enable */
#define BSCIF_VREGCR_SSW            (0x1u <<  9) /**< \brief (BSCIF_VREGCR) Stop Switching */
#define BSCIF_VREGCR_SSWEVT         (0x1u << 10) /**< \brief (BSCIF_VREGCR) Stop Switching On Event Enable */
#define BSCIF_VREGCR_SFV            (0x1u << 31) /**< \brief (BSCIF_VREGCR) Store Final Value */
/* -------- BSCIF_VREGNCSR : (BSCIF Offset: 0x04C) Normal Mode Control and Status Register -------- */
/* -------- BSCIF_VREGLPCSR : (BSCIF Offset: 0x050) LP Mode Control and Status Register -------- */
/* -------- BSCIF_RC1MCR : (BSCIF Offset: 0x058) 1MHz RC Clock Configuration Register -------- */
#define BSCIF_RC1MCR_CLKOE          (0x1u <<  0) /**< \brief (BSCIF_RC1MCR) 1MHz RC Osc Clock Output Enable */
#define BSCIF_RC1MCR_FCD            (0x1u <<  7) /**< \brief (BSCIF_RC1MCR) Flash Calibration Done */
#define BSCIF_RC1MCR_CLKCAL_Pos     8
#define BSCIF_RC1MCR_CLKCAL_Msk     (0x1Fu << BSCIF_RC1MCR_CLKCAL_Pos) /**< \brief (BSCIF_RC1MCR) 1MHz RC Osc Calibration */
#define BSCIF_RC1MCR_CLKCAL(value)  ((BSCIF_RC1MCR_CLKCAL_Msk & ((value) << BSCIF_RC1MCR_CLKCAL_Pos)))
/* -------- BSCIF_BGCR : (BSCIF Offset: 0x05C) Bandgap Calibration Register -------- */
/* -------- BSCIF_BGCTRL : (BSCIF Offset: 0x060) Bandgap Control Register -------- */
#define BSCIF_BGCTRL_ADCISEL_Pos    0
#define BSCIF_BGCTRL_ADCISEL_Msk    (0x3u << BSCIF_BGCTRL_ADCISEL_Pos) /**< \brief (BSCIF_BGCTRL) ADC Input Selection */
#define BSCIF_BGCTRL_ADCISEL(value) ((BSCIF_BGCTRL_ADCISEL_Msk & ((value) << BSCIF_BGCTRL_ADCISEL_Pos)))
#define   BSCIF_BGCTRL_ADCISEL_DIS  (0x0u <<  0) /**< \brief (BSCIF_BGCTRL)  */
#define   BSCIF_BGCTRL_ADCISEL_VTEMP (0x1u <<  0) /**< \brief (BSCIF_BGCTRL)  */
#define   BSCIF_BGCTRL_ADCISEL_VREF (0x2u <<  0) /**< \brief (BSCIF_BGCTRL)  */
#define BSCIF_BGCTRL_TSEN           (0x1u <<  8) /**< \brief (BSCIF_BGCTRL) Temperature Sensor Enable */
/* -------- BSCIF_BGSR : (BSCIF Offset: 0x064) Bandgap Status Register -------- */
#define BSCIF_BGSR_BGBUFRDY_Pos     0
#define BSCIF_BGSR_BGBUFRDY_Msk     (0xFFu << BSCIF_BGSR_BGBUFRDY_Pos) /**< \brief (BSCIF_BGSR) Bandgap Buffer Ready */
#define BSCIF_BGSR_BGBUFRDY(value)  ((BSCIF_BGSR_BGBUFRDY_Msk & ((value) << BSCIF_BGSR_BGBUFRDY_Pos)))
#define   BSCIF_BGSR_BGBUFRDY_FLASH (0x1u <<  0) /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_PLL   (0x2u <<  0) /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_VREG  (0x4u <<  0) /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_BUFRR (0x8u <<  0) /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_ADC   (0x10u <<  0) /**< \brief (BSCIF_BGSR)  */
#define   BSCIF_BGSR_BGBUFRDY_LCD   (0x20u <<  0) /**< \brief (BSCIF_BGSR)  */
#define BSCIF_BGSR_BGRDY            (0x1u << 16) /**< \brief (BSCIF_BGSR) Bandgap Voltage Reference Ready */
#define BSCIF_BGSR_LPBGRDY          (0x1u << 17) /**< \brief (BSCIF_BGSR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_BGSR_VREF_Pos         18
#define BSCIF_BGSR_VREF_Msk         (0x3u << BSCIF_BGSR_VREF_Pos) /**< \brief (BSCIF_BGSR) Voltage Reference Used by the System */
#define BSCIF_BGSR_VREF(value)      ((BSCIF_BGSR_VREF_Msk & ((value) << BSCIF_BGSR_VREF_Pos)))
/* -------- BSCIF_BRIFBVERSION : (BSCIF Offset: 0x3E4) Backup Register Interface Version Register -------- */
#define BSCIF_BRIFBVERSION_VERSION_Pos    0
#define BSCIF_BRIFBVERSION_VERSION_Msk    (0xFFFu << BSCIF_BRIFBVERSION_VERSION_Pos) /**< \brief (BSCIF_BRIFBVERSION) Version Number */
#define BSCIF_BRIFBVERSION_VERSION(value) ((BSCIF_BRIFBVERSION_VERSION_Msk & ((value) << BSCIF_BRIFBVERSION_VERSION_Pos)))
#define BSCIF_BRIFBVERSION_VARIANT_Pos    16
#define BSCIF_BRIFBVERSION_VARIANT_Msk    (0xFu << BSCIF_BRIFBVERSION_VARIANT_Pos) /**< \brief (BSCIF_BRIFBVERSION) Variant Number */
#define BSCIF_BRIFBVERSION_VARIANT(value) ((BSCIF_BRIFBVERSION_VARIANT_Msk & ((value) << BSCIF_BRIFBVERSION_VARIANT_Pos)))
/* -------- BSCIF_BGREFIFBVERSION : (BSCIF Offset: 0x3E8) BGREFIFB Version Register -------- */
#define BSCIF_BGREFIFBVERSION_VERSION_Pos    0
#define BSCIF_BGREFIFBVERSION_VERSION_Msk    (0xFFFu << BSCIF_BGREFIFBVERSION_VERSION_Pos) /**< \brief (BSCIF_BGREFIFBVERSION) Version Number */
#define BSCIF_BGREFIFBVERSION_VERSION(value) ((BSCIF_BGREFIFBVERSION_VERSION_Msk & ((value) << BSCIF_BGREFIFBVERSION_VERSION_Pos)))
#define BSCIF_BGREFIFBVERSION_VARIANT_Pos    16
#define BSCIF_BGREFIFBVERSION_VARIANT_Msk    (0xFu << BSCIF_BGREFIFBVERSION_VARIANT_Pos) /**< \brief (BSCIF_BGREFIFBVERSION) Variant Number */
#define BSCIF_BGREFIFBVERSION_VARIANT(value) ((BSCIF_BGREFIFBVERSION_VARIANT_Msk & ((value) << BSCIF_BGREFIFBVERSION_VARIANT_Pos)))
/* -------- BSCIF_VREGIFGVERSION : (BSCIF Offset: 0x3EC) VREGIFA Version Register -------- */
#define BSCIF_VREGIFGVERSION_VERSION_Pos    0
#define BSCIF_VREGIFGVERSION_VERSION_Msk    (0xFFFu << BSCIF_VREGIFGVERSION_VERSION_Pos) /**< \brief (BSCIF_VREGIFGVERSION) Version Number */
#define BSCIF_VREGIFGVERSION_VERSION(value) ((BSCIF_VREGIFGVERSION_VERSION_Msk & ((value) << BSCIF_VREGIFGVERSION_VERSION_Pos)))
#define BSCIF_VREGIFGVERSION_VARIANT_Pos    16
#define BSCIF_VREGIFGVERSION_VARIANT_Msk    (0xFu << BSCIF_VREGIFGVERSION_VARIANT_Pos) /**< \brief (BSCIF_VREGIFGVERSION) Variant Number */
#define BSCIF_VREGIFGVERSION_VARIANT(value) ((BSCIF_VREGIFGVERSION_VARIANT_Msk & ((value) << BSCIF_VREGIFGVERSION_VARIANT_Pos)))
/* -------- BSCIF_BODIFCVERSION : (BSCIF Offset: 0x3F0) BODIFC Version Register -------- */
#define BSCIF_BODIFCVERSION_VERSION_Pos    0
#define BSCIF_BODIFCVERSION_VERSION_Msk    (0xFFFu << BSCIF_BODIFCVERSION_VERSION_Pos) /**< \brief (BSCIF_BODIFCVERSION) Version Number */
#define BSCIF_BODIFCVERSION_VERSION(value) ((BSCIF_BODIFCVERSION_VERSION_Msk & ((value) << BSCIF_BODIFCVERSION_VERSION_Pos)))
#define BSCIF_BODIFCVERSION_VARIANT_Pos    16
