Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define BSCIF_BODIFCVERSION_VARIANT_Msk    (0xFu << BSCIF_BODIFCVERSION_VARIANT_Pos) /**< \brief (BSCIF_BODIFCVERSION) Variant Number */
#define BSCIF_BODIFCVERSION_VARIANT(value) ((BSCIF_BODIFCVERSION_VARIANT_Msk & ((value) << BSCIF_BODIFCVERSION_VARIANT_Pos)))
/* -------- BSCIF_RC32KIFBVERSION : (BSCIF Offset: 0x3F4) 32 kHz RC Oscillator Version Register -------- */
#define BSCIF_RC32KIFBVERSION_VERSION_Pos    0
#define BSCIF_RC32KIFBVERSION_VERSION_Msk    (0xFFFu << BSCIF_RC32KIFBVERSION_VERSION_Pos) /**< \brief (BSCIF_RC32KIFBVERSION) Version number */
#define BSCIF_RC32KIFBVERSION_VERSION(value) ((BSCIF_RC32KIFBVERSION_VERSION_Msk & ((value) << BSCIF_RC32KIFBVERSION_VERSION_Pos)))
#define BSCIF_RC32KIFBVERSION_VARIANT_Pos    16
#define BSCIF_RC32KIFBVERSION_VARIANT_Msk    (0xFu << BSCIF_RC32KIFBVERSION_VARIANT_Pos) /**< \brief (BSCIF_RC32KIFBVERSION) Variant number */
#define BSCIF_RC32KIFBVERSION_VARIANT(value) ((BSCIF_RC32KIFBVERSION_VARIANT_Msk & ((value) << BSCIF_RC32KIFBVERSION_VARIANT_Pos)))
/* -------- BSCIF_OSC32IFAVERSION : (BSCIF Offset: 0x3F8) 32 KHz Oscillator Version Register -------- */
#define BSCIF_OSC32IFAVERSION_VERSION_Pos    0
#define BSCIF_OSC32IFAVERSION_VERSION_Msk    (0xFFFu << BSCIF_OSC32IFAVERSION_VERSION_Pos) /**< \brief (BSCIF_OSC32IFAVERSION) Version number */
#define BSCIF_OSC32IFAVERSION_VERSION(value) ((BSCIF_OSC32IFAVERSION_VERSION_Msk & ((value) << BSCIF_OSC32IFAVERSION_VERSION_Pos)))
#define BSCIF_OSC32IFAVERSION_VARIANT_Pos    16
#define BSCIF_OSC32IFAVERSION_VARIANT_Msk    (0xFu << BSCIF_OSC32IFAVERSION_VARIANT_Pos) /**< \brief (BSCIF_OSC32IFAVERSION) Variant nubmer */
#define BSCIF_OSC32IFAVERSION_VARIANT(value) ((BSCIF_OSC32IFAVERSION_VARIANT_Msk & ((value) << BSCIF_OSC32IFAVERSION_VARIANT_Pos)))
/* -------- BSCIF_VERSION : (BSCIF Offset: 0x3FC) BSCIF Version Register -------- */
#define BSCIF_VERSION_VERSION_Pos    0
#define BSCIF_VERSION_VERSION_Msk    (0xFFFu << BSCIF_VERSION_VERSION_Pos) /**< \brief (BSCIF_VERSION) Version Number */
#define BSCIF_VERSION_VERSION(value) ((BSCIF_VERSION_VERSION_Msk & ((value) << BSCIF_VERSION_VERSION_Pos)))
#define BSCIF_VERSION_VARIANT_Pos    16
#define BSCIF_VERSION_VARIANT_Msk    (0xFu << BSCIF_VERSION_VARIANT_Pos) /**< \brief (BSCIF_VERSION) Variant Number */
#define BSCIF_VERSION_VARIANT(value) ((BSCIF_VERSION_VARIANT_Msk & ((value) << BSCIF_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR CATB */
/* ============================================================================= */
/** \addtogroup SAM4L4_CATB Capacitive Touch Module B */
/*@{*/

#define REV_CATB       0x100

#ifndef __ASSEMBLY__
/** \brief CatbIntch hardware registers */
typedef struct {
  RoReg   INTCH;       /**< \brief (CatbIntch Offset: 0x00) In-Touch Status Register 0 */
} CatbIntch;
/** \brief CatbIntchclr hardware registers */
typedef struct {
  WoReg   INTCHCLR;    /**< \brief (CatbIntchclr Offset: 0x00) In-Touch Status Clear Register 0 */
} CatbIntchclr;
/** \brief CatbOuttch hardware registers */
typedef struct {
  RoReg   OUTTCH;      /**< \brief (CatbOuttch Offset: 0x00) Out-of-Touch Status Register 0 */
} CatbOuttch;
/** \brief CatbOuttchclr hardware registers */
typedef struct {
  WoReg   OUTTCHCLR;   /**< \brief (CatbOuttchclr Offset: 0x00) Out-of-Touch Status Clear Register 0 */
} CatbOuttchclr;
/** \brief CATB hardware registers */
#define CATB_STATUS_REG_NUMBER 1
typedef struct {
  RwReg   CR;          /**< \brief (CATB Offset: 0x00) Control Register */
  RwReg   CNTCR;       /**< \brief (CATB Offset: 0x04) Counter Control Register */
  RwReg   IDLE;        /**< \brief (CATB Offset: 0x08) Sensor Idle Level */
  RoReg   LEVEL;       /**< \brief (CATB Offset: 0x0C) Sensor Relative Level */
  RoReg   RAW;         /**< \brief (CATB Offset: 0x10) Sensor Raw Value */
  RwReg   TIMING;      /**< \brief (CATB Offset: 0x14) Filter Timing Register */
  RwReg   THRESH;      /**< \brief (CATB Offset: 0x18) Threshold Register */
  RwReg   PINSEL;      /**< \brief (CATB Offset: 0x1C) Pin Selection Register */
  RwReg   DMA;         /**< \brief (CATB Offset: 0x20) Direct Memory Access Register */
  RoReg   ISR;         /**< \brief (CATB Offset: 0x24) Interrupt Status Register */
  WoReg   IER;         /**< \brief (CATB Offset: 0x28) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (CATB Offset: 0x2C) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (CATB Offset: 0x30) Interrupt Mask Register */
  WoReg   SCR;         /**< \brief (CATB Offset: 0x34) Status Clear Register */
  RoReg   Reserved1[2];
  CatbIntch Intch[CATB_STATUS_REG_NUMBER]; /**< \brief (CATB Offset: 0x40) CatbIntch groups */
  CatbIntch Reserved2[4 - CATB_STATUS_REG_NUMBER];
  CatbIntchclr Intchclr[CATB_STATUS_REG_NUMBER]; /**< \brief (CATB Offset: 0x50) CatbIntchclr groups */
  CatbIntchclr Reserved3[4 - CATB_STATUS_REG_NUMBER];
  CatbOuttch Outtch[CATB_STATUS_REG_NUMBER]; /**< \brief (CATB Offset: 0x60) CatbOuttch groups */
  CatbOuttch Reserved4[4 - CATB_STATUS_REG_NUMBER];
  CatbOuttchclr Outtchclr[CATB_STATUS_REG_NUMBER]; /**< \brief (CATB Offset: 0x70) CatbOuttchclr groups */
  CatbOuttchclr Reserved5[4 - CATB_STATUS_REG_NUMBER];
  RoReg   Reserved6[30];
  RoReg   PARAMETER;   /**< \brief (CATB Offset: 0xF8) Parameter Register */
  RoReg   VERSION;     /**< \brief (CATB Offset: 0xFC) Version Register */
} Catb;
#endif /* __ASSEMBLY__ */
/* -------- CATB_CR : (CATB Offset: 0x00) Control Register -------- */
#define CATB_CR_EN                  (0x1u <<  0) /**< \brief (CATB_CR) Module Enable */
#define CATB_CR_RUN                 (0x1u <<  1) /**< \brief (CATB_CR) Start Operation */
#define CATB_CR_IIDLE               (0x1u <<  2) /**< \brief (CATB_CR) Initialize Idle Value */
#define CATB_CR_ETRIG               (0x1u <<  3) /**< \brief (CATB_CR) Event Triggered Operation */
#define CATB_CR_INTRES              (0x1u <<  4) /**< \brief (CATB_CR) Internal Resistors */
#define CATB_CR_CKSEL               (0x1u <<  5) /**< \brief (CATB_CR) Clock Select */
#define CATB_CR_DIFF                (0x1u <<  6) /**< \brief (CATB_CR) Differential Mode */
#define CATB_CR_DMAEN               (0x1u <<  7) /**< \brief (CATB_CR) DMA Enable */
#define CATB_CR_ESAMPLES_Pos        8
#define CATB_CR_ESAMPLES_Msk        (0x7Fu << CATB_CR_ESAMPLES_Pos) /**< \brief (CATB_CR) Number of Event Samples */
#define CATB_CR_ESAMPLES(value)     ((CATB_CR_ESAMPLES_Msk & ((value) << CATB_CR_ESAMPLES_Pos)))
#define CATB_CR_CHARGET_Pos         16
#define CATB_CR_CHARGET_Msk         (0xFu << CATB_CR_CHARGET_Pos) /**< \brief (CATB_CR) Charge Time */
#define CATB_CR_CHARGET(value)      ((CATB_CR_CHARGET_Msk & ((value) << CATB_CR_CHARGET_Pos)))
#define CATB_CR_SWRST               (0x1u << 31) /**< \brief (CATB_CR) Software Reset */
/* -------- CATB_CNTCR : (CATB Offset: 0x04) Counter Control Register -------- */
#define CATB_CNTCR_TOP_Pos          0
#define CATB_CNTCR_TOP_Msk          (0xFFFFFFu << CATB_CNTCR_TOP_Pos) /**< \brief (CATB_CNTCR) Counter Top Value */
#define CATB_CNTCR_TOP(value)       ((CATB_CNTCR_TOP_Msk & ((value) << CATB_CNTCR_TOP_Pos)))
#define CATB_CNTCR_SPREAD_Pos       24
#define CATB_CNTCR_SPREAD_Msk       (0xFu << CATB_CNTCR_SPREAD_Pos) /**< \brief (CATB_CNTCR) Spread Spectrum */
#define CATB_CNTCR_SPREAD(value)    ((CATB_CNTCR_SPREAD_Msk & ((value) << CATB_CNTCR_SPREAD_Pos)))
#define CATB_CNTCR_REPEAT_Pos       28
#define CATB_CNTCR_REPEAT_Msk       (0x7u << CATB_CNTCR_REPEAT_Pos) /**< \brief (CATB_CNTCR) Repeat Measurements */
#define CATB_CNTCR_REPEAT(value)    ((CATB_CNTCR_REPEAT_Msk & ((value) << CATB_CNTCR_REPEAT_Pos)))
/* -------- CATB_IDLE : (CATB Offset: 0x08) Sensor Idle Level -------- */
#define CATB_IDLE_FIDLE_Pos         0
#define CATB_IDLE_FIDLE_Msk         (0xFFFu << CATB_IDLE_FIDLE_Pos) /**< \brief (CATB_IDLE) Fractional Sensor Idle */
#define CATB_IDLE_FIDLE(value)      ((CATB_IDLE_FIDLE_Msk & ((value) << CATB_IDLE_FIDLE_Pos)))
#define CATB_IDLE_RIDLE_Pos         12
#define CATB_IDLE_RIDLE_Msk         (0xFFFFu << CATB_IDLE_RIDLE_Pos) /**< \brief (CATB_IDLE) Integer Sensor Idle */
#define CATB_IDLE_RIDLE(value)      ((CATB_IDLE_RIDLE_Msk & ((value) << CATB_IDLE_RIDLE_Pos)))
/* -------- CATB_LEVEL : (CATB Offset: 0x0C) Sensor Relative Level -------- */
#define CATB_LEVEL_FLEVEL_Pos       0
#define CATB_LEVEL_FLEVEL_Msk       (0xFFFu << CATB_LEVEL_FLEVEL_Pos) /**< \brief (CATB_LEVEL) Fractional Sensor Level */
#define CATB_LEVEL_FLEVEL(value)    ((CATB_LEVEL_FLEVEL_Msk & ((value) << CATB_LEVEL_FLEVEL_Pos)))
#define CATB_LEVEL_RLEVEL_Pos       12
#define CATB_LEVEL_RLEVEL_Msk       (0xFFu << CATB_LEVEL_RLEVEL_Pos) /**< \brief (CATB_LEVEL) Integer Sensor Level */
#define CATB_LEVEL_RLEVEL(value)    ((CATB_LEVEL_RLEVEL_Msk & ((value) << CATB_LEVEL_RLEVEL_Pos)))
/* -------- CATB_RAW : (CATB Offset: 0x10) Sensor Raw Value -------- */
#define CATB_RAW_RAWA_Pos           16
#define CATB_RAW_RAWA_Msk           (0xFFu << CATB_RAW_RAWA_Pos) /**< \brief (CATB_RAW) Current Sensor Raw Value */
#define CATB_RAW_RAWA(value)        ((CATB_RAW_RAWA_Msk & ((value) << CATB_RAW_RAWA_Pos)))
#define CATB_RAW_RAWB_Pos           24
#define CATB_RAW_RAWB_Msk           (0xFFu << CATB_RAW_RAWB_Pos) /**< \brief (CATB_RAW) Last Sensor Raw Value */
#define CATB_RAW_RAWB(value)        ((CATB_RAW_RAWB_Msk & ((value) << CATB_RAW_RAWB_Pos)))
/* -------- CATB_TIMING : (CATB Offset: 0x14) Filter Timing Register -------- */
#define CATB_TIMING_TLEVEL_Pos      0
#define CATB_TIMING_TLEVEL_Msk      (0xFFFu << CATB_TIMING_TLEVEL_Pos) /**< \brief (CATB_TIMING) Relative Level Smoothing */
#define CATB_TIMING_TLEVEL(value)   ((CATB_TIMING_TLEVEL_Msk & ((value) << CATB_TIMING_TLEVEL_Pos)))
#define CATB_TIMING_TIDLE_Pos       16
#define CATB_TIMING_TIDLE_Msk       (0xFFFu << CATB_TIMING_TIDLE_Pos) /**< \brief (CATB_TIMING) Idle Smoothening */
#define CATB_TIMING_TIDLE(value)    ((CATB_TIMING_TIDLE_Msk & ((value) << CATB_TIMING_TIDLE_Pos)))
/* -------- CATB_THRESH : (CATB Offset: 0x18) Threshold Register -------- */
#define CATB_THRESH_FTHRESH_Pos     0
#define CATB_THRESH_FTHRESH_Msk     (0xFFFu << CATB_THRESH_FTHRESH_Pos) /**< \brief (CATB_THRESH) Fractional part of Threshold Value */
#define CATB_THRESH_FTHRESH(value)  ((CATB_THRESH_FTHRESH_Msk & ((value) << CATB_THRESH_FTHRESH_Pos)))
#define CATB_THRESH_RTHRESH_Pos     12
#define CATB_THRESH_RTHRESH_Msk     (0xFFu << CATB_THRESH_RTHRESH_Pos) /**< \brief (CATB_THRESH) Rational part of Threshold Value */
#define CATB_THRESH_RTHRESH(value)  ((CATB_THRESH_RTHRESH_Msk & ((value) << CATB_THRESH_RTHRESH_Pos)))
#define CATB_THRESH_DIR             (0x1u << 23) /**< \brief (CATB_THRESH) Threshold Direction */
#define CATB_THRESH_LENGTH_Pos      24
#define CATB_THRESH_LENGTH_Msk      (0x1Fu << CATB_THRESH_LENGTH_Pos) /**< \brief (CATB_THRESH) Threshold Length */
#define CATB_THRESH_LENGTH(value)   ((CATB_THRESH_LENGTH_Msk & ((value) << CATB_THRESH_LENGTH_Pos)))
/* -------- CATB_PINSEL : (CATB Offset: 0x1C) Pin Selection Register -------- */
#define CATB_PINSEL_PINSEL_Pos      0
#define CATB_PINSEL_PINSEL_Msk      (0xFFu << CATB_PINSEL_PINSEL_Pos) /**< \brief (CATB_PINSEL) Pin Select */
#define CATB_PINSEL_PINSEL(value)   ((CATB_PINSEL_PINSEL_Msk & ((value) << CATB_PINSEL_PINSEL_Pos)))
/* -------- CATB_DMA : (CATB Offset: 0x20) Direct Memory Access Register -------- */
#define CATB_DMA_DMA_Pos            0
#define CATB_DMA_DMA_Msk            (0xFFFFFFFFu << CATB_DMA_DMA_Pos) /**< \brief (CATB_DMA) Direct Memory Access */
#define CATB_DMA_DMA(value)         ((CATB_DMA_DMA_Msk & ((value) << CATB_DMA_DMA_Pos)))
/* -------- CATB_ISR : (CATB Offset: 0x24) Interrupt Status Register -------- */
#define CATB_ISR_SAMPLE             (0x1u <<  0) /**< \brief (CATB_ISR) Sample Ready Interrupt Status */
#define CATB_ISR_INTCH              (0x1u <<  1) /**< \brief (CATB_ISR) In-touch Interrupt Status */
#define CATB_ISR_OUTTCH             (0x1u <<  2) /**< \brief (CATB_ISR) Out-of-Touch Interrupt Status */
/* -------- CATB_IER : (CATB Offset: 0x28) Interrupt Enable Register -------- */
#define CATB_IER_SAMPLE             (0x1u <<  0) /**< \brief (CATB_IER) Sample Ready Interrupt Enable */
#define CATB_IER_INTCH              (0x1u <<  1) /**< \brief (CATB_IER) In-touch Interrupt Enable */
#define CATB_IER_OUTTCH             (0x1u <<  2) /**< \brief (CATB_IER) Out-of-Touch Interrupt Enable */
/* -------- CATB_IDR : (CATB Offset: 0x2C) Interrupt Disable Register -------- */
#define CATB_IDR_SAMPLE             (0x1u <<  0) /**< \brief (CATB_IDR) Sample Ready Interrupt Disable */
#define CATB_IDR_INTCH              (0x1u <<  1) /**< \brief (CATB_IDR) In-touch Interrupt Disable */
#define CATB_IDR_OUTTCH             (0x1u <<  2) /**< \brief (CATB_IDR) Out-of-Touch Interrupt Disable */
/* -------- CATB_IMR : (CATB Offset: 0x30) Interrupt Mask Register -------- */
#define CATB_IMR_SAMPLE             (0x1u <<  0) /**< \brief (CATB_IMR) Sample Ready Interrupt Mask */
#define CATB_IMR_INTCH              (0x1u <<  1) /**< \brief (CATB_IMR) In-touch Interrupt Mask */
#define CATB_IMR_OUTTCH             (0x1u <<  2) /**< \brief (CATB_IMR) Out-of-Touch Interrupt Mask */
/* -------- CATB_SCR : (CATB Offset: 0x34) Status Clear Register -------- */
#define CATB_SCR_SAMPLE             (0x1u <<  0) /**< \brief (CATB_SCR) Sample Ready */
#define CATB_SCR_INTCH              (0x1u <<  1) /**< \brief (CATB_SCR) In-touch */
#define CATB_SCR_OUTTCH             (0x1u <<  2) /**< \brief (CATB_SCR) Out-of-Touch */
/* -------- CATB_INTCH : (CATB Offset: 0x40) Intch In-Touch Status Register 0 -------- */
#define CATB_INTCH_INTCH_Pos        0
#define CATB_INTCH_INTCH_Msk        (0xFFFFFFFFu << CATB_INTCH_INTCH_Pos) /**< \brief (CATB_INTCH) In-Touch */
#define CATB_INTCH_INTCH(value)     ((CATB_INTCH_INTCH_Msk & ((value) << CATB_INTCH_INTCH_Pos)))
/* -------- CATB_INTCHCLR : (CATB Offset: 0x50) Intchclr In-Touch Status Clear Register 0 -------- */
#define CATB_INTCHCLR_INTCHCLR_Pos    0
#define CATB_INTCHCLR_INTCHCLR_Msk    (0xFFFFFFFFu << CATB_INTCHCLR_INTCHCLR_Pos) /**< \brief (CATB_INTCHCLR) In-Touch Clear */
#define CATB_INTCHCLR_INTCHCLR(value) ((CATB_INTCHCLR_INTCHCLR_Msk & ((value) << CATB_INTCHCLR_INTCHCLR_Pos)))
/* -------- CATB_OUTTCH : (CATB Offset: 0x60) Outtch Out-of-Touch Status Register 0 -------- */
#define CATB_OUTTCH_OUTTCH_Pos      0
#define CATB_OUTTCH_OUTTCH_Msk      (0xFFFFFFFFu << CATB_OUTTCH_OUTTCH_Pos) /**< \brief (CATB_OUTTCH) Out-of-Touch */
#define CATB_OUTTCH_OUTTCH(value)   ((CATB_OUTTCH_OUTTCH_Msk & ((value) << CATB_OUTTCH_OUTTCH_Pos)))
/* -------- CATB_OUTTCHCLR : (CATB Offset: 0x70) Outtchclr Out-of-Touch Status Clear Register 0 -------- */
#define CATB_OUTTCHCLR_OUTTCHCLR_Pos    0
#define CATB_OUTTCHCLR_OUTTCHCLR_Msk    (0xFFFFFFFFu << CATB_OUTTCHCLR_OUTTCHCLR_Pos) /**< \brief (CATB_OUTTCHCLR) Out of Touch */
#define CATB_OUTTCHCLR_OUTTCHCLR(value) ((CATB_OUTTCHCLR_OUTTCHCLR_Msk & ((value) << CATB_OUTTCHCLR_OUTTCHCLR_Pos)))
/* -------- CATB_PARAMETER : (CATB Offset: 0xF8) Parameter Register -------- */
#define CATB_PARAMETER_NPINS_Pos    0
#define CATB_PARAMETER_NPINS_Msk    (0xFFu << CATB_PARAMETER_NPINS_Pos) /**< \brief (CATB_PARAMETER) Number of Pins */
#define CATB_PARAMETER_NPINS(value) ((CATB_PARAMETER_NPINS_Msk & ((value) << CATB_PARAMETER_NPINS_Pos)))
#define CATB_PARAMETER_NSTATUS_Pos    8
#define CATB_PARAMETER_NSTATUS_Msk    (0xFFu << CATB_PARAMETER_NSTATUS_Pos) /**< \brief (CATB_PARAMETER) Number of Status bits */
#define CATB_PARAMETER_NSTATUS(value) ((CATB_PARAMETER_NSTATUS_Msk & ((value) << CATB_PARAMETER_NSTATUS_Pos)))
#define CATB_PARAMETER_FRACTIONAL_Pos    16
#define CATB_PARAMETER_FRACTIONAL_Msk    (0xFu << CATB_PARAMETER_FRACTIONAL_Pos) /**< \brief (CATB_PARAMETER) Number of Fractional bits */
#define CATB_PARAMETER_FRACTIONAL(value) ((CATB_PARAMETER_FRACTIONAL_Msk & ((value) << CATB_PARAMETER_FRACTIONAL_Pos)))
/* -------- CATB_VERSION : (CATB Offset: 0xFC) Version Register -------- */
#define CATB_VERSION_VERSION_Pos    0
#define CATB_VERSION_VERSION_Msk    (0xFFFu << CATB_VERSION_VERSION_Pos) /**< \brief (CATB_VERSION) Version number */
#define CATB_VERSION_VERSION(value) ((CATB_VERSION_VERSION_Msk & ((value) << CATB_VERSION_VERSION_Pos)))
#define CATB_VERSION_VARIANT_Pos    16
#define CATB_VERSION_VARIANT_Msk    (0xFu << CATB_VERSION_VARIANT_Pos) /**< \brief (CATB_VERSION) Variant number */
#define CATB_VERSION_VARIANT(value) ((CATB_VERSION_VARIANT_Msk & ((value) << CATB_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR CHIPID */
/* ============================================================================= */
/** \addtogroup SAM4L4_CHIPID Chip ID Registers */
/*@{*/

#define REV_CHIPID     0x100

