Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief CHIPID hardware registers */
typedef struct {
  RoReg   Reserved1[208];
  RoReg   CIDR;        /**< \brief (CHIPID Offset: 0x340) Chip ID Register */
  RoReg   EXID;        /**< \brief (CHIPID Offset: 0x344) Chip ID Extension Register */
} Chipid;
#endif /* __ASSEMBLY__ */

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR CRCCU */
/* ============================================================================= */
/** \addtogroup SAM4L4_CRCCU CRC Calculation Unit */
/*@{*/

#define REV_CRCCU      0x202

#ifndef __ASSEMBLY__
/** \brief CRCCU hardware registers */
typedef struct {
  RwReg   DSCR;        /**< \brief (CRCCU Offset: 0x00) Descriptor Base Register */
  RoReg   Reserved1[1];
  WoReg   DMAEN;       /**< \brief (CRCCU Offset: 0x08) DMA Enable Register */
  WoReg   DMADIS;      /**< \brief (CRCCU Offset: 0x0C) DMA Disable Register */
  RoReg   DMASR;       /**< \brief (CRCCU Offset: 0x10) DMA Status Register */
  WoReg   DMAIER;      /**< \brief (CRCCU Offset: 0x14) DMA Interrupt Enable Register */
  WoReg   DMAIDR;      /**< \brief (CRCCU Offset: 0x18) DMA Interrupt Disable Register */
  RoReg   DMAIMR;      /**< \brief (CRCCU Offset: 0x1C) DMA Interrupt Mask Register */
  RoReg   DMAISR;      /**< \brief (CRCCU Offset: 0x20) DMA Interrupt Status Register */
  RoReg   Reserved2[4];
  WoReg   CR;          /**< \brief (CRCCU Offset: 0x34) Control Register */
  RwReg   MR;          /**< \brief (CRCCU Offset: 0x38) Mode Register */
  RoReg   SR;          /**< \brief (CRCCU Offset: 0x3C) Status Register */
  WoReg   IER;         /**< \brief (CRCCU Offset: 0x40) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (CRCCU Offset: 0x44) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (CRCCU Offset: 0x48) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (CRCCU Offset: 0x4C) Interrupt Status Register */
  RoReg   Reserved3[43];
  RoReg   VERSION;     /**< \brief (CRCCU Offset: 0xFC) Version Register */
} Crccu;
#endif /* __ASSEMBLY__ */
/* -------- CRCCU_DSCR : (CRCCU Offset: 0x00) Descriptor Base Register -------- */
#define CRCCU_DSCR_DSCR_Pos         9
#define CRCCU_DSCR_DSCR_Msk         (0x7FFFFFu << CRCCU_DSCR_DSCR_Pos) /**< \brief (CRCCU_DSCR) Description Base Address */
#define CRCCU_DSCR_DSCR(value)      ((CRCCU_DSCR_DSCR_Msk & ((value) << CRCCU_DSCR_DSCR_Pos)))
/* -------- CRCCU_DMAEN : (CRCCU Offset: 0x08) DMA Enable Register -------- */
#define CRCCU_DMAEN_DMAEN           (0x1u <<  0) /**< \brief (CRCCU_DMAEN) DMA Enable */
/* -------- CRCCU_DMADIS : (CRCCU Offset: 0x0C) DMA Disable Register -------- */
#define CRCCU_DMADIS_DMADIS         (0x1u <<  0) /**< \brief (CRCCU_DMADIS) DMA Disable */
/* -------- CRCCU_DMASR : (CRCCU Offset: 0x10) DMA Status Register -------- */
#define CRCCU_DMASR_DMASR           (0x1u <<  0) /**< \brief (CRCCU_DMASR) DMA Channel Status */
/* -------- CRCCU_DMAIER : (CRCCU Offset: 0x14) DMA Interrupt Enable Register -------- */
#define CRCCU_DMAIER_DMAIER         (0x1u <<  0) /**< \brief (CRCCU_DMAIER) DMA Interrupt Enable */
/* -------- CRCCU_DMAIDR : (CRCCU Offset: 0x18) DMA Interrupt Disable Register -------- */
#define CRCCU_DMAIDR_DMAIDR         (0x1u <<  0) /**< \brief (CRCCU_DMAIDR) DMA Interrupt Disable */
/* -------- CRCCU_DMAIMR : (CRCCU Offset: 0x1C) DMA Interrupt Mask Register -------- */
#define CRCCU_DMAIMR_DMAIMR         (0x1u <<  0) /**< \brief (CRCCU_DMAIMR) DMA Interrupt Mask */
/* -------- CRCCU_DMAISR : (CRCCU Offset: 0x20) DMA Interrupt Status Register -------- */
#define CRCCU_DMAISR_DMAISR         (0x1u <<  0) /**< \brief (CRCCU_DMAISR) DMA Interrupt Status */
/* -------- CRCCU_CR : (CRCCU Offset: 0x34) Control Register -------- */
#define CRCCU_CR_RESET              (0x1u <<  0) /**< \brief (CRCCU_CR) Reset CRCComputation */
/* -------- CRCCU_MR : (CRCCU Offset: 0x38) Mode Register -------- */
#define CRCCU_MR_ENABLE             (0x1u <<  0) /**< \brief (CRCCU_MR) CRC Computation Enable */
#define CRCCU_MR_COMPARE            (0x1u <<  1) /**< \brief (CRCCU_MR) CRC Compare */
#define CRCCU_MR_PTYPE_Pos          2
#define CRCCU_MR_PTYPE_Msk          (0x3u << CRCCU_MR_PTYPE_Pos) /**< \brief (CRCCU_MR) Polynomial Type */
#define CRCCU_MR_PTYPE(value)       ((CRCCU_MR_PTYPE_Msk & ((value) << CRCCU_MR_PTYPE_Pos)))
#define CRCCU_MR_DIVIDER_Pos        4
#define CRCCU_MR_DIVIDER_Msk        (0xFu << CRCCU_MR_DIVIDER_Pos) /**< \brief (CRCCU_MR) Bandwidth Divider */
#define CRCCU_MR_DIVIDER(value)     ((CRCCU_MR_DIVIDER_Msk & ((value) << CRCCU_MR_DIVIDER_Pos)))
/* -------- CRCCU_SR : (CRCCU Offset: 0x3C) Status Register -------- */
#define CRCCU_SR_CRC_Pos            0
#define CRCCU_SR_CRC_Msk            (0xFFFFFFFFu << CRCCU_SR_CRC_Pos) /**< \brief (CRCCU_SR) Cyclic Redundancy Check Value */
#define CRCCU_SR_CRC(value)         ((CRCCU_SR_CRC_Msk & ((value) << CRCCU_SR_CRC_Pos)))
/* -------- CRCCU_IER : (CRCCU Offset: 0x40) Interrupt Enable Register -------- */
#define CRCCU_IER_ERRIER            (0x1u <<  0) /**< \brief (CRCCU_IER) CRC Error Interrupt Enable */
/* -------- CRCCU_IDR : (CRCCU Offset: 0x44) Interrupt Disable Register -------- */
#define CRCCU_IDR_ERRIDR            (0x1u <<  0) /**< \brief (CRCCU_IDR) CRC Error Interrupt Disable */
/* -------- CRCCU_IMR : (CRCCU Offset: 0x48) Interrupt Mask Register -------- */
#define CRCCU_IMR_ERRIMR            (0x1u <<  0) /**< \brief (CRCCU_IMR) CRC Error Interrupt Mask */
/* -------- CRCCU_ISR : (CRCCU Offset: 0x4C) Interrupt Status Register -------- */
#define CRCCU_ISR_ERRISR            (0x1u <<  0) /**< \brief (CRCCU_ISR) CRC Error Interrupt Status */
/* -------- CRCCU_VERSION : (CRCCU Offset: 0xFC) Version Register -------- */
#define CRCCU_VERSION_VERSION_Pos    0
#define CRCCU_VERSION_VERSION_Msk    (0xFFFu << CRCCU_VERSION_VERSION_Pos) /**< \brief (CRCCU_VERSION) Version Number */
#define CRCCU_VERSION_VERSION(value) ((CRCCU_VERSION_VERSION_Msk & ((value) << CRCCU_VERSION_VERSION_Pos)))
#define CRCCU_VERSION_VARIANT_Pos    16
#define CRCCU_VERSION_VARIANT_Msk    (0xFu << CRCCU_VERSION_VARIANT_Pos) /**< \brief (CRCCU_VERSION) Variant Number */
#define CRCCU_VERSION_VARIANT(value) ((CRCCU_VERSION_VARIANT_Msk & ((value) << CRCCU_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR DACC */
/* ============================================================================= */
/** \addtogroup SAM4L4_DACC DAC Controller */
/*@{*/

#define REV_DACC       0x111

