Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief DACC hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (DACC Offset: 0x00) Control Register */
  RwReg   MR;          /**< \brief (DACC Offset: 0x04) Mode Register */
  WoReg   CDR;         /**< \brief (DACC Offset: 0x08) Conversion Data Register */
  WoReg   IER;         /**< \brief (DACC Offset: 0x0C) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (DACC Offset: 0x10) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (DACC Offset: 0x14) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (DACC Offset: 0x18) Interrupt Status Register */
  RoReg   Reserved1[50];
  RwReg   WPMR;        /**< \brief (DACC Offset: 0xE4) Write Protect Mode Register */
  RoReg   WPSR;        /**< \brief (DACC Offset: 0xE8) Write Protect Status Register */
  RoReg   Reserved2[4];
  RoReg   VERSION;     /**< \brief (DACC Offset: 0xFC) Version Register */
} Dacc;
#endif /* __ASSEMBLY__ */
/* -------- DACC_CR : (DACC Offset: 0x00) Control Register -------- */
#define DACC_CR_SWRST               (0x1u <<  0) /**< \brief (DACC_CR) Software Reset */
/* -------- DACC_MR : (DACC Offset: 0x04) Mode Register -------- */
#define DACC_MR_TRGEN               (0x1u <<  0) /**< \brief (DACC_MR) Trigger Enable */
#define DACC_MR_TRGSEL_Pos          1
#define DACC_MR_TRGSEL_Msk          (0x7u << DACC_MR_TRGSEL_Pos) /**< \brief (DACC_MR) Trigger Selection */
#define DACC_MR_TRGSEL(value)       ((DACC_MR_TRGSEL_Msk & ((value) << DACC_MR_TRGSEL_Pos)))
#define DACC_MR_DACEN               (0x1u <<  4) /**< \brief (DACC_MR) DAC Enable */
#define DACC_MR_WORD                (0x1u <<  5) /**< \brief (DACC_MR) Word Transfer */
#define DACC_MR_STARTUP_Pos         8
#define DACC_MR_STARTUP_Msk         (0xFFu << DACC_MR_STARTUP_Pos) /**< \brief (DACC_MR) Startup Time Selection */
#define DACC_MR_STARTUP(value)      ((DACC_MR_STARTUP_Msk & ((value) << DACC_MR_STARTUP_Pos)))
#define DACC_MR_CLKDIV_Pos          16
#define DACC_MR_CLKDIV_Msk          (0xFFFFu << DACC_MR_CLKDIV_Pos) /**< \brief (DACC_MR) Clock Divider for Internal Trigger */
#define DACC_MR_CLKDIV(value)       ((DACC_MR_CLKDIV_Msk & ((value) << DACC_MR_CLKDIV_Pos)))
/* -------- DACC_CDR : (DACC Offset: 0x08) Conversion Data Register -------- */
#define DACC_CDR_DATA_Pos           0
#define DACC_CDR_DATA_Msk           (0xFFFFFFFFu << DACC_CDR_DATA_Pos) /**< \brief (DACC_CDR) Data to Convert */
#define DACC_CDR_DATA(value)        ((DACC_CDR_DATA_Msk & ((value) << DACC_CDR_DATA_Pos)))
/* -------- DACC_IER : (DACC Offset: 0x0C) Interrupt Enable Register -------- */
#define DACC_IER_TXRDY              (0x1u <<  0) /**< \brief (DACC_IER) Transmit Ready Interrupt Enable */
/* -------- DACC_IDR : (DACC Offset: 0x10) Interrupt Disable Register -------- */
#define DACC_IDR_TXRDY              (0x1u <<  0) /**< \brief (DACC_IDR) Transmit Ready Interrupt Disable */
/* -------- DACC_IMR : (DACC Offset: 0x14) Interrupt Mask Register -------- */
#define DACC_IMR_TXRDY              (0x1u <<  0) /**< \brief (DACC_IMR) Transmit Ready Interrupt Mask */
/* -------- DACC_ISR : (DACC Offset: 0x18) Interrupt Status Register -------- */
#define DACC_ISR_TXRDY              (0x1u <<  0) /**< \brief (DACC_ISR) Transmit Ready Interrupt Status */
/* -------- DACC_WPMR : (DACC Offset: 0xE4) Write Protect Mode Register -------- */
#define DACC_WPMR_WPEN              (0x1u <<  0) /**< \brief (DACC_WPMR) Write Protect Enable */
#define DACC_WPMR_WPKEY_Pos         8
#define DACC_WPMR_WPKEY_Msk         (0xFFFFFFu << DACC_WPMR_WPKEY_Pos) /**< \brief (DACC_WPMR) Write Protect Key */
#define DACC_WPMR_WPKEY(value)      ((DACC_WPMR_WPKEY_Msk & ((value) << DACC_WPMR_WPKEY_Pos)))
/* -------- DACC_WPSR : (DACC Offset: 0xE8) Write Protect Status Register -------- */
#define DACC_WPSR_WPROTERR          (0x1u <<  0) /**< \brief (DACC_WPSR) Write Protection Error */
#define DACC_WPSR_WPROTADDR_Pos     8
#define DACC_WPSR_WPROTADDR_Msk     (0xFFu << DACC_WPSR_WPROTADDR_Pos) /**< \brief (DACC_WPSR) Write Protection Error Address */
#define DACC_WPSR_WPROTADDR(value)  ((DACC_WPSR_WPROTADDR_Msk & ((value) << DACC_WPSR_WPROTADDR_Pos)))
/* -------- DACC_VERSION : (DACC Offset: 0xFC) Version Register -------- */
#define DACC_VERSION_VERSION_Pos    0
#define DACC_VERSION_VERSION_Msk    (0xFFFu << DACC_VERSION_VERSION_Pos) /**< \brief (DACC_VERSION) Version Number */
#define DACC_VERSION_VERSION(value) ((DACC_VERSION_VERSION_Msk & ((value) << DACC_VERSION_VERSION_Pos)))
#define DACC_VERSION_VARIANT_Pos    16
#define DACC_VERSION_VARIANT_Msk    (0x7u << DACC_VERSION_VARIANT_Pos) /**< \brief (DACC_VERSION) Variant Number */
#define DACC_VERSION_VARIANT(value) ((DACC_VERSION_VARIANT_Msk & ((value) << DACC_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR EIC */
/* ============================================================================= */
/** \addtogroup SAM4L4_EIC External Interrupt Controller */
/*@{*/

#define REV_EIC        0x302

#ifndef __ASSEMBLY__
/** \brief EIC hardware registers */
typedef struct {
  WoReg   IER;         /**< \brief (EIC Offset: 0x000) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (EIC Offset: 0x004) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (EIC Offset: 0x008) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (EIC Offset: 0x00C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (EIC Offset: 0x010) Interrupt Clear Register */
  RwReg   MODE;        /**< \brief (EIC Offset: 0x014) Mode Register */
  RwReg   EDGE;        /**< \brief (EIC Offset: 0x018) Edge Register */
  RwReg   LEVEL;       /**< \brief (EIC Offset: 0x01C) Level Register */
  RwReg   FILTER;      /**< \brief (EIC Offset: 0x020) Filter Register */
  RoReg   Reserved1[1];
  RwReg   ASYNC;       /**< \brief (EIC Offset: 0x028) Asynchronous Register */
  RoReg   Reserved2[1];
  WoReg   EN;          /**< \brief (EIC Offset: 0x030) Enable Register */
  WoReg   DIS;         /**< \brief (EIC Offset: 0x034) Disable Register */
  RoReg   CTRL;        /**< \brief (EIC Offset: 0x038) Control Register */
  RoReg   Reserved3[240];
  RoReg   VERSION;     /**< \brief (EIC Offset: 0x3FC) Version Register */
} Eic;
