Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#endif /* __ASSEMBLY__ */
/* -------- EIC_IER : (EIC Offset: 0x000) Interrupt Enable Register -------- */
#define EIC_IER_NMI                 (0x1u <<  0) /**< \brief (EIC_IER) External Non Maskable CPU interrupt */
#define EIC_IER_INT1                (0x1u <<  1) /**< \brief (EIC_IER) External Interrupt 1 */
#define   EIC_IER_INT1_0            (0x0u <<  1) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT1_1            (0x1u <<  1) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT2                (0x1u <<  2) /**< \brief (EIC_IER) External Interrupt 2 */
#define   EIC_IER_INT2_0            (0x0u <<  2) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT2_1            (0x1u <<  2) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT3                (0x1u <<  3) /**< \brief (EIC_IER) External Interrupt 3 */
#define   EIC_IER_INT3_0            (0x0u <<  3) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT3_1            (0x1u <<  3) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT4                (0x1u <<  4) /**< \brief (EIC_IER) External Interrupt 4 */
#define   EIC_IER_INT4_0            (0x0u <<  4) /**< \brief (EIC_IER) No effect */
#define   EIC_IER_INT4_1            (0x1u <<  4) /**< \brief (EIC_IER) Enable Interrupt. */
#define EIC_IER_INT5                (0x1u <<  5) /**< \brief (EIC_IER) External Interrupt 5 */
#define EIC_IER_INT6                (0x1u <<  6) /**< \brief (EIC_IER) External Interrupt 6 */
#define EIC_IER_INT7                (0x1u <<  7) /**< \brief (EIC_IER) External Interrupt 7 */
#define EIC_IER_INT8                (0x1u <<  8) /**< \brief (EIC_IER) External Interrupt 8 */
#define EIC_IER_INT9                (0x1u <<  9) /**< \brief (EIC_IER) External Interrupt 9 */
#define EIC_IER_INT10               (0x1u << 10) /**< \brief (EIC_IER) External Interrupt 10 */
#define EIC_IER_INT11               (0x1u << 11) /**< \brief (EIC_IER) External Interrupt 11 */
#define EIC_IER_INT12               (0x1u << 12) /**< \brief (EIC_IER) External Interrupt 12 */
#define EIC_IER_INT13               (0x1u << 13) /**< \brief (EIC_IER) External Interrupt 13 */
#define EIC_IER_INT14               (0x1u << 14) /**< \brief (EIC_IER) External Interrupt 14 */
#define EIC_IER_INT15               (0x1u << 15) /**< \brief (EIC_IER) External Interrupt 15 */
/* -------- EIC_IDR : (EIC Offset: 0x004) Interrupt Disable Register -------- */
#define EIC_IDR_NMI                 (0x1u <<  0) /**< \brief (EIC_IDR) External Non Maskable CPU interrupt */
#define EIC_IDR_INT1                (0x1u <<  1) /**< \brief (EIC_IDR) External Interrupt 1 */
#define   EIC_IDR_INT1_0            (0x0u <<  1) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT1_1            (0x1u <<  1) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT2                (0x1u <<  2) /**< \brief (EIC_IDR) External Interrupt 2 */
#define   EIC_IDR_INT2_0            (0x0u <<  2) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT2_1            (0x1u <<  2) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT3                (0x1u <<  3) /**< \brief (EIC_IDR) External Interrupt 3 */
#define   EIC_IDR_INT3_0            (0x0u <<  3) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT3_1            (0x1u <<  3) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT4                (0x1u <<  4) /**< \brief (EIC_IDR) External Interrupt 4 */
#define   EIC_IDR_INT4_0            (0x0u <<  4) /**< \brief (EIC_IDR) No effect */
#define   EIC_IDR_INT4_1            (0x1u <<  4) /**< \brief (EIC_IDR) Disable Interrupt. */
#define EIC_IDR_INT5                (0x1u <<  5) /**< \brief (EIC_IDR) External Interrupt 5 */
#define EIC_IDR_INT6                (0x1u <<  6) /**< \brief (EIC_IDR) External Interrupt 6 */
#define EIC_IDR_INT7                (0x1u <<  7) /**< \brief (EIC_IDR) External Interrupt 7 */
#define EIC_IDR_INT8                (0x1u <<  8) /**< \brief (EIC_IDR) External Interrupt 8 */
#define EIC_IDR_INT9                (0x1u <<  9) /**< \brief (EIC_IDR) External Interrupt 9 */
#define EIC_IDR_INT10               (0x1u << 10) /**< \brief (EIC_IDR) External Interrupt 10 */
#define EIC_IDR_INT11               (0x1u << 11) /**< \brief (EIC_IDR) External Interrupt 11 */
#define EIC_IDR_INT12               (0x1u << 12) /**< \brief (EIC_IDR) External Interrupt 12 */
#define EIC_IDR_INT13               (0x1u << 13) /**< \brief (EIC_IDR) External Interrupt 13 */
#define EIC_IDR_INT14               (0x1u << 14) /**< \brief (EIC_IDR) External Interrupt 14 */
#define EIC_IDR_INT15               (0x1u << 15) /**< \brief (EIC_IDR) External Interrupt 15 */
/* -------- EIC_IMR : (EIC Offset: 0x008) Interrupt Mask Register -------- */
#define EIC_IMR_NMI                 (0x1u <<  0) /**< \brief (EIC_IMR) External Non Maskable CPU interrupt */
#define EIC_IMR_INT1                (0x1u <<  1) /**< \brief (EIC_IMR) External Interrupt 1 */
#define   EIC_IMR_INT1_0            (0x0u <<  1) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT1_1            (0x1u <<  1) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT2                (0x1u <<  2) /**< \brief (EIC_IMR) External Interrupt 2 */
#define   EIC_IMR_INT2_0            (0x0u <<  2) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT2_1            (0x1u <<  2) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT3                (0x1u <<  3) /**< \brief (EIC_IMR) External Interrupt 3 */
#define   EIC_IMR_INT3_0            (0x0u <<  3) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT3_1            (0x1u <<  3) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT4                (0x1u <<  4) /**< \brief (EIC_IMR) External Interrupt 4 */
#define   EIC_IMR_INT4_0            (0x0u <<  4) /**< \brief (EIC_IMR) Interrupt is disabled */
#define   EIC_IMR_INT4_1            (0x1u <<  4) /**< \brief (EIC_IMR) Interrupt is enabled. */
#define EIC_IMR_INT5                (0x1u <<  5) /**< \brief (EIC_IMR) External Interrupt 5 */
#define EIC_IMR_INT6                (0x1u <<  6) /**< \brief (EIC_IMR) External Interrupt 6 */
#define EIC_IMR_INT7                (0x1u <<  7) /**< \brief (EIC_IMR) External Interrupt 7 */
#define EIC_IMR_INT8                (0x1u <<  8) /**< \brief (EIC_IMR) External Interrupt 8 */
#define EIC_IMR_INT9                (0x1u <<  9) /**< \brief (EIC_IMR) External Interrupt 9 */
#define EIC_IMR_INT10               (0x1u << 10) /**< \brief (EIC_IMR) External Interrupt 10 */
#define EIC_IMR_INT11               (0x1u << 11) /**< \brief (EIC_IMR) External Interrupt 11 */
#define EIC_IMR_INT12               (0x1u << 12) /**< \brief (EIC_IMR) External Interrupt 12 */
#define EIC_IMR_INT13               (0x1u << 13) /**< \brief (EIC_IMR) External Interrupt 13 */
#define EIC_IMR_INT14               (0x1u << 14) /**< \brief (EIC_IMR) External Interrupt 14 */
#define EIC_IMR_INT15               (0x1u << 15) /**< \brief (EIC_IMR) External Interrupt 15 */
/* -------- EIC_ISR : (EIC Offset: 0x00C) Interrupt Status Register -------- */
#define EIC_ISR_NMI                 (0x1u <<  0) /**< \brief (EIC_ISR) External Non Maskable CPU interrupt */
#define EIC_ISR_INT1                (0x1u <<  1) /**< \brief (EIC_ISR) External Interrupt 1 */
#define   EIC_ISR_INT1_0            (0x0u <<  1) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT1_1            (0x1u <<  1) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT2                (0x1u <<  2) /**< \brief (EIC_ISR) External Interrupt 2 */
#define   EIC_ISR_INT2_0            (0x0u <<  2) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT2_1            (0x1u <<  2) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT3                (0x1u <<  3) /**< \brief (EIC_ISR) External Interrupt 3 */
#define   EIC_ISR_INT3_0            (0x0u <<  3) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT3_1            (0x1u <<  3) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT4                (0x1u <<  4) /**< \brief (EIC_ISR) External Interrupt 4 */
#define   EIC_ISR_INT4_0            (0x0u <<  4) /**< \brief (EIC_ISR) An interrupt event has not occurred */
#define   EIC_ISR_INT4_1            (0x1u <<  4) /**< \brief (EIC_ISR) An interrupt event has occurred. */
#define EIC_ISR_INT5                (0x1u <<  5) /**< \brief (EIC_ISR) External Interrupt 5 */
#define EIC_ISR_INT6                (0x1u <<  6) /**< \brief (EIC_ISR) External Interrupt 6 */
#define EIC_ISR_INT7                (0x1u <<  7) /**< \brief (EIC_ISR) External Interrupt 7 */
#define EIC_ISR_INT8                (0x1u <<  8) /**< \brief (EIC_ISR) External Interrupt 8 */
#define EIC_ISR_INT9                (0x1u <<  9) /**< \brief (EIC_ISR) External Interrupt 9 */
#define EIC_ISR_INT10               (0x1u << 10) /**< \brief (EIC_ISR) External Interrupt 10 */
#define EIC_ISR_INT11               (0x1u << 11) /**< \brief (EIC_ISR) External Interrupt 11 */
#define EIC_ISR_INT12               (0x1u << 12) /**< \brief (EIC_ISR) External Interrupt 12 */
#define EIC_ISR_INT13               (0x1u << 13) /**< \brief (EIC_ISR) External Interrupt 13 */
#define EIC_ISR_INT14               (0x1u << 14) /**< \brief (EIC_ISR) External Interrupt 14 */
#define EIC_ISR_INT15               (0x1u << 15) /**< \brief (EIC_ISR) External Interrupt 15 */
/* -------- EIC_ICR : (EIC Offset: 0x010) Interrupt Clear Register -------- */
#define EIC_ICR_NMI                 (0x1u <<  0) /**< \brief (EIC_ICR) External Non Maskable CPU interrupt */
#define EIC_ICR_INT1                (0x1u <<  1) /**< \brief (EIC_ICR) External Interrupt 1 */
#define   EIC_ICR_INT1_0            (0x0u <<  1) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT1_1            (0x1u <<  1) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT2                (0x1u <<  2) /**< \brief (EIC_ICR) External Interrupt 2 */
#define   EIC_ICR_INT2_0            (0x0u <<  2) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT2_1            (0x1u <<  2) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT3                (0x1u <<  3) /**< \brief (EIC_ICR) External Interrupt 3 */
#define   EIC_ICR_INT3_0            (0x0u <<  3) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT3_1            (0x1u <<  3) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT4                (0x1u <<  4) /**< \brief (EIC_ICR) External Interrupt 4 */
#define   EIC_ICR_INT4_0            (0x0u <<  4) /**< \brief (EIC_ICR) No effect */
#define   EIC_ICR_INT4_1            (0x1u <<  4) /**< \brief (EIC_ICR) Clear Interrupt. */
#define EIC_ICR_INT5                (0x1u <<  5) /**< \brief (EIC_ICR) External Interrupt 5 */
#define EIC_ICR_INT6                (0x1u <<  6) /**< \brief (EIC_ICR) External Interrupt 6 */
#define EIC_ICR_INT7                (0x1u <<  7) /**< \brief (EIC_ICR) External Interrupt 7 */
#define EIC_ICR_INT8                (0x1u <<  8) /**< \brief (EIC_ICR) External Interrupt 8 */
#define EIC_ICR_INT9                (0x1u <<  9) /**< \brief (EIC_ICR) External Interrupt 9 */
#define EIC_ICR_INT10               (0x1u << 10) /**< \brief (EIC_ICR) External Interrupt 10 */
#define EIC_ICR_INT11               (0x1u << 11) /**< \brief (EIC_ICR) External Interrupt 11 */
#define EIC_ICR_INT12               (0x1u << 12) /**< \brief (EIC_ICR) External Interrupt 12 */
#define EIC_ICR_INT13               (0x1u << 13) /**< \brief (EIC_ICR) External Interrupt 13 */
#define EIC_ICR_INT14               (0x1u << 14) /**< \brief (EIC_ICR) External Interrupt 14 */
#define EIC_ICR_INT15               (0x1u << 15) /**< \brief (EIC_ICR) External Interrupt 15 */
/* -------- EIC_MODE : (EIC Offset: 0x014) Mode Register -------- */
#define EIC_MODE_NMI                (0x1u <<  0) /**< \brief (EIC_MODE) External Non Maskable CPU interrupt */
#define EIC_MODE_INT1               (0x1u <<  1) /**< \brief (EIC_MODE) External Interrupt 1 */
#define   EIC_MODE_INT1_0           (0x0u <<  1) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT1_1           (0x1u <<  1) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT2               (0x1u <<  2) /**< \brief (EIC_MODE) External Interrupt 2 */
#define   EIC_MODE_INT2_0           (0x0u <<  2) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT2_1           (0x1u <<  2) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT3               (0x1u <<  3) /**< \brief (EIC_MODE) External Interrupt 3 */
#define   EIC_MODE_INT3_0           (0x0u <<  3) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT3_1           (0x1u <<  3) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT4               (0x1u <<  4) /**< \brief (EIC_MODE) External Interrupt 4 */
#define   EIC_MODE_INT4_0           (0x0u <<  4) /**< \brief (EIC_MODE) Edge triggered interrupt */
#define   EIC_MODE_INT4_1           (0x1u <<  4) /**< \brief (EIC_MODE) Level triggered interrupt */
#define EIC_MODE_INT5               (0x1u <<  5) /**< \brief (EIC_MODE) External Interrupt 5 */
#define EIC_MODE_INT6               (0x1u <<  6) /**< \brief (EIC_MODE) External Interrupt 6 */
#define EIC_MODE_INT7               (0x1u <<  7) /**< \brief (EIC_MODE) External Interrupt 7 */
#define EIC_MODE_INT8               (0x1u <<  8) /**< \brief (EIC_MODE) External Interrupt 8 */
#define EIC_MODE_INT9               (0x1u <<  9) /**< \brief (EIC_MODE) External Interrupt 9 */
#define EIC_MODE_INT10              (0x1u << 10) /**< \brief (EIC_MODE) External Interrupt 10 */
#define EIC_MODE_INT11              (0x1u << 11) /**< \brief (EIC_MODE) External Interrupt 11 */
#define EIC_MODE_INT12              (0x1u << 12) /**< \brief (EIC_MODE) External Interrupt 12 */
#define EIC_MODE_INT13              (0x1u << 13) /**< \brief (EIC_MODE) External Interrupt 13 */
#define EIC_MODE_INT14              (0x1u << 14) /**< \brief (EIC_MODE) External Interrupt 14 */
#define EIC_MODE_INT15              (0x1u << 15) /**< \brief (EIC_MODE) External Interrupt 15 */
/* -------- EIC_EDGE : (EIC Offset: 0x018) Edge Register -------- */
#define EIC_EDGE_NMI                (0x1u <<  0) /**< \brief (EIC_EDGE) External Non Maskable CPU interrupt */
#define EIC_EDGE_INT1               (0x1u <<  1) /**< \brief (EIC_EDGE) External Interrupt 1 */
#define   EIC_EDGE_INT1_0           (0x0u <<  1) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT1_1           (0x1u <<  1) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT2               (0x1u <<  2) /**< \brief (EIC_EDGE) External Interrupt 2 */
#define   EIC_EDGE_INT2_0           (0x0u <<  2) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT2_1           (0x1u <<  2) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT3               (0x1u <<  3) /**< \brief (EIC_EDGE) External Interrupt 3 */
#define   EIC_EDGE_INT3_0           (0x0u <<  3) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT3_1           (0x1u <<  3) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT4               (0x1u <<  4) /**< \brief (EIC_EDGE) External Interrupt 4 */
#define   EIC_EDGE_INT4_0           (0x0u <<  4) /**< \brief (EIC_EDGE) Triggers on falling edge */
#define   EIC_EDGE_INT4_1           (0x1u <<  4) /**< \brief (EIC_EDGE) Triggers on rising edge. */
#define EIC_EDGE_INT5               (0x1u <<  5) /**< \brief (EIC_EDGE) External Interrupt 5 */
#define EIC_EDGE_INT6               (0x1u <<  6) /**< \brief (EIC_EDGE) External Interrupt 6 */
#define EIC_EDGE_INT7               (0x1u <<  7) /**< \brief (EIC_EDGE) External Interrupt 7 */
#define EIC_EDGE_INT8               (0x1u <<  8) /**< \brief (EIC_EDGE) External Interrupt 8 */
#define EIC_EDGE_INT9               (0x1u <<  9) /**< \brief (EIC_EDGE) External Interrupt 9 */
#define EIC_EDGE_INT10              (0x1u << 10) /**< \brief (EIC_EDGE) External Interrupt 10 */
#define EIC_EDGE_INT11              (0x1u << 11) /**< \brief (EIC_EDGE) External Interrupt 11 */
#define EIC_EDGE_INT12              (0x1u << 12) /**< \brief (EIC_EDGE) External Interrupt 12 */
#define EIC_EDGE_INT13              (0x1u << 13) /**< \brief (EIC_EDGE) External Interrupt 13 */
#define EIC_EDGE_INT14              (0x1u << 14) /**< \brief (EIC_EDGE) External Interrupt 14 */
#define EIC_EDGE_INT15              (0x1u << 15) /**< \brief (EIC_EDGE) External Interrupt 15 */
/* -------- EIC_LEVEL : (EIC Offset: 0x01C) Level Register -------- */
#define EIC_LEVEL_NMI               (0x1u <<  0) /**< \brief (EIC_LEVEL) External Non Maskable CPU interrupt */
#define EIC_LEVEL_INT1              (0x1u <<  1) /**< \brief (EIC_LEVEL) External Interrupt 1 */
#define EIC_LEVEL_INT2              (0x1u <<  2) /**< \brief (EIC_LEVEL) External Interrupt 2 */
#define EIC_LEVEL_INT3              (0x1u <<  3) /**< \brief (EIC_LEVEL) External Interrupt 3 */
#define EIC_LEVEL_INT4              (0x1u <<  4) /**< \brief (EIC_LEVEL) External Interrupt 4 */
#define EIC_LEVEL_INT5              (0x1u <<  5) /**< \brief (EIC_LEVEL) External Interrupt 5 */
#define EIC_LEVEL_INT6              (0x1u <<  6) /**< \brief (EIC_LEVEL) External Interrupt 6 */
#define EIC_LEVEL_INT7              (0x1u <<  7) /**< \brief (EIC_LEVEL) External Interrupt 7 */
#define EIC_LEVEL_INT8              (0x1u <<  8) /**< \brief (EIC_LEVEL) External Interrupt 8 */
#define EIC_LEVEL_INT9              (0x1u <<  9) /**< \brief (EIC_LEVEL) External Interrupt 9 */
#define EIC_LEVEL_INT10             (0x1u << 10) /**< \brief (EIC_LEVEL) External Interrupt 10 */
#define EIC_LEVEL_INT11             (0x1u << 11) /**< \brief (EIC_LEVEL) External Interrupt 11 */
#define EIC_LEVEL_INT12             (0x1u << 12) /**< \brief (EIC_LEVEL) External Interrupt 12 */
#define EIC_LEVEL_INT13             (0x1u << 13) /**< \brief (EIC_LEVEL) External Interrupt 13 */
#define EIC_LEVEL_INT14             (0x1u << 14) /**< \brief (EIC_LEVEL) External Interrupt 14 */
#define EIC_LEVEL_INT15             (0x1u << 15) /**< \brief (EIC_LEVEL) External Interrupt 15 */
/* -------- EIC_FILTER : (EIC Offset: 0x020) Filter Register -------- */
#define EIC_FILTER_NMI              (0x1u <<  0) /**< \brief (EIC_FILTER) External Non Maskable CPU interrupt */
#define EIC_FILTER_INT1             (0x1u <<  1) /**< \brief (EIC_FILTER) External Interrupt 1 */
#define EIC_FILTER_INT2             (0x1u <<  2) /**< \brief (EIC_FILTER) External Interrupt 2 */
#define EIC_FILTER_INT3             (0x1u <<  3) /**< \brief (EIC_FILTER) External Interrupt 3 */
#define EIC_FILTER_INT4             (0x1u <<  4) /**< \brief (EIC_FILTER) External Interrupt 4 */
#define EIC_FILTER_INT5             (0x1u <<  5) /**< \brief (EIC_FILTER) External Interrupt 5 */
#define EIC_FILTER_INT6             (0x1u <<  6) /**< \brief (EIC_FILTER) External Interrupt 6 */
#define EIC_FILTER_INT7             (0x1u <<  7) /**< \brief (EIC_FILTER) External Interrupt 7 */
#define EIC_FILTER_INT8             (0x1u <<  8) /**< \brief (EIC_FILTER) External Interrupt 8 */
#define EIC_FILTER_INT9             (0x1u <<  9) /**< \brief (EIC_FILTER) External Interrupt 9 */
#define EIC_FILTER_INT10            (0x1u << 10) /**< \brief (EIC_FILTER) External Interrupt 10 */
#define EIC_FILTER_INT11            (0x1u << 11) /**< \brief (EIC_FILTER) External Interrupt 11 */
#define EIC_FILTER_INT12            (0x1u << 12) /**< \brief (EIC_FILTER) External Interrupt 12 */
#define EIC_FILTER_INT13            (0x1u << 13) /**< \brief (EIC_FILTER) External Interrupt 13 */
#define EIC_FILTER_INT14            (0x1u << 14) /**< \brief (EIC_FILTER) External Interrupt 14 */
#define EIC_FILTER_INT15            (0x1u << 15) /**< \brief (EIC_FILTER) External Interrupt 15 */
/* -------- EIC_ASYNC : (EIC Offset: 0x028) Asynchronous Register -------- */
#define EIC_ASYNC_NMI               (0x1u <<  0) /**< \brief (EIC_ASYNC) External Non Maskable CPU interrupt */
#define EIC_ASYNC_INT1              (0x1u <<  1) /**< \brief (EIC_ASYNC) External Interrupt 1 */
#define EIC_ASYNC_INT2              (0x1u <<  2) /**< \brief (EIC_ASYNC) External Interrupt 2 */
#define EIC_ASYNC_INT3              (0x1u <<  3) /**< \brief (EIC_ASYNC) External Interrupt 3 */
#define EIC_ASYNC_INT4              (0x1u <<  4) /**< \brief (EIC_ASYNC) External Interrupt 4 */
#define EIC_ASYNC_INT5              (0x1u <<  5) /**< \brief (EIC_ASYNC) External Interrupt 5 */
#define EIC_ASYNC_INT6              (0x1u <<  6) /**< \brief (EIC_ASYNC) External Interrupt 6 */
#define EIC_ASYNC_INT7              (0x1u <<  7) /**< \brief (EIC_ASYNC) External Interrupt 7 */
#define EIC_ASYNC_INT8              (0x1u <<  8) /**< \brief (EIC_ASYNC) External Interrupt 8 */
#define EIC_ASYNC_INT9              (0x1u <<  9) /**< \brief (EIC_ASYNC) External Interrupt 9 */
#define EIC_ASYNC_INT10             (0x1u << 10) /**< \brief (EIC_ASYNC) External Interrupt 10 */
#define EIC_ASYNC_INT11             (0x1u << 11) /**< \brief (EIC_ASYNC) External Interrupt 11 */
#define EIC_ASYNC_INT12             (0x1u << 12) /**< \brief (EIC_ASYNC) External Interrupt 12 */
#define EIC_ASYNC_INT13             (0x1u << 13) /**< \brief (EIC_ASYNC) External Interrupt 13 */
#define EIC_ASYNC_INT14             (0x1u << 14) /**< \brief (EIC_ASYNC) External Interrupt 14 */
#define EIC_ASYNC_INT15             (0x1u << 15) /**< \brief (EIC_ASYNC) External Interrupt 15 */
/* -------- EIC_EN : (EIC Offset: 0x030) Enable Register -------- */
#define EIC_EN_NMI                  (0x1u <<  0) /**< \brief (EIC_EN) External Non Maskable CPU interrupt */
#define EIC_EN_INT1                 (0x1u <<  1) /**< \brief (EIC_EN) External Interrupt 1 */
#define EIC_EN_INT2                 (0x1u <<  2) /**< \brief (EIC_EN) External Interrupt 2 */
#define EIC_EN_INT3                 (0x1u <<  3) /**< \brief (EIC_EN) External Interrupt 3 */
#define EIC_EN_INT4                 (0x1u <<  4) /**< \brief (EIC_EN) External Interrupt 4 */
#define EIC_EN_INT5                 (0x1u <<  5) /**< \brief (EIC_EN) External Interrupt 5 */
#define EIC_EN_INT6                 (0x1u <<  6) /**< \brief (EIC_EN) External Interrupt 6 */
#define EIC_EN_INT7                 (0x1u <<  7) /**< \brief (EIC_EN) External Interrupt 7 */
#define EIC_EN_INT8                 (0x1u <<  8) /**< \brief (EIC_EN) External Interrupt 8 */
#define EIC_EN_INT9                 (0x1u <<  9) /**< \brief (EIC_EN) External Interrupt 9 */
#define EIC_EN_INT10                (0x1u << 10) /**< \brief (EIC_EN) External Interrupt 10 */
#define EIC_EN_INT11                (0x1u << 11) /**< \brief (EIC_EN) External Interrupt 11 */
#define EIC_EN_INT12                (0x1u << 12) /**< \brief (EIC_EN) External Interrupt 12 */
#define EIC_EN_INT13                (0x1u << 13) /**< \brief (EIC_EN) External Interrupt 13 */
#define EIC_EN_INT14                (0x1u << 14) /**< \brief (EIC_EN) External Interrupt 14 */
#define EIC_EN_INT15                (0x1u << 15) /**< \brief (EIC_EN) External Interrupt 15 */
/* -------- EIC_DIS : (EIC Offset: 0x034) Disable Register -------- */
#define EIC_DIS_NMI                 (0x1u <<  0) /**< \brief (EIC_DIS) External Non Maskable CPU interrupt */
#define EIC_DIS_INT1                (0x1u <<  1) /**< \brief (EIC_DIS) External Interrupt 1 */
#define EIC_DIS_INT2                (0x1u <<  2) /**< \brief (EIC_DIS) External Interrupt 2 */
#define EIC_DIS_INT3                (0x1u <<  3) /**< \brief (EIC_DIS) External Interrupt 3 */
