Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief FREQM hardware registers */
typedef struct {
  WoReg   CTRL;        /**< \brief (FREQM Offset: 0x000) Control register */
  RwReg   MODE;        /**< \brief (FREQM Offset: 0x004) Mode  register */
  RoReg   STATUS;      /**< \brief (FREQM Offset: 0x008) Status  register */
  RoReg   VALUE;       /**< \brief (FREQM Offset: 0x00C) Value register */
  WoReg   IER;         /**< \brief (FREQM Offset: 0x010) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (FREQM Offset: 0x014) Interrupt Diable Register */
  RoReg   IMR;         /**< \brief (FREQM Offset: 0x018) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (FREQM Offset: 0x01C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (FREQM Offset: 0x020) Interrupt Clear Register */
  RoReg   Reserved1[246];
  RoReg   VERSION;     /**< \brief (FREQM Offset: 0x3FC) Version Register */
} Freqm;
#endif /* __ASSEMBLY__ */
/* -------- FREQM_CTRL : (FREQM Offset: 0x000) Control register -------- */
#define FREQM_CTRL_START            (0x1u <<  0) /**< \brief (FREQM_CTRL) Start frequency measurement */
/* -------- FREQM_MODE : (FREQM Offset: 0x004) Mode  register -------- */
#define FREQM_MODE_REFSEL_Pos       0
#define FREQM_MODE_REFSEL_Msk       (0x3u << FREQM_MODE_REFSEL_Pos) /**< \brief (FREQM_MODE) Reference Clock Selection */
#define FREQM_MODE_REFSEL(value)    ((FREQM_MODE_REFSEL_Msk & ((value) << FREQM_MODE_REFSEL_Pos)))
#define FREQM_MODE_REFNUM_Pos       8
#define FREQM_MODE_REFNUM_Msk       (0xFFu << FREQM_MODE_REFNUM_Pos) /**< \brief (FREQM_MODE) Number of Reference CLock Cycles */
#define FREQM_MODE_REFNUM(value)    ((FREQM_MODE_REFNUM_Msk & ((value) << FREQM_MODE_REFNUM_Pos)))
#define FREQM_MODE_CLKSEL_Pos       16
#define FREQM_MODE_CLKSEL_Msk       (0x1Fu << FREQM_MODE_CLKSEL_Pos) /**< \brief (FREQM_MODE) Clock Source Selection */
#define FREQM_MODE_CLKSEL(value)    ((FREQM_MODE_CLKSEL_Msk & ((value) << FREQM_MODE_CLKSEL_Pos)))
#define FREQM_MODE_REFCEN           (0x1u << 31) /**< \brief (FREQM_MODE) Reference Clock Enable */
/* -------- FREQM_STATUS : (FREQM Offset: 0x008) Status  register -------- */
#define FREQM_STATUS_BUSY           (0x1u <<  0) /**< \brief (FREQM_STATUS) Frequency measurement on-going */
#define FREQM_STATUS_RCLKBUSY       (0x1u <<  1) /**< \brief (FREQM_STATUS) Reference Clock busy */
/* -------- FREQM_VALUE : (FREQM Offset: 0x00C) Value register -------- */
#define FREQM_VALUE_VALUE_Pos       0
#define FREQM_VALUE_VALUE_Msk       (0xFFFFFFu << FREQM_VALUE_VALUE_Pos) /**< \brief (FREQM_VALUE) Measured frequency */
#define FREQM_VALUE_VALUE(value)    ((FREQM_VALUE_VALUE_Msk & ((value) << FREQM_VALUE_VALUE_Pos)))
/* -------- FREQM_IER : (FREQM Offset: 0x010) Interrupt Enable Register -------- */
#define FREQM_IER_DONE              (0x1u <<  0) /**< \brief (FREQM_IER) Frequency measurment done */
#define FREQM_IER_RCLKRDY           (0x1u <<  1) /**< \brief (FREQM_IER) Reference Clock ready */
/* -------- FREQM_IDR : (FREQM Offset: 0x014) Interrupt Diable Register -------- */
#define FREQM_IDR_DONE              (0x1u <<  0) /**< \brief (FREQM_IDR) Frequency measurment done */
#define FREQM_IDR_RCLKRDY           (0x1u <<  1) /**< \brief (FREQM_IDR) Reference Clock ready */
/* -------- FREQM_IMR : (FREQM Offset: 0x018) Interrupt Mask Register -------- */
#define FREQM_IMR_DONE              (0x1u <<  0) /**< \brief (FREQM_IMR) Frequency measurment done */
#define FREQM_IMR_RCLKRDY           (0x1u <<  1) /**< \brief (FREQM_IMR) Reference Clock ready */
/* -------- FREQM_ISR : (FREQM Offset: 0x01C) Interrupt Status Register -------- */
#define FREQM_ISR_DONE              (0x1u <<  0) /**< \brief (FREQM_ISR) Frequency measurment done */
#define FREQM_ISR_RCLKRDY           (0x1u <<  1) /**< \brief (FREQM_ISR) Reference Clock ready */
/* -------- FREQM_ICR : (FREQM Offset: 0x020) Interrupt Clear Register -------- */
#define FREQM_ICR_DONE              (0x1u <<  0) /**< \brief (FREQM_ICR) Frequency measurment done */
#define FREQM_ICR_RCLKRDY           (0x1u <<  1) /**< \brief (FREQM_ICR) Reference Clock ready */
/* -------- FREQM_VERSION : (FREQM Offset: 0x3FC) Version Register -------- */
#define FREQM_VERSION_VERSION_Pos    0
#define FREQM_VERSION_VERSION_Msk    (0xFFFu << FREQM_VERSION_VERSION_Pos) /**< \brief (FREQM_VERSION) Version number */
#define FREQM_VERSION_VERSION(value) ((FREQM_VERSION_VERSION_Msk & ((value) << FREQM_VERSION_VERSION_Pos)))
#define FREQM_VERSION_VARIANT_Pos    16
#define FREQM_VERSION_VARIANT_Msk    (0xFu << FREQM_VERSION_VARIANT_Pos) /**< \brief (FREQM_VERSION) Variant number */
#define FREQM_VERSION_VARIANT(value) ((FREQM_VERSION_VARIANT_Msk & ((value) << FREQM_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR GLOC */
/* ============================================================================= */
/** \addtogroup SAM4L4_GLOC Glue Logic Controller */
/*@{*/

#define REV_GLOC       0x102

#ifndef __ASSEMBLY__
/** \brief GlocLut hardware registers */
typedef struct {
  RwReg   CR;          /**< \brief (GlocLut Offset: 0x00) Control Register */
  RwReg   TRUTH;       /**< \brief (GlocLut Offset: 0x04) Truth Register */
} GlocLut;
/** \brief GLOC hardware registers */
#define GLOC_LUTS 2
typedef struct {
  GlocLut Lut[GLOC_LUTS]; /**< \brief (GLOC Offset: 0x00) GlocLut groups */
  GlocLut Reserved1[7 - GLOC_LUTS];
  RoReg   PARAMETER;   /**< \brief (GLOC Offset: 0x38) Parameter Register */
  RoReg   VERSION;     /**< \brief (GLOC Offset: 0x3C) Version Register */
} Gloc;
#endif /* __ASSEMBLY__ */
/* -------- GLOC_CR : (GLOC Offset: 0x00) Lut Control Register -------- */
#define GLOC_CR_AEN_Pos             0
#define GLOC_CR_AEN_Msk             (0xFu << GLOC_CR_AEN_Pos) /**< \brief (GLOC_CR) Input mask */
#define GLOC_CR_AEN(value)          ((GLOC_CR_AEN_Msk & ((value) << GLOC_CR_AEN_Pos)))
#define GLOC_CR_FILTEN              (0x1u << 31) /**< \brief (GLOC_CR) Filter enable */
/* -------- GLOC_TRUTH : (GLOC Offset: 0x04) Lut Truth Register -------- */
#define GLOC_TRUTH_TRUTH_Pos        0
#define GLOC_TRUTH_TRUTH_Msk        (0xFFFFu << GLOC_TRUTH_TRUTH_Pos) /**< \brief (GLOC_TRUTH) Truth */
#define GLOC_TRUTH_TRUTH(value)     ((GLOC_TRUTH_TRUTH_Msk & ((value) << GLOC_TRUTH_TRUTH_Pos)))
/* -------- GLOC_PARAMETER : (GLOC Offset: 0x38) Parameter Register -------- */
#define GLOC_PARAMETER_LUTS_Pos     0
#define GLOC_PARAMETER_LUTS_Msk     (0xFFu << GLOC_PARAMETER_LUTS_Pos) /**< \brief (GLOC_PARAMETER) LUTs */
#define GLOC_PARAMETER_LUTS(value)  ((GLOC_PARAMETER_LUTS_Msk & ((value) << GLOC_PARAMETER_LUTS_Pos)))
/* -------- GLOC_VERSION : (GLOC Offset: 0x3C) Version Register -------- */
#define GLOC_VERSION_VERSION_Pos    0
#define GLOC_VERSION_VERSION_Msk    (0xFFFu << GLOC_VERSION_VERSION_Pos) /**< \brief (GLOC_VERSION) Version */
#define GLOC_VERSION_VERSION(value) ((GLOC_VERSION_VERSION_Msk & ((value) << GLOC_VERSION_VERSION_Pos)))
#define GLOC_VERSION_VARIANT_Pos    16
#define GLOC_VERSION_VARIANT_Msk    (0xFu << GLOC_VERSION_VARIANT_Pos) /**< \brief (GLOC_VERSION) Variant */
#define GLOC_VERSION_VARIANT(value) ((GLOC_VERSION_VARIANT_Msk & ((value) << GLOC_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR GPIO */
/* ============================================================================= */
/** \addtogroup SAM4L4_GPIO General-Purpose Input/Output Controller */
/*@{*/

#define REV_GPIO       0x215

