Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief GpioPort hardware registers */
typedef struct {
  RwReg   GPER;        /**< \brief (GpioPort Offset: 0x000) GPIO Enable Register */
  WoReg   GPERS;       /**< \brief (GpioPort Offset: 0x004) GPIO Enable Register - Set */
  WoReg   GPERC;       /**< \brief (GpioPort Offset: 0x008) GPIO Enable Register - Clear */
  WoReg   GPERT;       /**< \brief (GpioPort Offset: 0x00C) GPIO Enable Register - Toggle */
  RwReg   PMR0;        /**< \brief (GpioPort Offset: 0x010) Peripheral Mux Register 0 */
  WoReg   PMR0S;       /**< \brief (GpioPort Offset: 0x014) Peripheral Mux Register 0 - Set */
  WoReg   PMR0C;       /**< \brief (GpioPort Offset: 0x018) Peripheral Mux Register 0 - Clear */
  WoReg   PMR0T;       /**< \brief (GpioPort Offset: 0x01C) Peripheral Mux Register 0 - Toggle */
  RwReg   PMR1;        /**< \brief (GpioPort Offset: 0x020) Peripheral Mux Register 1 */
  WoReg   PMR1S;       /**< \brief (GpioPort Offset: 0x024) Peripheral Mux Register 1 - Set */
  WoReg   PMR1C;       /**< \brief (GpioPort Offset: 0x028) Peripheral Mux Register 1 - Clear */
  WoReg   PMR1T;       /**< \brief (GpioPort Offset: 0x02C) Peripheral Mux Register 1 - Toggle */
  RwReg   PMR2;        /**< \brief (GpioPort Offset: 0x030) Peripheral Mux Register 2 */
  WoReg   PMR2S;       /**< \brief (GpioPort Offset: 0x034) Peripheral Mux Register 2 - Set */
  WoReg   PMR2C;       /**< \brief (GpioPort Offset: 0x038) Peripheral Mux Register 2 - Clear */
  WoReg   PMR2T;       /**< \brief (GpioPort Offset: 0x03C) Peripheral Mux Register 2 - Toggle */
  RwReg   ODER;        /**< \brief (GpioPort Offset: 0x040) Output Driver Enable Register */
  WoReg   ODERS;       /**< \brief (GpioPort Offset: 0x044) Output Driver Enable Register - Set */
  WoReg   ODERC;       /**< \brief (GpioPort Offset: 0x048) Output Driver Enable Register - Clear */
  WoReg   ODERT;       /**< \brief (GpioPort Offset: 0x04C) Output Driver Enable Register - Toggle */
  RwReg   OVR;         /**< \brief (GpioPort Offset: 0x050) Output Value Register */
  WoReg   OVRS;        /**< \brief (GpioPort Offset: 0x054) Output Value Register - Set */
  WoReg   OVRC;        /**< \brief (GpioPort Offset: 0x058) Output Value Register - Clear */
  WoReg   OVRT;        /**< \brief (GpioPort Offset: 0x05C) Output Value Register - Toggle */
  RoReg   PVR;         /**< \brief (GpioPort Offset: 0x060) Pin Value Register */
  RoReg   Reserved1[3];
  RwReg   PUER;        /**< \brief (GpioPort Offset: 0x070) Pull-up Enable Register */
  WoReg   PUERS;       /**< \brief (GpioPort Offset: 0x074) Pull-up Enable Register - Set */
  WoReg   PUERC;       /**< \brief (GpioPort Offset: 0x078) Pull-up Enable Register - Clear */
  WoReg   PUERT;       /**< \brief (GpioPort Offset: 0x07C) Pull-up Enable Register - Toggle */
  RwReg   PDER;        /**< \brief (GpioPort Offset: 0x080) Pull-down Enable Register */
  WoReg   PDERS;       /**< \brief (GpioPort Offset: 0x084) Pull-down Enable Register - Set */
  WoReg   PDERC;       /**< \brief (GpioPort Offset: 0x088) Pull-down Enable Register - Clear */
  WoReg   PDERT;       /**< \brief (GpioPort Offset: 0x08C) Pull-down Enable Register - Toggle */
  RwReg   IER;         /**< \brief (GpioPort Offset: 0x090) Interrupt Enable Register */
  WoReg   IERS;        /**< \brief (GpioPort Offset: 0x094) Interrupt Enable Register - Set */
  WoReg   IERC;        /**< \brief (GpioPort Offset: 0x098) Interrupt Enable Register - Clear */
  WoReg   IERT;        /**< \brief (GpioPort Offset: 0x09C) Interrupt Enable Register - Toggle */
  RwReg   IMR0;        /**< \brief (GpioPort Offset: 0x0A0) Interrupt Mode Register 0 */
  WoReg   IMR0S;       /**< \brief (GpioPort Offset: 0x0A4) Interrupt Mode Register 0 - Set */
  WoReg   IMR0C;       /**< \brief (GpioPort Offset: 0x0A8) Interrupt Mode Register 0 - Clear */
  WoReg   IMR0T;       /**< \brief (GpioPort Offset: 0x0AC) Interrupt Mode Register 0 - Toggle */
  RwReg   IMR1;        /**< \brief (GpioPort Offset: 0x0B0) Interrupt Mode Register 1 */
  WoReg   IMR1S;       /**< \brief (GpioPort Offset: 0x0B4) Interrupt Mode Register 1 - Set */
  WoReg   IMR1C;       /**< \brief (GpioPort Offset: 0x0B8) Interrupt Mode Register 1 - Clear */
  WoReg   IMR1T;       /**< \brief (GpioPort Offset: 0x0BC) Interrupt Mode Register 1 - Toggle */
  RwReg   GFER;        /**< \brief (GpioPort Offset: 0x0C0) Glitch Filter Enable Register */
  WoReg   GFERS;       /**< \brief (GpioPort Offset: 0x0C4) Glitch Filter Enable Register - Set */
  WoReg   GFERC;       /**< \brief (GpioPort Offset: 0x0C8) Glitch Filter Enable Register - Clear */
  WoReg   GFERT;       /**< \brief (GpioPort Offset: 0x0CC) Glitch Filter Enable Register - Toggle */
  RoReg   IFR;         /**< \brief (GpioPort Offset: 0x0D0) Interrupt Flag Register */
  RoReg   Reserved2[1];
  WoReg   IFRC;        /**< \brief (GpioPort Offset: 0x0D8) Interrupt Flag Register - Clear */
  RoReg   Reserved3[1];
  RwReg   ODMER;       /**< \brief (GpioPort Offset: 0x0E0) Open Drain Mode Register */
  WoReg   ODMERS;      /**< \brief (GpioPort Offset: 0x0E4) Open Drain Mode Register - Set */
  WoReg   ODMERC;      /**< \brief (GpioPort Offset: 0x0E8) Open Drain Mode Register - Clear */
  WoReg   ODMERT;      /**< \brief (GpioPort Offset: 0x0EC) Open Drain Mode Register - Toggle */
  RoReg   Reserved4[4];
  RwReg   ODCR0;       /**< \brief (GpioPort Offset: 0x100) Output Driving Capability Register 0 */
  RwReg   ODCR0S;      /**< \brief (GpioPort Offset: 0x104) Output Driving Capability Register 0 - Set */
  RwReg   ODCR0C;      /**< \brief (GpioPort Offset: 0x108) Output Driving Capability Register 0 - Clear */
  RwReg   ODCR0T;      /**< \brief (GpioPort Offset: 0x10C) Output Driving Capability Register 0 - Toggle */
  RwReg   ODCR1;       /**< \brief (GpioPort Offset: 0x110) Output Driving Capability Register 1 */
  RwReg   ODCR1S;      /**< \brief (GpioPort Offset: 0x114) Output Driving Capability Register 1 - Set */
  RwReg   ODCR1C;      /**< \brief (GpioPort Offset: 0x118) Output Driving Capability Register 1 - Clear */
  RwReg   ODCR1T;      /**< \brief (GpioPort Offset: 0x11C) Output Driving Capability Register 1 - Toggle */
  RoReg   Reserved5[4];
  RwReg   OSRR0;       /**< \brief (GpioPort Offset: 0x130) Output Slew Rate Register 0 */
  RwReg   OSRR0S;      /**< \brief (GpioPort Offset: 0x134) Output Slew Rate Register 0 - Set */
  RwReg   OSRR0C;      /**< \brief (GpioPort Offset: 0x138) Output Slew Rate Register 0 - Clear */
  RwReg   OSRR0T;      /**< \brief (GpioPort Offset: 0x13C) Output Slew Rate Register 0 - Toggle */
  RoReg   Reserved6[8];
  RwReg   STER;        /**< \brief (GpioPort Offset: 0x160) Schmitt Trigger Enable Register */
  RwReg   STERS;       /**< \brief (GpioPort Offset: 0x164) Schmitt Trigger Enable Register - Set */
  RwReg   STERC;       /**< \brief (GpioPort Offset: 0x168) Schmitt Trigger Enable Register - Clear */
  RwReg   STERT;       /**< \brief (GpioPort Offset: 0x16C) Schmitt Trigger Enable Register - Toggle */
  RoReg   Reserved7[4];
  RwReg   EVER;        /**< \brief (GpioPort Offset: 0x180) Event Enable Register */
  WoReg   EVERS;       /**< \brief (GpioPort Offset: 0x184) Event Enable Register - Set */
  WoReg   EVERC;       /**< \brief (GpioPort Offset: 0x188) Event Enable Register - Clear */
  WoReg   EVERT;       /**< \brief (GpioPort Offset: 0x18C) Event Enable Register - Toggle */
  RoReg   Reserved8[4];
  RwReg   LOCK;        /**< \brief (GpioPort Offset: 0x1A0) Lock Register */
  WoReg   LOCKS;       /**< \brief (GpioPort Offset: 0x1A4) Lock Register - Set */
  WoReg   LOCKC;       /**< \brief (GpioPort Offset: 0x1A8) Lock Register - Clear */
  WoReg   LOCKT;       /**< \brief (GpioPort Offset: 0x1AC) Lock Register - Toggle */
  RoReg   Reserved9[12];
  WoReg   UNLOCK;      /**< \brief (GpioPort Offset: 0x1E0) Unlock Register */
  RwReg   ASR;         /**< \brief (GpioPort Offset: 0x1E4) Access Status Register */
  RoReg   Reserved10[4];
  RoReg   PARAMETER;   /**< \brief (GpioPort Offset: 0x1F8) Parameter Register */
  RoReg   VERSION;     /**< \brief (GpioPort Offset: 0x1FC) Version Register */
} GpioPort;
/** \brief GPIO hardware registers */
#define GPIO_PORT_LENGTH 3
typedef struct {
  GpioPort Port[GPIO_PORT_LENGTH]; /**< \brief (GPIO Offset: 0x000) GpioPort groups */
  GpioPort Reserved1[64 - GPIO_PORT_LENGTH];
} Gpio;
