Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#endif /* __ASSEMBLY__ */
/* -------- GPIO_GPER : (GPIO Offset: 0x000) Port GPIO Enable Register -------- */
#define GPIO_GPER_P0                (0x1u <<  0) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P1                (0x1u <<  1) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P2                (0x1u <<  2) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P3                (0x1u <<  3) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P4                (0x1u <<  4) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P5                (0x1u <<  5) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P6                (0x1u <<  6) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P7                (0x1u <<  7) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P8                (0x1u <<  8) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P9                (0x1u <<  9) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P10               (0x1u << 10) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P11               (0x1u << 11) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P12               (0x1u << 12) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P13               (0x1u << 13) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P14               (0x1u << 14) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P15               (0x1u << 15) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P16               (0x1u << 16) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P17               (0x1u << 17) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P18               (0x1u << 18) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P19               (0x1u << 19) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P20               (0x1u << 20) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P21               (0x1u << 21) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P22               (0x1u << 22) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P23               (0x1u << 23) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P24               (0x1u << 24) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P25               (0x1u << 25) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P26               (0x1u << 26) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P27               (0x1u << 27) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P28               (0x1u << 28) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P29               (0x1u << 29) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P30               (0x1u << 30) /**< \brief (GPIO_GPER) GPIO Enable */
#define GPIO_GPER_P31               (0x1u << 31) /**< \brief (GPIO_GPER) GPIO Enable */
/* -------- GPIO_GPERS : (GPIO Offset: 0x004) Port GPIO Enable Register - Set -------- */
#define GPIO_GPERS_P0               (0x1u <<  0) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P1               (0x1u <<  1) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P2               (0x1u <<  2) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P3               (0x1u <<  3) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P4               (0x1u <<  4) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P5               (0x1u <<  5) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P6               (0x1u <<  6) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P7               (0x1u <<  7) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P8               (0x1u <<  8) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P9               (0x1u <<  9) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P10              (0x1u << 10) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P11              (0x1u << 11) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P12              (0x1u << 12) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P13              (0x1u << 13) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P14              (0x1u << 14) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P15              (0x1u << 15) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P16              (0x1u << 16) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P17              (0x1u << 17) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P18              (0x1u << 18) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P19              (0x1u << 19) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P20              (0x1u << 20) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P21              (0x1u << 21) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P22              (0x1u << 22) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P23              (0x1u << 23) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P24              (0x1u << 24) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P25              (0x1u << 25) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P26              (0x1u << 26) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P27              (0x1u << 27) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P28              (0x1u << 28) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P29              (0x1u << 29) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P30              (0x1u << 30) /**< \brief (GPIO_GPERS) GPIO Enable */
#define GPIO_GPERS_P31              (0x1u << 31) /**< \brief (GPIO_GPERS) GPIO Enable */
/* -------- GPIO_GPERC : (GPIO Offset: 0x008) Port GPIO Enable Register - Clear -------- */
#define GPIO_GPERC_P0               (0x1u <<  0) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P1               (0x1u <<  1) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P2               (0x1u <<  2) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P3               (0x1u <<  3) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P4               (0x1u <<  4) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P5               (0x1u <<  5) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P6               (0x1u <<  6) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P7               (0x1u <<  7) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P8               (0x1u <<  8) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P9               (0x1u <<  9) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P10              (0x1u << 10) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P11              (0x1u << 11) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P12              (0x1u << 12) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P13              (0x1u << 13) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P14              (0x1u << 14) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P15              (0x1u << 15) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P16              (0x1u << 16) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P17              (0x1u << 17) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P18              (0x1u << 18) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P19              (0x1u << 19) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P20              (0x1u << 20) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P21              (0x1u << 21) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P22              (0x1u << 22) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P23              (0x1u << 23) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P24              (0x1u << 24) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P25              (0x1u << 25) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P26              (0x1u << 26) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P27              (0x1u << 27) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P28              (0x1u << 28) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P29              (0x1u << 29) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P30              (0x1u << 30) /**< \brief (GPIO_GPERC) GPIO Enable */
#define GPIO_GPERC_P31              (0x1u << 31) /**< \brief (GPIO_GPERC) GPIO Enable */
/* -------- GPIO_GPERT : (GPIO Offset: 0x00C) Port GPIO Enable Register - Toggle -------- */
#define GPIO_GPERT_P0               (0x1u <<  0) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P1               (0x1u <<  1) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P2               (0x1u <<  2) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P3               (0x1u <<  3) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P4               (0x1u <<  4) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P5               (0x1u <<  5) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P6               (0x1u <<  6) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P7               (0x1u <<  7) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P8               (0x1u <<  8) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P9               (0x1u <<  9) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P10              (0x1u << 10) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P11              (0x1u << 11) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P12              (0x1u << 12) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P13              (0x1u << 13) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P14              (0x1u << 14) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P15              (0x1u << 15) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P16              (0x1u << 16) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P17              (0x1u << 17) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P18              (0x1u << 18) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P19              (0x1u << 19) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P20              (0x1u << 20) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P21              (0x1u << 21) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P22              (0x1u << 22) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P23              (0x1u << 23) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P24              (0x1u << 24) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P25              (0x1u << 25) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P26              (0x1u << 26) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P27              (0x1u << 27) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P28              (0x1u << 28) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P29              (0x1u << 29) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P30              (0x1u << 30) /**< \brief (GPIO_GPERT) GPIO Enable */
#define GPIO_GPERT_P31              (0x1u << 31) /**< \brief (GPIO_GPERT) GPIO Enable */
/* -------- GPIO_PMR0 : (GPIO Offset: 0x010) Port Peripheral Mux Register 0 -------- */
#define GPIO_PMR0_P0                (0x1u <<  0) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P1                (0x1u <<  1) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P2                (0x1u <<  2) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P3                (0x1u <<  3) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P4                (0x1u <<  4) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P5                (0x1u <<  5) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P6                (0x1u <<  6) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P7                (0x1u <<  7) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P8                (0x1u <<  8) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P9                (0x1u <<  9) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P10               (0x1u << 10) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P11               (0x1u << 11) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P12               (0x1u << 12) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P13               (0x1u << 13) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P14               (0x1u << 14) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P15               (0x1u << 15) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P16               (0x1u << 16) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P17               (0x1u << 17) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P18               (0x1u << 18) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P19               (0x1u << 19) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P20               (0x1u << 20) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P21               (0x1u << 21) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P22               (0x1u << 22) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P23               (0x1u << 23) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P24               (0x1u << 24) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P25               (0x1u << 25) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P26               (0x1u << 26) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P27               (0x1u << 27) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P28               (0x1u << 28) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P29               (0x1u << 29) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P30               (0x1u << 30) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0_P31               (0x1u << 31) /**< \brief (GPIO_PMR0) Peripheral Multiplexer Select bit 0 */
/* -------- GPIO_PMR0S : (GPIO Offset: 0x014) Port Peripheral Mux Register 0 - Set -------- */
#define GPIO_PMR0S_P0               (0x1u <<  0) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P1               (0x1u <<  1) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P2               (0x1u <<  2) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P3               (0x1u <<  3) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P4               (0x1u <<  4) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P5               (0x1u <<  5) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P6               (0x1u <<  6) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P7               (0x1u <<  7) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P8               (0x1u <<  8) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P9               (0x1u <<  9) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P10              (0x1u << 10) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P11              (0x1u << 11) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P12              (0x1u << 12) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P13              (0x1u << 13) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P14              (0x1u << 14) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P15              (0x1u << 15) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P16              (0x1u << 16) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P17              (0x1u << 17) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P18              (0x1u << 18) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P19              (0x1u << 19) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P20              (0x1u << 20) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P21              (0x1u << 21) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P22              (0x1u << 22) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P23              (0x1u << 23) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P24              (0x1u << 24) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P25              (0x1u << 25) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P26              (0x1u << 26) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P27              (0x1u << 27) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P28              (0x1u << 28) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P29              (0x1u << 29) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P30              (0x1u << 30) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0S_P31              (0x1u << 31) /**< \brief (GPIO_PMR0S) Peripheral Multiplexer Select bit 0 */
/* -------- GPIO_PMR0C : (GPIO Offset: 0x018) Port Peripheral Mux Register 0 - Clear -------- */
#define GPIO_PMR0C_P0               (0x1u <<  0) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P1               (0x1u <<  1) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P2               (0x1u <<  2) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P3               (0x1u <<  3) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P4               (0x1u <<  4) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P5               (0x1u <<  5) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P6               (0x1u <<  6) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P7               (0x1u <<  7) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P8               (0x1u <<  8) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P9               (0x1u <<  9) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P10              (0x1u << 10) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P11              (0x1u << 11) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P12              (0x1u << 12) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P13              (0x1u << 13) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P14              (0x1u << 14) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P15              (0x1u << 15) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P16              (0x1u << 16) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P17              (0x1u << 17) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P18              (0x1u << 18) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P19              (0x1u << 19) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P20              (0x1u << 20) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P21              (0x1u << 21) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P22              (0x1u << 22) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P23              (0x1u << 23) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P24              (0x1u << 24) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P25              (0x1u << 25) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P26              (0x1u << 26) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P27              (0x1u << 27) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P28              (0x1u << 28) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P29              (0x1u << 29) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P30              (0x1u << 30) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0C_P31              (0x1u << 31) /**< \brief (GPIO_PMR0C) Peripheral Multiplexer Select bit 0 */
/* -------- GPIO_PMR0T : (GPIO Offset: 0x01C) Port Peripheral Mux Register 0 - Toggle -------- */
#define GPIO_PMR0T_P0               (0x1u <<  0) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P1               (0x1u <<  1) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P2               (0x1u <<  2) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P3               (0x1u <<  3) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P4               (0x1u <<  4) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P5               (0x1u <<  5) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
#define GPIO_PMR0T_P6               (0x1u <<  6) /**< \brief (GPIO_PMR0T) Peripheral Multiplexer Select bit 0 */
