Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_PMR2S_P21              (0x1u << 21) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P22              (0x1u << 22) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P23              (0x1u << 23) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P24              (0x1u << 24) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P25              (0x1u << 25) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P26              (0x1u << 26) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P27              (0x1u << 27) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P28              (0x1u << 28) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P29              (0x1u << 29) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P30              (0x1u << 30) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2S_P31              (0x1u << 31) /**< \brief (GPIO_PMR2S) Peripheral Multiplexer Select bit 2 */
/* -------- GPIO_PMR2C : (GPIO Offset: 0x038) Port Peripheral Mux Register 2 - Clear -------- */
#define GPIO_PMR2C_P0               (0x1u <<  0) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P1               (0x1u <<  1) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P2               (0x1u <<  2) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P3               (0x1u <<  3) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P4               (0x1u <<  4) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P5               (0x1u <<  5) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P6               (0x1u <<  6) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P7               (0x1u <<  7) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P8               (0x1u <<  8) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P9               (0x1u <<  9) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P10              (0x1u << 10) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P11              (0x1u << 11) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P12              (0x1u << 12) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P13              (0x1u << 13) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P14              (0x1u << 14) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P15              (0x1u << 15) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P16              (0x1u << 16) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P17              (0x1u << 17) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P18              (0x1u << 18) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P19              (0x1u << 19) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P20              (0x1u << 20) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P21              (0x1u << 21) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P22              (0x1u << 22) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P23              (0x1u << 23) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P24              (0x1u << 24) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P25              (0x1u << 25) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P26              (0x1u << 26) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P27              (0x1u << 27) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P28              (0x1u << 28) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P29              (0x1u << 29) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P30              (0x1u << 30) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2C_P31              (0x1u << 31) /**< \brief (GPIO_PMR2C) Peripheral Multiplexer Select bit 2 */
/* -------- GPIO_PMR2T : (GPIO Offset: 0x03C) Port Peripheral Mux Register 2 - Toggle -------- */
#define GPIO_PMR2T_P0               (0x1u <<  0) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P1               (0x1u <<  1) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P2               (0x1u <<  2) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P3               (0x1u <<  3) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P4               (0x1u <<  4) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P5               (0x1u <<  5) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P6               (0x1u <<  6) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P7               (0x1u <<  7) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P8               (0x1u <<  8) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P9               (0x1u <<  9) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P10              (0x1u << 10) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P11              (0x1u << 11) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P12              (0x1u << 12) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P13              (0x1u << 13) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P14              (0x1u << 14) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P15              (0x1u << 15) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P16              (0x1u << 16) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P17              (0x1u << 17) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P18              (0x1u << 18) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P19              (0x1u << 19) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P20              (0x1u << 20) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P21              (0x1u << 21) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P22              (0x1u << 22) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P23              (0x1u << 23) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P24              (0x1u << 24) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P25              (0x1u << 25) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P26              (0x1u << 26) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P27              (0x1u << 27) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P28              (0x1u << 28) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P29              (0x1u << 29) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P30              (0x1u << 30) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
#define GPIO_PMR2T_P31              (0x1u << 31) /**< \brief (GPIO_PMR2T) Peripheral Multiplexer Select bit 2 */
/* -------- GPIO_ODER : (GPIO Offset: 0x040) Port Output Driver Enable Register -------- */
#define GPIO_ODER_P0                (0x1u <<  0) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P1                (0x1u <<  1) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P2                (0x1u <<  2) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P3                (0x1u <<  3) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P4                (0x1u <<  4) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P5                (0x1u <<  5) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P6                (0x1u <<  6) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P7                (0x1u <<  7) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P8                (0x1u <<  8) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P9                (0x1u <<  9) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P10               (0x1u << 10) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P11               (0x1u << 11) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P12               (0x1u << 12) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P13               (0x1u << 13) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P14               (0x1u << 14) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P15               (0x1u << 15) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P16               (0x1u << 16) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P17               (0x1u << 17) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P18               (0x1u << 18) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P19               (0x1u << 19) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P20               (0x1u << 20) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P21               (0x1u << 21) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P22               (0x1u << 22) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P23               (0x1u << 23) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P24               (0x1u << 24) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P25               (0x1u << 25) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P26               (0x1u << 26) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P27               (0x1u << 27) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P28               (0x1u << 28) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P29               (0x1u << 29) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P30               (0x1u << 30) /**< \brief (GPIO_ODER) Output Driver Enable */
#define GPIO_ODER_P31               (0x1u << 31) /**< \brief (GPIO_ODER) Output Driver Enable */
/* -------- GPIO_ODERS : (GPIO Offset: 0x044) Port Output Driver Enable Register - Set -------- */
#define GPIO_ODERS_P0               (0x1u <<  0) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P1               (0x1u <<  1) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P2               (0x1u <<  2) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P3               (0x1u <<  3) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P4               (0x1u <<  4) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P5               (0x1u <<  5) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P6               (0x1u <<  6) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P7               (0x1u <<  7) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P8               (0x1u <<  8) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P9               (0x1u <<  9) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P10              (0x1u << 10) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P11              (0x1u << 11) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P12              (0x1u << 12) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P13              (0x1u << 13) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P14              (0x1u << 14) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P15              (0x1u << 15) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P16              (0x1u << 16) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P17              (0x1u << 17) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P18              (0x1u << 18) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P19              (0x1u << 19) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P20              (0x1u << 20) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P21              (0x1u << 21) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P22              (0x1u << 22) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P23              (0x1u << 23) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P24              (0x1u << 24) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P25              (0x1u << 25) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P26              (0x1u << 26) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P27              (0x1u << 27) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P28              (0x1u << 28) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P29              (0x1u << 29) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P30              (0x1u << 30) /**< \brief (GPIO_ODERS) Output Driver Enable */
#define GPIO_ODERS_P31              (0x1u << 31) /**< \brief (GPIO_ODERS) Output Driver Enable */
/* -------- GPIO_ODERC : (GPIO Offset: 0x048) Port Output Driver Enable Register - Clear -------- */
#define GPIO_ODERC_P0               (0x1u <<  0) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P1               (0x1u <<  1) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P2               (0x1u <<  2) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P3               (0x1u <<  3) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P4               (0x1u <<  4) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P5               (0x1u <<  5) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P6               (0x1u <<  6) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P7               (0x1u <<  7) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P8               (0x1u <<  8) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P9               (0x1u <<  9) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P10              (0x1u << 10) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P11              (0x1u << 11) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P12              (0x1u << 12) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P13              (0x1u << 13) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P14              (0x1u << 14) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P15              (0x1u << 15) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P16              (0x1u << 16) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P17              (0x1u << 17) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P18              (0x1u << 18) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P19              (0x1u << 19) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P20              (0x1u << 20) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P21              (0x1u << 21) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P22              (0x1u << 22) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P23              (0x1u << 23) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P24              (0x1u << 24) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P25              (0x1u << 25) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P26              (0x1u << 26) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P27              (0x1u << 27) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P28              (0x1u << 28) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P29              (0x1u << 29) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P30              (0x1u << 30) /**< \brief (GPIO_ODERC) Output Driver Enable */
#define GPIO_ODERC_P31              (0x1u << 31) /**< \brief (GPIO_ODERC) Output Driver Enable */
/* -------- GPIO_ODERT : (GPIO Offset: 0x04C) Port Output Driver Enable Register - Toggle -------- */
#define GPIO_ODERT_P0               (0x1u <<  0) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P1               (0x1u <<  1) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P2               (0x1u <<  2) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P3               (0x1u <<  3) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P4               (0x1u <<  4) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P5               (0x1u <<  5) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P6               (0x1u <<  6) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P7               (0x1u <<  7) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P8               (0x1u <<  8) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P9               (0x1u <<  9) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P10              (0x1u << 10) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P11              (0x1u << 11) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P12              (0x1u << 12) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P13              (0x1u << 13) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P14              (0x1u << 14) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P15              (0x1u << 15) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P16              (0x1u << 16) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P17              (0x1u << 17) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P18              (0x1u << 18) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P19              (0x1u << 19) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P20              (0x1u << 20) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P21              (0x1u << 21) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P22              (0x1u << 22) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P23              (0x1u << 23) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P24              (0x1u << 24) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P25              (0x1u << 25) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P26              (0x1u << 26) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P27              (0x1u << 27) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P28              (0x1u << 28) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P29              (0x1u << 29) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P30              (0x1u << 30) /**< \brief (GPIO_ODERT) Output Driver Enable */
#define GPIO_ODERT_P31              (0x1u << 31) /**< \brief (GPIO_ODERT) Output Driver Enable */
/* -------- GPIO_OVR : (GPIO Offset: 0x050) Port Output Value Register -------- */
#define GPIO_OVR_P0                 (0x1u <<  0) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P1                 (0x1u <<  1) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P2                 (0x1u <<  2) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P3                 (0x1u <<  3) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P4                 (0x1u <<  4) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P5                 (0x1u <<  5) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P6                 (0x1u <<  6) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P7                 (0x1u <<  7) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P8                 (0x1u <<  8) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P9                 (0x1u <<  9) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P10                (0x1u << 10) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P11                (0x1u << 11) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P12                (0x1u << 12) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P13                (0x1u << 13) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P14                (0x1u << 14) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P15                (0x1u << 15) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P16                (0x1u << 16) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P17                (0x1u << 17) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P18                (0x1u << 18) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P19                (0x1u << 19) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P20                (0x1u << 20) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P21                (0x1u << 21) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P22                (0x1u << 22) /**< \brief (GPIO_OVR) Output Value */
