Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_OVR_P23                (0x1u << 23) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P24                (0x1u << 24) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P25                (0x1u << 25) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P26                (0x1u << 26) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P27                (0x1u << 27) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P28                (0x1u << 28) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P29                (0x1u << 29) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P30                (0x1u << 30) /**< \brief (GPIO_OVR) Output Value */
#define GPIO_OVR_P31                (0x1u << 31) /**< \brief (GPIO_OVR) Output Value */
/* -------- GPIO_OVRS : (GPIO Offset: 0x054) Port Output Value Register - Set -------- */
#define GPIO_OVRS_P0                (0x1u <<  0) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P1                (0x1u <<  1) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P2                (0x1u <<  2) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P3                (0x1u <<  3) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P4                (0x1u <<  4) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P5                (0x1u <<  5) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P6                (0x1u <<  6) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P7                (0x1u <<  7) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P8                (0x1u <<  8) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P9                (0x1u <<  9) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P10               (0x1u << 10) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P11               (0x1u << 11) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P12               (0x1u << 12) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P13               (0x1u << 13) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P14               (0x1u << 14) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P15               (0x1u << 15) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P16               (0x1u << 16) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P17               (0x1u << 17) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P18               (0x1u << 18) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P19               (0x1u << 19) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P20               (0x1u << 20) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P21               (0x1u << 21) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P22               (0x1u << 22) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P23               (0x1u << 23) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P24               (0x1u << 24) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P25               (0x1u << 25) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P26               (0x1u << 26) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P27               (0x1u << 27) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P28               (0x1u << 28) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P29               (0x1u << 29) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P30               (0x1u << 30) /**< \brief (GPIO_OVRS) Output Value */
#define GPIO_OVRS_P31               (0x1u << 31) /**< \brief (GPIO_OVRS) Output Value */
/* -------- GPIO_OVRC : (GPIO Offset: 0x058) Port Output Value Register - Clear -------- */
#define GPIO_OVRC_P0                (0x1u <<  0) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P1                (0x1u <<  1) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P2                (0x1u <<  2) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P3                (0x1u <<  3) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P4                (0x1u <<  4) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P5                (0x1u <<  5) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P6                (0x1u <<  6) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P7                (0x1u <<  7) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P8                (0x1u <<  8) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P9                (0x1u <<  9) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P10               (0x1u << 10) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P11               (0x1u << 11) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P12               (0x1u << 12) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P13               (0x1u << 13) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P14               (0x1u << 14) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P15               (0x1u << 15) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P16               (0x1u << 16) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P17               (0x1u << 17) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P18               (0x1u << 18) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P19               (0x1u << 19) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P20               (0x1u << 20) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P21               (0x1u << 21) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P22               (0x1u << 22) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P23               (0x1u << 23) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P24               (0x1u << 24) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P25               (0x1u << 25) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P26               (0x1u << 26) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P27               (0x1u << 27) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P28               (0x1u << 28) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P29               (0x1u << 29) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P30               (0x1u << 30) /**< \brief (GPIO_OVRC) Output Value */
#define GPIO_OVRC_P31               (0x1u << 31) /**< \brief (GPIO_OVRC) Output Value */
/* -------- GPIO_OVRT : (GPIO Offset: 0x05C) Port Output Value Register - Toggle -------- */
#define GPIO_OVRT_P0                (0x1u <<  0) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P1                (0x1u <<  1) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P2                (0x1u <<  2) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P3                (0x1u <<  3) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P4                (0x1u <<  4) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P5                (0x1u <<  5) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P6                (0x1u <<  6) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P7                (0x1u <<  7) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P8                (0x1u <<  8) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P9                (0x1u <<  9) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P10               (0x1u << 10) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P11               (0x1u << 11) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P12               (0x1u << 12) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P13               (0x1u << 13) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P14               (0x1u << 14) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P15               (0x1u << 15) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P16               (0x1u << 16) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P17               (0x1u << 17) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P18               (0x1u << 18) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P19               (0x1u << 19) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P20               (0x1u << 20) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P21               (0x1u << 21) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P22               (0x1u << 22) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P23               (0x1u << 23) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P24               (0x1u << 24) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P25               (0x1u << 25) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P26               (0x1u << 26) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P27               (0x1u << 27) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P28               (0x1u << 28) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P29               (0x1u << 29) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P30               (0x1u << 30) /**< \brief (GPIO_OVRT) Output Value */
#define GPIO_OVRT_P31               (0x1u << 31) /**< \brief (GPIO_OVRT) Output Value */
/* -------- GPIO_PVR : (GPIO Offset: 0x060) Port Pin Value Register -------- */
#define GPIO_PVR_P0                 (0x1u <<  0) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P1                 (0x1u <<  1) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P2                 (0x1u <<  2) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P3                 (0x1u <<  3) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P4                 (0x1u <<  4) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P5                 (0x1u <<  5) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P6                 (0x1u <<  6) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P7                 (0x1u <<  7) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P8                 (0x1u <<  8) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P9                 (0x1u <<  9) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P10                (0x1u << 10) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P11                (0x1u << 11) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P12                (0x1u << 12) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P13                (0x1u << 13) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P14                (0x1u << 14) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P15                (0x1u << 15) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P16                (0x1u << 16) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P17                (0x1u << 17) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P18                (0x1u << 18) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P19                (0x1u << 19) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P20                (0x1u << 20) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P21                (0x1u << 21) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P22                (0x1u << 22) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P23                (0x1u << 23) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P24                (0x1u << 24) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P25                (0x1u << 25) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P26                (0x1u << 26) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P27                (0x1u << 27) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P28                (0x1u << 28) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P29                (0x1u << 29) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P30                (0x1u << 30) /**< \brief (GPIO_PVR) Pin Value */
#define GPIO_PVR_P31                (0x1u << 31) /**< \brief (GPIO_PVR) Pin Value */
/* -------- GPIO_PUER : (GPIO Offset: 0x070) Port Pull-up Enable Register -------- */
#define GPIO_PUER_P0                (0x1u <<  0) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P1                (0x1u <<  1) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P2                (0x1u <<  2) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P3                (0x1u <<  3) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P4                (0x1u <<  4) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P5                (0x1u <<  5) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P6                (0x1u <<  6) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P7                (0x1u <<  7) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P8                (0x1u <<  8) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P9                (0x1u <<  9) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P10               (0x1u << 10) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P11               (0x1u << 11) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P12               (0x1u << 12) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P13               (0x1u << 13) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P14               (0x1u << 14) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P15               (0x1u << 15) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P16               (0x1u << 16) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P17               (0x1u << 17) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P18               (0x1u << 18) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P19               (0x1u << 19) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P20               (0x1u << 20) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P21               (0x1u << 21) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P22               (0x1u << 22) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P23               (0x1u << 23) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P24               (0x1u << 24) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P25               (0x1u << 25) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P26               (0x1u << 26) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P27               (0x1u << 27) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P28               (0x1u << 28) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P29               (0x1u << 29) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P30               (0x1u << 30) /**< \brief (GPIO_PUER) Pull-up Enable */
#define GPIO_PUER_P31               (0x1u << 31) /**< \brief (GPIO_PUER) Pull-up Enable */
/* -------- GPIO_PUERS : (GPIO Offset: 0x074) Port Pull-up Enable Register - Set -------- */
#define GPIO_PUERS_P0               (0x1u <<  0) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P1               (0x1u <<  1) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P2               (0x1u <<  2) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P3               (0x1u <<  3) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P4               (0x1u <<  4) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P5               (0x1u <<  5) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P6               (0x1u <<  6) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P7               (0x1u <<  7) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P8               (0x1u <<  8) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P9               (0x1u <<  9) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P10              (0x1u << 10) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P11              (0x1u << 11) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P12              (0x1u << 12) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P13              (0x1u << 13) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P14              (0x1u << 14) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P15              (0x1u << 15) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P16              (0x1u << 16) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P17              (0x1u << 17) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P18              (0x1u << 18) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P19              (0x1u << 19) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P20              (0x1u << 20) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P21              (0x1u << 21) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P22              (0x1u << 22) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P23              (0x1u << 23) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P24              (0x1u << 24) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P25              (0x1u << 25) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P26              (0x1u << 26) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P27              (0x1u << 27) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P28              (0x1u << 28) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P29              (0x1u << 29) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P30              (0x1u << 30) /**< \brief (GPIO_PUERS) Pull-up Enable */
#define GPIO_PUERS_P31              (0x1u << 31) /**< \brief (GPIO_PUERS) Pull-up Enable */
/* -------- GPIO_PUERC : (GPIO Offset: 0x078) Port Pull-up Enable Register - Clear -------- */
#define GPIO_PUERC_P0               (0x1u <<  0) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P1               (0x1u <<  1) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P2               (0x1u <<  2) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P3               (0x1u <<  3) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P4               (0x1u <<  4) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P5               (0x1u <<  5) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P6               (0x1u <<  6) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P7               (0x1u <<  7) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P8               (0x1u <<  8) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P9               (0x1u <<  9) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P10              (0x1u << 10) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P11              (0x1u << 11) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P12              (0x1u << 12) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P13              (0x1u << 13) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P14              (0x1u << 14) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P15              (0x1u << 15) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P16              (0x1u << 16) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P17              (0x1u << 17) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P18              (0x1u << 18) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P19              (0x1u << 19) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P20              (0x1u << 20) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P21              (0x1u << 21) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P22              (0x1u << 22) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P23              (0x1u << 23) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P24              (0x1u << 24) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P25              (0x1u << 25) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P26              (0x1u << 26) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P27              (0x1u << 27) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P28              (0x1u << 28) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P29              (0x1u << 29) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P30              (0x1u << 30) /**< \brief (GPIO_PUERC) Pull-up Enable */
#define GPIO_PUERC_P31              (0x1u << 31) /**< \brief (GPIO_PUERC) Pull-up Enable */
/* -------- GPIO_PUERT : (GPIO Offset: 0x07C) Port Pull-up Enable Register - Toggle -------- */
#define GPIO_PUERT_P0               (0x1u <<  0) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P1               (0x1u <<  1) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P2               (0x1u <<  2) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P3               (0x1u <<  3) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P4               (0x1u <<  4) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P5               (0x1u <<  5) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P6               (0x1u <<  6) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P7               (0x1u <<  7) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P8               (0x1u <<  8) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P9               (0x1u <<  9) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P10              (0x1u << 10) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P11              (0x1u << 11) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P12              (0x1u << 12) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P13              (0x1u << 13) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P14              (0x1u << 14) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P15              (0x1u << 15) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P16              (0x1u << 16) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P17              (0x1u << 17) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P18              (0x1u << 18) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P19              (0x1u << 19) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P20              (0x1u << 20) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P21              (0x1u << 21) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P22              (0x1u << 22) /**< \brief (GPIO_PUERT) Pull-up Enable */
