Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_PUERT_P23              (0x1u << 23) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P24              (0x1u << 24) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P25              (0x1u << 25) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P26              (0x1u << 26) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P27              (0x1u << 27) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P28              (0x1u << 28) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P29              (0x1u << 29) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P30              (0x1u << 30) /**< \brief (GPIO_PUERT) Pull-up Enable */
#define GPIO_PUERT_P31              (0x1u << 31) /**< \brief (GPIO_PUERT) Pull-up Enable */
/* -------- GPIO_PDER : (GPIO Offset: 0x080) Port Pull-down Enable Register -------- */
#define GPIO_PDER_P0                (0x1u <<  0) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P1                (0x1u <<  1) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P2                (0x1u <<  2) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P3                (0x1u <<  3) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P4                (0x1u <<  4) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P5                (0x1u <<  5) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P6                (0x1u <<  6) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P7                (0x1u <<  7) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P8                (0x1u <<  8) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P9                (0x1u <<  9) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P10               (0x1u << 10) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P11               (0x1u << 11) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P12               (0x1u << 12) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P13               (0x1u << 13) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P14               (0x1u << 14) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P15               (0x1u << 15) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P16               (0x1u << 16) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P17               (0x1u << 17) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P18               (0x1u << 18) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P19               (0x1u << 19) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P20               (0x1u << 20) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P21               (0x1u << 21) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P22               (0x1u << 22) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P23               (0x1u << 23) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P24               (0x1u << 24) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P25               (0x1u << 25) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P26               (0x1u << 26) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P27               (0x1u << 27) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P28               (0x1u << 28) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P29               (0x1u << 29) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P30               (0x1u << 30) /**< \brief (GPIO_PDER) Pull-down Enable */
#define GPIO_PDER_P31               (0x1u << 31) /**< \brief (GPIO_PDER) Pull-down Enable */
/* -------- GPIO_PDERS : (GPIO Offset: 0x084) Port Pull-down Enable Register - Set -------- */
#define GPIO_PDERS_P0               (0x1u <<  0) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P1               (0x1u <<  1) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P2               (0x1u <<  2) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P3               (0x1u <<  3) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P4               (0x1u <<  4) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P5               (0x1u <<  5) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P6               (0x1u <<  6) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P7               (0x1u <<  7) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P8               (0x1u <<  8) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P9               (0x1u <<  9) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P10              (0x1u << 10) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P11              (0x1u << 11) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P12              (0x1u << 12) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P13              (0x1u << 13) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P14              (0x1u << 14) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P15              (0x1u << 15) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P16              (0x1u << 16) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P17              (0x1u << 17) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P18              (0x1u << 18) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P19              (0x1u << 19) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P20              (0x1u << 20) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P21              (0x1u << 21) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P22              (0x1u << 22) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P23              (0x1u << 23) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P24              (0x1u << 24) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P25              (0x1u << 25) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P26              (0x1u << 26) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P27              (0x1u << 27) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P28              (0x1u << 28) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P29              (0x1u << 29) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P30              (0x1u << 30) /**< \brief (GPIO_PDERS) Pull-down Enable */
#define GPIO_PDERS_P31              (0x1u << 31) /**< \brief (GPIO_PDERS) Pull-down Enable */
/* -------- GPIO_PDERC : (GPIO Offset: 0x088) Port Pull-down Enable Register - Clear -------- */
#define GPIO_PDERC_P0               (0x1u <<  0) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P1               (0x1u <<  1) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P2               (0x1u <<  2) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P3               (0x1u <<  3) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P4               (0x1u <<  4) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P5               (0x1u <<  5) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P6               (0x1u <<  6) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P7               (0x1u <<  7) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P8               (0x1u <<  8) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P9               (0x1u <<  9) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P10              (0x1u << 10) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P11              (0x1u << 11) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P12              (0x1u << 12) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P13              (0x1u << 13) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P14              (0x1u << 14) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P15              (0x1u << 15) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P16              (0x1u << 16) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P17              (0x1u << 17) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P18              (0x1u << 18) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P19              (0x1u << 19) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P20              (0x1u << 20) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P21              (0x1u << 21) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P22              (0x1u << 22) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P23              (0x1u << 23) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P24              (0x1u << 24) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P25              (0x1u << 25) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P26              (0x1u << 26) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P27              (0x1u << 27) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P28              (0x1u << 28) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P29              (0x1u << 29) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P30              (0x1u << 30) /**< \brief (GPIO_PDERC) Pull-down Enable */
#define GPIO_PDERC_P31              (0x1u << 31) /**< \brief (GPIO_PDERC) Pull-down Enable */
/* -------- GPIO_PDERT : (GPIO Offset: 0x08C) Port Pull-down Enable Register - Toggle -------- */
#define GPIO_PDERT_P0               (0x1u <<  0) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P1               (0x1u <<  1) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P2               (0x1u <<  2) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P3               (0x1u <<  3) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P4               (0x1u <<  4) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P5               (0x1u <<  5) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P6               (0x1u <<  6) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P7               (0x1u <<  7) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P8               (0x1u <<  8) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P9               (0x1u <<  9) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P10              (0x1u << 10) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P11              (0x1u << 11) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P12              (0x1u << 12) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P13              (0x1u << 13) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P14              (0x1u << 14) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P15              (0x1u << 15) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P16              (0x1u << 16) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P17              (0x1u << 17) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P18              (0x1u << 18) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P19              (0x1u << 19) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P20              (0x1u << 20) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P21              (0x1u << 21) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P22              (0x1u << 22) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P23              (0x1u << 23) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P24              (0x1u << 24) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P25              (0x1u << 25) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P26              (0x1u << 26) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P27              (0x1u << 27) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P28              (0x1u << 28) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P29              (0x1u << 29) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P30              (0x1u << 30) /**< \brief (GPIO_PDERT) Pull-down Enable */
#define GPIO_PDERT_P31              (0x1u << 31) /**< \brief (GPIO_PDERT) Pull-down Enable */
/* -------- GPIO_IER : (GPIO Offset: 0x090) Port Interrupt Enable Register -------- */
#define GPIO_IER_P0                 (0x1u <<  0) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P1                 (0x1u <<  1) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P2                 (0x1u <<  2) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P3                 (0x1u <<  3) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P4                 (0x1u <<  4) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P5                 (0x1u <<  5) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P6                 (0x1u <<  6) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P7                 (0x1u <<  7) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P8                 (0x1u <<  8) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P9                 (0x1u <<  9) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P10                (0x1u << 10) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P11                (0x1u << 11) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P12                (0x1u << 12) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P13                (0x1u << 13) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P14                (0x1u << 14) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P15                (0x1u << 15) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P16                (0x1u << 16) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P17                (0x1u << 17) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P18                (0x1u << 18) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P19                (0x1u << 19) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P20                (0x1u << 20) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P21                (0x1u << 21) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P22                (0x1u << 22) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P23                (0x1u << 23) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P24                (0x1u << 24) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P25                (0x1u << 25) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P26                (0x1u << 26) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P27                (0x1u << 27) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P28                (0x1u << 28) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P29                (0x1u << 29) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P30                (0x1u << 30) /**< \brief (GPIO_IER) Interrupt Enable */
#define GPIO_IER_P31                (0x1u << 31) /**< \brief (GPIO_IER) Interrupt Enable */
/* -------- GPIO_IERS : (GPIO Offset: 0x094) Port Interrupt Enable Register - Set -------- */
#define GPIO_IERS_P0                (0x1u <<  0) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P1                (0x1u <<  1) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P2                (0x1u <<  2) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P3                (0x1u <<  3) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P4                (0x1u <<  4) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P5                (0x1u <<  5) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P6                (0x1u <<  6) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P7                (0x1u <<  7) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P8                (0x1u <<  8) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P9                (0x1u <<  9) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P10               (0x1u << 10) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P11               (0x1u << 11) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P12               (0x1u << 12) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P13               (0x1u << 13) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P14               (0x1u << 14) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P15               (0x1u << 15) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P16               (0x1u << 16) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P17               (0x1u << 17) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P18               (0x1u << 18) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P19               (0x1u << 19) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P20               (0x1u << 20) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P21               (0x1u << 21) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P22               (0x1u << 22) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P23               (0x1u << 23) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P24               (0x1u << 24) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P25               (0x1u << 25) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P26               (0x1u << 26) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P27               (0x1u << 27) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P28               (0x1u << 28) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P29               (0x1u << 29) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P30               (0x1u << 30) /**< \brief (GPIO_IERS) Interrupt Enable */
#define GPIO_IERS_P31               (0x1u << 31) /**< \brief (GPIO_IERS) Interrupt Enable */
/* -------- GPIO_IERC : (GPIO Offset: 0x098) Port Interrupt Enable Register - Clear -------- */
#define GPIO_IERC_P0                (0x1u <<  0) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P1                (0x1u <<  1) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P2                (0x1u <<  2) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P3                (0x1u <<  3) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P4                (0x1u <<  4) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P5                (0x1u <<  5) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P6                (0x1u <<  6) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P7                (0x1u <<  7) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P8                (0x1u <<  8) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P9                (0x1u <<  9) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P10               (0x1u << 10) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P11               (0x1u << 11) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P12               (0x1u << 12) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P13               (0x1u << 13) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P14               (0x1u << 14) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P15               (0x1u << 15) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P16               (0x1u << 16) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P17               (0x1u << 17) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P18               (0x1u << 18) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P19               (0x1u << 19) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P20               (0x1u << 20) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P21               (0x1u << 21) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P22               (0x1u << 22) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P23               (0x1u << 23) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P24               (0x1u << 24) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P25               (0x1u << 25) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P26               (0x1u << 26) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P27               (0x1u << 27) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P28               (0x1u << 28) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P29               (0x1u << 29) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P30               (0x1u << 30) /**< \brief (GPIO_IERC) Interrupt Enable */
#define GPIO_IERC_P31               (0x1u << 31) /**< \brief (GPIO_IERC) Interrupt Enable */
/* -------- GPIO_IERT : (GPIO Offset: 0x09C) Port Interrupt Enable Register - Toggle -------- */
#define GPIO_IERT_P0                (0x1u <<  0) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P1                (0x1u <<  1) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P2                (0x1u <<  2) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P3                (0x1u <<  3) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P4                (0x1u <<  4) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P5                (0x1u <<  5) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P6                (0x1u <<  6) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P7                (0x1u <<  7) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P8                (0x1u <<  8) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P9                (0x1u <<  9) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P10               (0x1u << 10) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P11               (0x1u << 11) /**< \brief (GPIO_IERT) Interrupt Enable */
#define GPIO_IERT_P12               (0x1u << 12) /**< \brief (GPIO_IERT) Interrupt Enable */
