Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_IMR1C_P26              (0x1u << 26) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
#define GPIO_IMR1C_P27              (0x1u << 27) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
#define GPIO_IMR1C_P28              (0x1u << 28) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
#define GPIO_IMR1C_P29              (0x1u << 29) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
#define GPIO_IMR1C_P30              (0x1u << 30) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
#define GPIO_IMR1C_P31              (0x1u << 31) /**< \brief (GPIO_IMR1C) Interrupt Mode Bit 1 */
/* -------- GPIO_IMR1T : (GPIO Offset: 0x0BC) Port Interrupt Mode Register 1 - Toggle -------- */
#define GPIO_IMR1T_P0               (0x1u <<  0) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P1               (0x1u <<  1) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P2               (0x1u <<  2) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P3               (0x1u <<  3) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P4               (0x1u <<  4) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P5               (0x1u <<  5) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P6               (0x1u <<  6) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P7               (0x1u <<  7) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P8               (0x1u <<  8) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P9               (0x1u <<  9) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P10              (0x1u << 10) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P11              (0x1u << 11) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P12              (0x1u << 12) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P13              (0x1u << 13) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P14              (0x1u << 14) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P15              (0x1u << 15) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P16              (0x1u << 16) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P17              (0x1u << 17) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P18              (0x1u << 18) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P19              (0x1u << 19) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P20              (0x1u << 20) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P21              (0x1u << 21) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P22              (0x1u << 22) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P23              (0x1u << 23) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P24              (0x1u << 24) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P25              (0x1u << 25) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P26              (0x1u << 26) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P27              (0x1u << 27) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P28              (0x1u << 28) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P29              (0x1u << 29) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P30              (0x1u << 30) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
#define GPIO_IMR1T_P31              (0x1u << 31) /**< \brief (GPIO_IMR1T) Interrupt Mode Bit 1 */
/* -------- GPIO_GFER : (GPIO Offset: 0x0C0) Port Glitch Filter Enable Register -------- */
#define GPIO_GFER_P0                (0x1u <<  0) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P1                (0x1u <<  1) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P2                (0x1u <<  2) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P3                (0x1u <<  3) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P4                (0x1u <<  4) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P5                (0x1u <<  5) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P6                (0x1u <<  6) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P7                (0x1u <<  7) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P8                (0x1u <<  8) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P9                (0x1u <<  9) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P10               (0x1u << 10) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P11               (0x1u << 11) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P12               (0x1u << 12) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P13               (0x1u << 13) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P14               (0x1u << 14) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P15               (0x1u << 15) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P16               (0x1u << 16) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P17               (0x1u << 17) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P18               (0x1u << 18) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P19               (0x1u << 19) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P20               (0x1u << 20) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P21               (0x1u << 21) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P22               (0x1u << 22) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P23               (0x1u << 23) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P24               (0x1u << 24) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P25               (0x1u << 25) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P26               (0x1u << 26) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P27               (0x1u << 27) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P28               (0x1u << 28) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P29               (0x1u << 29) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P30               (0x1u << 30) /**< \brief (GPIO_GFER) Glitch Filter Enable */
#define GPIO_GFER_P31               (0x1u << 31) /**< \brief (GPIO_GFER) Glitch Filter Enable */
/* -------- GPIO_GFERS : (GPIO Offset: 0x0C4) Port Glitch Filter Enable Register - Set -------- */
#define GPIO_GFERS_P0               (0x1u <<  0) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P1               (0x1u <<  1) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P2               (0x1u <<  2) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P3               (0x1u <<  3) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P4               (0x1u <<  4) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P5               (0x1u <<  5) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P6               (0x1u <<  6) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P7               (0x1u <<  7) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P8               (0x1u <<  8) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P9               (0x1u <<  9) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P10              (0x1u << 10) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P11              (0x1u << 11) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P12              (0x1u << 12) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P13              (0x1u << 13) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P14              (0x1u << 14) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P15              (0x1u << 15) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P16              (0x1u << 16) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P17              (0x1u << 17) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P18              (0x1u << 18) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P19              (0x1u << 19) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P20              (0x1u << 20) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P21              (0x1u << 21) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P22              (0x1u << 22) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P23              (0x1u << 23) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P24              (0x1u << 24) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P25              (0x1u << 25) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P26              (0x1u << 26) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P27              (0x1u << 27) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P28              (0x1u << 28) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P29              (0x1u << 29) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P30              (0x1u << 30) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
#define GPIO_GFERS_P31              (0x1u << 31) /**< \brief (GPIO_GFERS) Glitch Filter Enable */
/* -------- GPIO_GFERC : (GPIO Offset: 0x0C8) Port Glitch Filter Enable Register - Clear -------- */
#define GPIO_GFERC_P0               (0x1u <<  0) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P1               (0x1u <<  1) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P2               (0x1u <<  2) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P3               (0x1u <<  3) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P4               (0x1u <<  4) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P5               (0x1u <<  5) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P6               (0x1u <<  6) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P7               (0x1u <<  7) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P8               (0x1u <<  8) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P9               (0x1u <<  9) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P10              (0x1u << 10) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P11              (0x1u << 11) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P12              (0x1u << 12) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P13              (0x1u << 13) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P14              (0x1u << 14) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P15              (0x1u << 15) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P16              (0x1u << 16) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P17              (0x1u << 17) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P18              (0x1u << 18) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P19              (0x1u << 19) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P20              (0x1u << 20) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P21              (0x1u << 21) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P22              (0x1u << 22) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P23              (0x1u << 23) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P24              (0x1u << 24) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P25              (0x1u << 25) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P26              (0x1u << 26) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P27              (0x1u << 27) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P28              (0x1u << 28) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P29              (0x1u << 29) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P30              (0x1u << 30) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
#define GPIO_GFERC_P31              (0x1u << 31) /**< \brief (GPIO_GFERC) Glitch Filter Enable */
/* -------- GPIO_GFERT : (GPIO Offset: 0x0CC) Port Glitch Filter Enable Register - Toggle -------- */
#define GPIO_GFERT_P0               (0x1u <<  0) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P1               (0x1u <<  1) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P2               (0x1u <<  2) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P3               (0x1u <<  3) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P4               (0x1u <<  4) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P5               (0x1u <<  5) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P6               (0x1u <<  6) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P7               (0x1u <<  7) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P8               (0x1u <<  8) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P9               (0x1u <<  9) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P10              (0x1u << 10) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P11              (0x1u << 11) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P12              (0x1u << 12) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P13              (0x1u << 13) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P14              (0x1u << 14) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P15              (0x1u << 15) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P16              (0x1u << 16) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P17              (0x1u << 17) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P18              (0x1u << 18) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P19              (0x1u << 19) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P20              (0x1u << 20) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P21              (0x1u << 21) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P22              (0x1u << 22) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P23              (0x1u << 23) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P24              (0x1u << 24) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P25              (0x1u << 25) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P26              (0x1u << 26) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P27              (0x1u << 27) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P28              (0x1u << 28) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P29              (0x1u << 29) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P30              (0x1u << 30) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
#define GPIO_GFERT_P31              (0x1u << 31) /**< \brief (GPIO_GFERT) Glitch Filter Enable */
/* -------- GPIO_IFR : (GPIO Offset: 0x0D0) Port Interrupt Flag Register -------- */
#define GPIO_IFR_P0                 (0x1u <<  0) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P1                 (0x1u <<  1) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P2                 (0x1u <<  2) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P3                 (0x1u <<  3) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P4                 (0x1u <<  4) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P5                 (0x1u <<  5) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P6                 (0x1u <<  6) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P7                 (0x1u <<  7) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P8                 (0x1u <<  8) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P9                 (0x1u <<  9) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P10                (0x1u << 10) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P11                (0x1u << 11) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P12                (0x1u << 12) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P13                (0x1u << 13) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P14                (0x1u << 14) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P15                (0x1u << 15) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P16                (0x1u << 16) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P17                (0x1u << 17) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P18                (0x1u << 18) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P19                (0x1u << 19) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P20                (0x1u << 20) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P21                (0x1u << 21) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P22                (0x1u << 22) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P23                (0x1u << 23) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P24                (0x1u << 24) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P25                (0x1u << 25) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P26                (0x1u << 26) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P27                (0x1u << 27) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P28                (0x1u << 28) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P29                (0x1u << 29) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P30                (0x1u << 30) /**< \brief (GPIO_IFR) Interrupt Flag */
#define GPIO_IFR_P31                (0x1u << 31) /**< \brief (GPIO_IFR) Interrupt Flag */
/* -------- GPIO_IFRC : (GPIO Offset: 0x0D8) Port Interrupt Flag Register - Clear -------- */
#define GPIO_IFRC_P0                (0x1u <<  0) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P1                (0x1u <<  1) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P2                (0x1u <<  2) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P3                (0x1u <<  3) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P4                (0x1u <<  4) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P5                (0x1u <<  5) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P6                (0x1u <<  6) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P7                (0x1u <<  7) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P8                (0x1u <<  8) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P9                (0x1u <<  9) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P10               (0x1u << 10) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P11               (0x1u << 11) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P12               (0x1u << 12) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P13               (0x1u << 13) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P14               (0x1u << 14) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P15               (0x1u << 15) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P16               (0x1u << 16) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P17               (0x1u << 17) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P18               (0x1u << 18) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P19               (0x1u << 19) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P20               (0x1u << 20) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P21               (0x1u << 21) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P22               (0x1u << 22) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P23               (0x1u << 23) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P24               (0x1u << 24) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P25               (0x1u << 25) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P26               (0x1u << 26) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P27               (0x1u << 27) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P28               (0x1u << 28) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P29               (0x1u << 29) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P30               (0x1u << 30) /**< \brief (GPIO_IFRC) Interrupt Flag */
#define GPIO_IFRC_P31               (0x1u << 31) /**< \brief (GPIO_IFRC) Interrupt Flag */
/* -------- GPIO_ODMER : (GPIO Offset: 0x0E0) Port Open Drain Mode Register -------- */
#define GPIO_ODMER_P0               (0x1u <<  0) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P1               (0x1u <<  1) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P2               (0x1u <<  2) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P3               (0x1u <<  3) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P4               (0x1u <<  4) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P5               (0x1u <<  5) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P6               (0x1u <<  6) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P7               (0x1u <<  7) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
#define GPIO_ODMER_P8               (0x1u <<  8) /**< \brief (GPIO_ODMER) Open Drain Mode Enable */
