Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_EVER_P0                (0x1u <<  0) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P1                (0x1u <<  1) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P2                (0x1u <<  2) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P3                (0x1u <<  3) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P4                (0x1u <<  4) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P5                (0x1u <<  5) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P6                (0x1u <<  6) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P7                (0x1u <<  7) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P8                (0x1u <<  8) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P9                (0x1u <<  9) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P10               (0x1u << 10) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P11               (0x1u << 11) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P12               (0x1u << 12) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P13               (0x1u << 13) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P14               (0x1u << 14) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P15               (0x1u << 15) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P16               (0x1u << 16) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P17               (0x1u << 17) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P18               (0x1u << 18) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P19               (0x1u << 19) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P20               (0x1u << 20) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P21               (0x1u << 21) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P22               (0x1u << 22) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P23               (0x1u << 23) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P24               (0x1u << 24) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P25               (0x1u << 25) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P26               (0x1u << 26) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P27               (0x1u << 27) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P28               (0x1u << 28) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P29               (0x1u << 29) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P30               (0x1u << 30) /**< \brief (GPIO_EVER) Event Enable */
#define GPIO_EVER_P31               (0x1u << 31) /**< \brief (GPIO_EVER) Event Enable */
/* -------- GPIO_EVERS : (GPIO Offset: 0x184) Port Event Enable Register - Set -------- */
#define GPIO_EVERS_P0               (0x1u <<  0) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P1               (0x1u <<  1) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P2               (0x1u <<  2) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P3               (0x1u <<  3) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P4               (0x1u <<  4) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P5               (0x1u <<  5) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P6               (0x1u <<  6) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P7               (0x1u <<  7) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P8               (0x1u <<  8) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P9               (0x1u <<  9) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P10              (0x1u << 10) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P11              (0x1u << 11) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P12              (0x1u << 12) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P13              (0x1u << 13) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P14              (0x1u << 14) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P15              (0x1u << 15) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P16              (0x1u << 16) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P17              (0x1u << 17) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P18              (0x1u << 18) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P19              (0x1u << 19) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P20              (0x1u << 20) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P21              (0x1u << 21) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P22              (0x1u << 22) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P23              (0x1u << 23) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P24              (0x1u << 24) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P25              (0x1u << 25) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P26              (0x1u << 26) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P27              (0x1u << 27) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P28              (0x1u << 28) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P29              (0x1u << 29) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P30              (0x1u << 30) /**< \brief (GPIO_EVERS) Event Enable */
#define GPIO_EVERS_P31              (0x1u << 31) /**< \brief (GPIO_EVERS) Event Enable */
/* -------- GPIO_EVERC : (GPIO Offset: 0x188) Port Event Enable Register - Clear -------- */
#define GPIO_EVERC_P0               (0x1u <<  0) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P1               (0x1u <<  1) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P2               (0x1u <<  2) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P3               (0x1u <<  3) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P4               (0x1u <<  4) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P5               (0x1u <<  5) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P6               (0x1u <<  6) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P7               (0x1u <<  7) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P8               (0x1u <<  8) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P9               (0x1u <<  9) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P10              (0x1u << 10) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P11              (0x1u << 11) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P12              (0x1u << 12) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P13              (0x1u << 13) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P14              (0x1u << 14) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P15              (0x1u << 15) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P16              (0x1u << 16) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P17              (0x1u << 17) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P18              (0x1u << 18) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P19              (0x1u << 19) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P20              (0x1u << 20) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P21              (0x1u << 21) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P22              (0x1u << 22) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P23              (0x1u << 23) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P24              (0x1u << 24) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P25              (0x1u << 25) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P26              (0x1u << 26) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P27              (0x1u << 27) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P28              (0x1u << 28) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P29              (0x1u << 29) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P30              (0x1u << 30) /**< \brief (GPIO_EVERC) Event Enable */
#define GPIO_EVERC_P31              (0x1u << 31) /**< \brief (GPIO_EVERC) Event Enable */
/* -------- GPIO_EVERT : (GPIO Offset: 0x18C) Port Event Enable Register - Toggle -------- */
#define GPIO_EVERT_P0               (0x1u <<  0) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P1               (0x1u <<  1) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P2               (0x1u <<  2) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P3               (0x1u <<  3) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P4               (0x1u <<  4) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P5               (0x1u <<  5) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P6               (0x1u <<  6) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P7               (0x1u <<  7) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P8               (0x1u <<  8) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P9               (0x1u <<  9) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P10              (0x1u << 10) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P11              (0x1u << 11) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P12              (0x1u << 12) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P13              (0x1u << 13) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P14              (0x1u << 14) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P15              (0x1u << 15) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P16              (0x1u << 16) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P17              (0x1u << 17) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P18              (0x1u << 18) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P19              (0x1u << 19) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P20              (0x1u << 20) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P21              (0x1u << 21) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P22              (0x1u << 22) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P23              (0x1u << 23) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P24              (0x1u << 24) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P25              (0x1u << 25) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P26              (0x1u << 26) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P27              (0x1u << 27) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P28              (0x1u << 28) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P29              (0x1u << 29) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P30              (0x1u << 30) /**< \brief (GPIO_EVERT) Event Enable */
#define GPIO_EVERT_P31              (0x1u << 31) /**< \brief (GPIO_EVERT) Event Enable */
/* -------- GPIO_LOCK : (GPIO Offset: 0x1A0) Port Lock Register -------- */
#define GPIO_LOCK_P0                (0x1u <<  0) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P1                (0x1u <<  1) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P2                (0x1u <<  2) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P3                (0x1u <<  3) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P4                (0x1u <<  4) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P5                (0x1u <<  5) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P6                (0x1u <<  6) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P7                (0x1u <<  7) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P8                (0x1u <<  8) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P9                (0x1u <<  9) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P10               (0x1u << 10) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P11               (0x1u << 11) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P12               (0x1u << 12) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P13               (0x1u << 13) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P14               (0x1u << 14) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P15               (0x1u << 15) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P16               (0x1u << 16) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P17               (0x1u << 17) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P18               (0x1u << 18) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P19               (0x1u << 19) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P20               (0x1u << 20) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P21               (0x1u << 21) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P22               (0x1u << 22) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P23               (0x1u << 23) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P24               (0x1u << 24) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P25               (0x1u << 25) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P26               (0x1u << 26) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P27               (0x1u << 27) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P28               (0x1u << 28) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P29               (0x1u << 29) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P30               (0x1u << 30) /**< \brief (GPIO_LOCK) Lock State */
#define GPIO_LOCK_P31               (0x1u << 31) /**< \brief (GPIO_LOCK) Lock State */
/* -------- GPIO_LOCKS : (GPIO Offset: 0x1A4) Port Lock Register - Set -------- */
#define GPIO_LOCKS_P0               (0x1u <<  0) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P1               (0x1u <<  1) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P2               (0x1u <<  2) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P3               (0x1u <<  3) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P4               (0x1u <<  4) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P5               (0x1u <<  5) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P6               (0x1u <<  6) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P7               (0x1u <<  7) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P8               (0x1u <<  8) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P9               (0x1u <<  9) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P10              (0x1u << 10) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P11              (0x1u << 11) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P12              (0x1u << 12) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P13              (0x1u << 13) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P14              (0x1u << 14) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P15              (0x1u << 15) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P16              (0x1u << 16) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P17              (0x1u << 17) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P18              (0x1u << 18) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P19              (0x1u << 19) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P20              (0x1u << 20) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P21              (0x1u << 21) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P22              (0x1u << 22) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P23              (0x1u << 23) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P24              (0x1u << 24) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P25              (0x1u << 25) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P26              (0x1u << 26) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P27              (0x1u << 27) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P28              (0x1u << 28) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P29              (0x1u << 29) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P30              (0x1u << 30) /**< \brief (GPIO_LOCKS) Lock State */
#define GPIO_LOCKS_P31              (0x1u << 31) /**< \brief (GPIO_LOCKS) Lock State */
/* -------- GPIO_LOCKC : (GPIO Offset: 0x1A8) Port Lock Register - Clear -------- */
#define GPIO_LOCKC_P0               (0x1u <<  0) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P1               (0x1u <<  1) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P2               (0x1u <<  2) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P3               (0x1u <<  3) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P4               (0x1u <<  4) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P5               (0x1u <<  5) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P6               (0x1u <<  6) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P7               (0x1u <<  7) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P8               (0x1u <<  8) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P9               (0x1u <<  9) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P10              (0x1u << 10) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P11              (0x1u << 11) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P12              (0x1u << 12) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P13              (0x1u << 13) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P14              (0x1u << 14) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P15              (0x1u << 15) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P16              (0x1u << 16) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P17              (0x1u << 17) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P18              (0x1u << 18) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P19              (0x1u << 19) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P20              (0x1u << 20) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P21              (0x1u << 21) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P22              (0x1u << 22) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P23              (0x1u << 23) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P24              (0x1u << 24) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P25              (0x1u << 25) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P26              (0x1u << 26) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P27              (0x1u << 27) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P28              (0x1u << 28) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P29              (0x1u << 29) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P30              (0x1u << 30) /**< \brief (GPIO_LOCKC) Lock State */
#define GPIO_LOCKC_P31              (0x1u << 31) /**< \brief (GPIO_LOCKC) Lock State */
/* -------- GPIO_LOCKT : (GPIO Offset: 0x1AC) Port Lock Register - Toggle -------- */
#define GPIO_LOCKT_P0               (0x1u <<  0) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P1               (0x1u <<  1) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P2               (0x1u <<  2) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P3               (0x1u <<  3) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P4               (0x1u <<  4) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P5               (0x1u <<  5) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P6               (0x1u <<  6) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P7               (0x1u <<  7) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P8               (0x1u <<  8) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P9               (0x1u <<  9) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P10              (0x1u << 10) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P11              (0x1u << 11) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P12              (0x1u << 12) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P13              (0x1u << 13) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P14              (0x1u << 14) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P15              (0x1u << 15) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P16              (0x1u << 16) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P17              (0x1u << 17) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P18              (0x1u << 18) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P19              (0x1u << 19) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P20              (0x1u << 20) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P21              (0x1u << 21) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P22              (0x1u << 22) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P23              (0x1u << 23) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P24              (0x1u << 24) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P25              (0x1u << 25) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P26              (0x1u << 26) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P27              (0x1u << 27) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P28              (0x1u << 28) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P29              (0x1u << 29) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P30              (0x1u << 30) /**< \brief (GPIO_LOCKT) Lock State */
#define GPIO_LOCKT_P31              (0x1u << 31) /**< \brief (GPIO_LOCKT) Lock State */
/* -------- GPIO_UNLOCK : (GPIO Offset: 0x1E0) Port Unlock Register -------- */
#define GPIO_UNLOCK_OFFSET_Pos      0
#define GPIO_UNLOCK_OFFSET_Msk      (0x3FFu << GPIO_UNLOCK_OFFSET_Pos) /**< \brief (GPIO_UNLOCK) Offset Register */
#define GPIO_UNLOCK_OFFSET(value)   ((GPIO_UNLOCK_OFFSET_Msk & ((value) << GPIO_UNLOCK_OFFSET_Pos)))
#define GPIO_UNLOCK_KEY_Pos         24
