Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_UNLOCK_KEY_Msk         (0xFFu << GPIO_UNLOCK_KEY_Pos) /**< \brief (GPIO_UNLOCK) Unlocking Key */
#define GPIO_UNLOCK_KEY(value)      ((GPIO_UNLOCK_KEY_Msk & ((value) << GPIO_UNLOCK_KEY_Pos)))
/* -------- GPIO_ASR : (GPIO Offset: 0x1E4) Port Access Status Register -------- */
#define GPIO_ASR_AR                 (0x1u <<  0) /**< \brief (GPIO_ASR) Access Error */
/* -------- GPIO_PARAMETER : (GPIO Offset: 0x1F8) Port Parameter Register -------- */
#define GPIO_PARAMETER_PARAMETER_Pos    0
#define GPIO_PARAMETER_PARAMETER_Msk    (0xFFFFFFFFu << GPIO_PARAMETER_PARAMETER_Pos) /**< \brief (GPIO_PARAMETER) Parameter */
#define GPIO_PARAMETER_PARAMETER(value) ((GPIO_PARAMETER_PARAMETER_Msk & ((value) << GPIO_PARAMETER_PARAMETER_Pos)))
/* -------- GPIO_VERSION : (GPIO Offset: 0x1FC) Port Version Register -------- */
#define GPIO_VERSION_VERSION_Pos    0
#define GPIO_VERSION_VERSION_Msk    (0xFFFu << GPIO_VERSION_VERSION_Pos) /**< \brief (GPIO_VERSION) Version Number */
#define GPIO_VERSION_VERSION(value) ((GPIO_VERSION_VERSION_Msk & ((value) << GPIO_VERSION_VERSION_Pos)))
#define GPIO_VERSION_VARIANT_Pos    16
#define GPIO_VERSION_VARIANT_Msk    (0xFu << GPIO_VERSION_VARIANT_Pos) /**< \brief (GPIO_VERSION) Variant Number */
#define GPIO_VERSION_VARIANT(value) ((GPIO_VERSION_VARIANT_Msk & ((value) << GPIO_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR HCACHE */
/* ============================================================================= */
/** \addtogroup SAM4L4_HCACHE Cortex M I&D Cache Controller */
/*@{*/

#define REV_HCACHE     0x101

#ifndef __ASSEMBLY__
/** \brief HCACHE hardware registers */
typedef struct {
  RoReg   Reserved1[2];
  WoReg   CTRL;        /**< \brief (HCACHE Offset: 0x08) Control Register */
  RwReg   SR;          /**< \brief (HCACHE Offset: 0x0C) Status Register */
  RoReg   Reserved2[4];
  WoReg   MAINT0;      /**< \brief (HCACHE Offset: 0x20) Maintenance Register 0 */
  WoReg   MAINT1;      /**< \brief (HCACHE Offset: 0x24) Maintenance Register 1 */
  RwReg   MCFG;        /**< \brief (HCACHE Offset: 0x28) Monitor Configuration Register */
  RwReg   MEN;         /**< \brief (HCACHE Offset: 0x2C) Monitor Enable Register */
  WoReg   MCTRL;       /**< \brief (HCACHE Offset: 0x30) Monitor Control Register */
  RoReg   MSR;         /**< \brief (HCACHE Offset: 0x34) Monitor Status Register */
  RoReg   Reserved3[49];
  RoReg   VERSION;     /**< \brief (HCACHE Offset: 0xFC) Version Register */
} Hcache;
#endif /* __ASSEMBLY__ */
/* -------- HCACHE_CTRL : (HCACHE Offset: 0x08) Control Register -------- */
#define HCACHE_CTRL_CEN             (0x1u <<  0) /**< \brief (HCACHE_CTRL) Cache Enable */
#define   HCACHE_CTRL_CEN_NO        (0x0u <<  0) /**< \brief (HCACHE_CTRL) Disable Cache Controller */
#define   HCACHE_CTRL_CEN_YES       (0x1u <<  0) /**< \brief (HCACHE_CTRL) Enable Cache Controller */
/* -------- HCACHE_SR : (HCACHE Offset: 0x0C) Status Register -------- */
#define HCACHE_SR_CSTS              (0x1u <<  0) /**< \brief (HCACHE_SR) Cache Controller Status */
#define   HCACHE_SR_CSTS_DIS        (0x0u <<  0) /**< \brief (HCACHE_SR) Cache Controller Disabled */
#define   HCACHE_SR_CSTS_EN         (0x1u <<  0) /**< \brief (HCACHE_SR) Cache Controller Enabled */
/* -------- HCACHE_MAINT0 : (HCACHE Offset: 0x20) Maintenance Register 0 -------- */
#define HCACHE_MAINT0_INVALL        (0x1u <<  0) /**< \brief (HCACHE_MAINT0) Cache Controller Invalidate All */
#define   HCACHE_MAINT0_INVALL_NO   (0x0u <<  0) /**< \brief (HCACHE_MAINT0) No effect */
#define   HCACHE_MAINT0_INVALL_YES  (0x1u <<  0) /**< \brief (HCACHE_MAINT0) Invalidate all cache entries */
/* -------- HCACHE_MAINT1 : (HCACHE Offset: 0x24) Maintenance Register 1 -------- */
#define HCACHE_MAINT1_INDEX_Pos     4
#define HCACHE_MAINT1_INDEX_Msk     (0xFu << HCACHE_MAINT1_INDEX_Pos) /**< \brief (HCACHE_MAINT1) Invalidate Index */
#define HCACHE_MAINT1_INDEX(value)  ((HCACHE_MAINT1_INDEX_Msk & ((value) << HCACHE_MAINT1_INDEX_Pos)))
/* -------- HCACHE_MCFG : (HCACHE Offset: 0x28) Monitor Configuration Register -------- */
#define HCACHE_MCFG_MODE_Pos        0
#define HCACHE_MCFG_MODE_Msk        (0x3u << HCACHE_MCFG_MODE_Pos) /**< \brief (HCACHE_MCFG) Cache Controller Monitor Counter Mode */
#define HCACHE_MCFG_MODE(value)     ((HCACHE_MCFG_MODE_Msk & ((value) << HCACHE_MCFG_MODE_Pos)))
#define   HCACHE_MCFG_MODE_CYCLE    (0x0u <<  0) /**< \brief (HCACHE_MCFG) Cycle Counter */
#define   HCACHE_MCFG_MODE_IHIT     (0x1u <<  0) /**< \brief (HCACHE_MCFG) Instruction Hit Counter */
#define   HCACHE_MCFG_MODE_DHIT     (0x2u <<  0) /**< \brief (HCACHE_MCFG) Data Hit Counter */
/* -------- HCACHE_MEN : (HCACHE Offset: 0x2C) Monitor Enable Register -------- */
#define HCACHE_MEN_MENABLE          (0x1u <<  0) /**< \brief (HCACHE_MEN) Monitor Enable */
#define   HCACHE_MEN_MENABLE_DIS    (0x0u <<  0) /**< \brief (HCACHE_MEN) Disable Monitor Counter */
#define   HCACHE_MEN_MENABLE_EN     (0x1u <<  0) /**< \brief (HCACHE_MEN) Enable Monitor Counter */
/* -------- HCACHE_MCTRL : (HCACHE Offset: 0x30) Monitor Control Register -------- */
#define HCACHE_MCTRL_SWRST          (0x1u <<  0) /**< \brief (HCACHE_MCTRL) Monitor Software Reset */
#define   HCACHE_MCTRL_SWRST_NO     (0x0u <<  0) /**< \brief (HCACHE_MCTRL) No effect */
#define   HCACHE_MCTRL_SWRST_YES    (0x1u <<  0) /**< \brief (HCACHE_MCTRL) Reset event counter register */
/* -------- HCACHE_MSR : (HCACHE Offset: 0x34) Monitor Status Register -------- */
#define HCACHE_MSR_EVENTCNT_Pos     0
#define HCACHE_MSR_EVENTCNT_Msk     (0xFFFFFFFFu << HCACHE_MSR_EVENTCNT_Pos) /**< \brief (HCACHE_MSR) Monitor Event Counter */
#define HCACHE_MSR_EVENTCNT(value)  ((HCACHE_MSR_EVENTCNT_Msk & ((value) << HCACHE_MSR_EVENTCNT_Pos)))
/* -------- HCACHE_VERSION : (HCACHE Offset: 0xFC) Version Register -------- */
#define HCACHE_VERSION_VERSION_Pos    0
#define HCACHE_VERSION_VERSION_Msk    (0xFFFu << HCACHE_VERSION_VERSION_Pos) /**< \brief (HCACHE_VERSION) VERSION */
#define HCACHE_VERSION_VERSION(value) ((HCACHE_VERSION_VERSION_Msk & ((value) << HCACHE_VERSION_VERSION_Pos)))
#define HCACHE_VERSION_MFN_Pos      16
#define HCACHE_VERSION_MFN_Msk      (0xFu << HCACHE_VERSION_MFN_Pos) /**< \brief (HCACHE_VERSION) MFN */
#define HCACHE_VERSION_MFN(value)   ((HCACHE_VERSION_MFN_Msk & ((value) << HCACHE_VERSION_MFN_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR HMATRIXB */
/* ============================================================================= */
/** \addtogroup SAM4L4_HMATRIXB HSB Matrix */
/*@{*/

