Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief IISC hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (IISC Offset: 0x00) Control Register */
  RwReg   MR;          /**< \brief (IISC Offset: 0x04) Mode Register */
  RoReg   SR;          /**< \brief (IISC Offset: 0x08) Status Register */
  WoReg   SCR;         /**< \brief (IISC Offset: 0x0C) Status Clear Register */
  WoReg   SSR;         /**< \brief (IISC Offset: 0x10) Status Set Register */
  WoReg   IER;         /**< \brief (IISC Offset: 0x14) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (IISC Offset: 0x18) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (IISC Offset: 0x1C) Interrupt Mask Register */
  RoReg   RHR;         /**< \brief (IISC Offset: 0x20) Receive Holding Register */
  WoReg   THR;         /**< \brief (IISC Offset: 0x24) Transmit Holding Register */
  RoReg   VERSION;     /**< \brief (IISC Offset: 0x28) Version Register */
  RoReg   PARAMETER;   /**< \brief (IISC Offset: 0x2C) Parameter Register */
} Iisc;
#endif /* __ASSEMBLY__ */
/* -------- IISC_CR : (IISC Offset: 0x00) Control Register -------- */
#define IISC_CR_RXEN                (0x1u <<  0) /**< \brief (IISC_CR) Receive Enable */
#define   IISC_CR_RXEN_OFF          (0x0u <<  0) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_RXEN_ON           (0x1u <<  0) /**< \brief (IISC_CR) Enables Data Receive if RXDIS is not set */
#define IISC_CR_RXDIS               (0x1u <<  1) /**< \brief (IISC_CR) Receive Disable */
#define   IISC_CR_RXDIS_OFF         (0x0u <<  1) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_RXDIS_ON          (0x1u <<  1) /**< \brief (IISC_CR) Disables Data Receive */
#define IISC_CR_CKEN                (0x1u <<  2) /**< \brief (IISC_CR) Clocks Enable */
#define   IISC_CR_CKEN_OFF          (0x0u <<  2) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_CKEN_ON           (0x1u <<  2) /**< \brief (IISC_CR) Enables clocks if CKDIS is not set */
#define IISC_CR_CKDIS               (0x1u <<  3) /**< \brief (IISC_CR) Clocks Disable */
#define   IISC_CR_CKDIS_OFF         (0x0u <<  3) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_CKDIS_ON          (0x1u <<  3) /**< \brief (IISC_CR) Disables clocks */
#define IISC_CR_TXEN                (0x1u <<  4) /**< \brief (IISC_CR) Transmit Enable */
#define   IISC_CR_TXEN_OFF          (0x0u <<  4) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_TXEN_ON           (0x1u <<  4) /**< \brief (IISC_CR) Enables Data Transmit if TXDIS is not set */
#define IISC_CR_TXDIS               (0x1u <<  5) /**< \brief (IISC_CR) Transmit Disable */
#define   IISC_CR_TXDIS_OFF         (0x0u <<  5) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_TXDIS_ON          (0x1u <<  5) /**< \brief (IISC_CR) Disables Data Transmit */
#define IISC_CR_SWRST               (0x1u <<  7) /**< \brief (IISC_CR) Software Reset */
#define   IISC_CR_SWRST_OFF         (0x0u <<  7) /**< \brief (IISC_CR) No effect */
#define   IISC_CR_SWRST_ON          (0x1u <<  7) /**< \brief (IISC_CR) Performs a software reset. Has priority on any other bit in CR */
/* -------- IISC_MR : (IISC Offset: 0x04) Mode Register -------- */
#define IISC_MR_MODE                (0x1u <<  0) /**< \brief (IISC_MR) Master/Slave/Controller Mode */
#define   IISC_MR_MODE_SLAVE        (0x0u <<  0) /**< \brief (IISC_MR) Slave mode (only serial data handled, clocks received from external master or controller) */
#define   IISC_MR_MODE_MASTER       (0x1u <<  0) /**< \brief (IISC_MR) Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1) */
#define IISC_MR_DATALENGTH_Pos      2
#define IISC_MR_DATALENGTH_Msk      (0x7u << IISC_MR_DATALENGTH_Pos) /**< \brief (IISC_MR) Data Word Length */
#define IISC_MR_DATALENGTH(value)   ((IISC_MR_DATALENGTH_Msk & ((value) << IISC_MR_DATALENGTH_Pos)))
#define   IISC_MR_DATALENGTH_32     (0x0u <<  2) /**< \brief (IISC_MR) 32 bits */
#define   IISC_MR_DATALENGTH_24     (0x1u <<  2) /**< \brief (IISC_MR) 24 bits */
#define   IISC_MR_DATALENGTH_20     (0x2u <<  2) /**< \brief (IISC_MR) 20 bits */
#define   IISC_MR_DATALENGTH_18     (0x3u <<  2) /**< \brief (IISC_MR) 18 bits */
#define   IISC_MR_DATALENGTH_16     (0x4u <<  2) /**< \brief (IISC_MR) 16 bits */
#define   IISC_MR_DATALENGTH_16C    (0x5u <<  2) /**< \brief (IISC_MR) 16 bits compact stereo */
#define   IISC_MR_DATALENGTH_8      (0x6u <<  2) /**< \brief (IISC_MR) 8 bits */
#define   IISC_MR_DATALENGTH_8C     (0x7u <<  2) /**< \brief (IISC_MR) 8 bits compact stereo */
#define IISC_MR_RXMONO              (0x1u <<  8) /**< \brief (IISC_MR) Receiver Mono */
#define   IISC_MR_RXMONO_STEREO     (0x0u <<  8) /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXMONO_MONO       (0x1u <<  8) /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_RXDMA               (0x1u <<  9) /**< \brief (IISC_MR) Single or Multiple DMA Channels for Receiver */
#define   IISC_MR_RXDMA_SINGLE      (0x0u <<  9) /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_RXDMA_MULTIPLE    (0x1u <<  9) /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_RXLOOP              (0x1u << 10) /**< \brief (IISC_MR) Loop-back Test Mode */
#define   IISC_MR_RXLOOP_OFF        (0x0u << 10) /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_RXLOOP_ON         (0x1u << 10) /**< \brief (IISC_MR) ISDO internally connected to ISDI */
#define IISC_MR_TXMONO              (0x1u << 12) /**< \brief (IISC_MR) Transmitter Mono */
#define   IISC_MR_TXMONO_STEREO     (0x0u << 12) /**< \brief (IISC_MR) Normal mode */
#define   IISC_MR_TXMONO_MONO       (0x1u << 12) /**< \brief (IISC_MR) Left channel data is duplicated to right channel */
#define IISC_MR_TXDMA               (0x1u << 13) /**< \brief (IISC_MR) Single or Multiple DMA Channels for Transmitter */
#define   IISC_MR_TXDMA_SINGLE      (0x0u << 13) /**< \brief (IISC_MR) Single DMA channel */
#define   IISC_MR_TXDMA_MULTIPLE    (0x1u << 13) /**< \brief (IISC_MR) One DMA channel per data channel */
#define IISC_MR_TXSAME              (0x1u << 14) /**< \brief (IISC_MR) Transmit Data when Underrun */
#define   IISC_MR_TXSAME_ZERO       (0x0u << 14) /**< \brief (IISC_MR) Zero data transmitted in case of underrun */
#define   IISC_MR_TXSAME_SAME       (0x1u << 14) /**< \brief (IISC_MR) Last data transmitted in case of underrun */
#define IISC_MR_IMCKFS_Pos          24
#define IISC_MR_IMCKFS_Msk          (0x3Fu << IISC_MR_IMCKFS_Pos) /**< \brief (IISC_MR) Master Clock to fs Ratio */
#define IISC_MR_IMCKFS(value)       ((IISC_MR_IMCKFS_Msk & ((value) << IISC_MR_IMCKFS_Pos)))
#define   IISC_MR_IMCKFS_16         (0x0u << 24) /**< \brief (IISC_MR) 16 fs */
#define   IISC_MR_IMCKFS_32         (0x1u << 24) /**< \brief (IISC_MR) 32 fs */
#define   IISC_MR_IMCKFS_64         (0x3u << 24) /**< \brief (IISC_MR) 64 fs */
#define   IISC_MR_IMCKFS_128        (0x7u << 24) /**< \brief (IISC_MR) 128 fs */
#define   IISC_MR_IMCKFS_256        (0xFu << 24) /**< \brief (IISC_MR) 256 fs */
#define   IISC_MR_IMCKFS_384        (0x17u << 24) /**< \brief (IISC_MR) 384 fs */
#define   IISC_MR_IMCKFS_512        (0x1Fu << 24) /**< \brief (IISC_MR) 512 fs */
#define   IISC_MR_IMCKFS_768        (0x2Fu << 24) /**< \brief (IISC_MR) 768 fs */
#define   IISC_MR_IMCKFS_1024       (0x3Fu << 24) /**< \brief (IISC_MR) 1024 fs */
#define IISC_MR_IMCKMODE            (0x1u << 30) /**< \brief (IISC_MR) Master Clock Mode */
#define   IISC_MR_IMCKMODE_NO_IMCK  (0x0u << 30) /**< \brief (IISC_MR) No IMCK generated */
#define   IISC_MR_IMCKMODE_IMCK     (0x1u << 30) /**< \brief (IISC_MR) IMCK generated */
#define IISC_MR_IWS24               (0x1u << 31) /**< \brief (IISC_MR) IWS Data Slot Width */
#define   IISC_MR_IWS24_32          (0x0u << 31) /**< \brief (IISC_MR) IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit */
#define   IISC_MR_IWS24_24          (0x1u << 31) /**< \brief (IISC_MR) IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit */
/* -------- IISC_SR : (IISC Offset: 0x08) Status Register -------- */
#define IISC_SR_RXEN                (0x1u <<  0) /**< \brief (IISC_SR) Receive Enable */
#define   IISC_SR_RXEN_OFF          (0x0u <<  0) /**< \brief (IISC_SR) Receiver is effectively disabled, following a CR.RXDIS or CR.SWRST request */
#define   IISC_SR_RXEN_ON           (0x1u <<  0) /**< \brief (IISC_SR) Receiver is effectively enabled, following a CR.RXEN request */
#define IISC_SR_RXRDY               (0x1u <<  1) /**< \brief (IISC_SR) Receive Ready */
#define   IISC_SR_RXRDY_EMPTY       (0x0u <<  1) /**< \brief (IISC_SR) The register RHR is empty and can't be read */
#define   IISC_SR_RXRDY_FULL        (0x1u <<  1) /**< \brief (IISC_SR) The register RHR is full and is ready to be read */
#define IISC_SR_RXOR                (0x1u <<  2) /**< \brief (IISC_SR) Receive Overrun */
#define   IISC_SR_RXOR_NO           (0x0u <<  2) /**< \brief (IISC_SR) No overrun */
#define   IISC_SR_RXOR_YES          (0x1u <<  2) /**< \brief (IISC_SR) The previous received data has not been read. This data is lost */
#define IISC_SR_TXEN                (0x1u <<  4) /**< \brief (IISC_SR) Transmit Enable */
#define   IISC_SR_TXEN_OFF          (0x0u <<  4) /**< \brief (IISC_SR) Transmitter is effectively disabled, following a CR.TXDIS or CR.SWRST request */
#define   IISC_SR_TXEN_ON           (0x1u <<  4) /**< \brief (IISC_SR) Transmitter is effectively enabled, following a CR.TXEN request */
#define IISC_SR_TXRDY               (0x1u <<  5) /**< \brief (IISC_SR) Transmit Ready */
#define   IISC_SR_TXRDY_FULL        (0x0u <<  5) /**< \brief (IISC_SR) The register THR is full and can't be written */
#define   IISC_SR_TXRDY_EMPTY       (0x1u <<  5) /**< \brief (IISC_SR) The register THR is empty and is ready to be written */
#define IISC_SR_TXUR                (0x1u <<  6) /**< \brief (IISC_SR) Transmit Underrun */
#define   IISC_SR_TXUR_NO           (0x0u <<  6) /**< \brief (IISC_SR) No underrun */
#define   IISC_SR_TXUR_YES          (0x1u <<  6) /**< \brief (IISC_SR) The last bit of the last data written to the register THR has been set. Until the next write to THR, data will be sent according to MR.TXSAME field */
#define IISC_SR_RXORCH_Pos          8
#define IISC_SR_RXORCH_Msk          (0x3u << IISC_SR_RXORCH_Pos) /**< \brief (IISC_SR) Receive Overrun Channels */
#define IISC_SR_RXORCH(value)       ((IISC_SR_RXORCH_Msk & ((value) << IISC_SR_RXORCH_Pos)))
#define   IISC_SR_RXORCH_LEFT       (0x0u <<  8) /**< \brief (IISC_SR) Overrun first occurred on left channel */
#define   IISC_SR_RXORCH_RIGHT      (0x1u <<  8) /**< \brief (IISC_SR) Overrun first occurred on right channel */
#define IISC_SR_TXURCH_Pos          20
#define IISC_SR_TXURCH_Msk          (0x3u << IISC_SR_TXURCH_Pos) /**< \brief (IISC_SR) Transmit Underrun Channels */
#define IISC_SR_TXURCH(value)       ((IISC_SR_TXURCH_Msk & ((value) << IISC_SR_TXURCH_Pos)))
#define   IISC_SR_TXURCH_LEFT       (0x0u << 20) /**< \brief (IISC_SR) Underrun first occurred on left channel */
#define   IISC_SR_TXURCH_RIGHT      (0x1u << 20) /**< \brief (IISC_SR) Underrun first occurred on right channel */
/* -------- IISC_SCR : (IISC Offset: 0x0C) Status Clear Register -------- */
#define IISC_SCR_RXOR               (0x1u <<  2) /**< \brief (IISC_SCR) Receive Overrun */
#define   IISC_SCR_RXOR_NO          (0x0u <<  2) /**< \brief (IISC_SCR) No effect */
#define   IISC_SCR_RXOR_CLEAR       (0x1u <<  2) /**< \brief (IISC_SCR) Clears the corresponding SR bit */
#define IISC_SCR_TXUR               (0x1u <<  6) /**< \brief (IISC_SCR) Transmit Underrun */
#define   IISC_SCR_TXUR_NO          (0x0u <<  6) /**< \brief (IISC_SCR) No effect */
#define   IISC_SCR_TXUR_CLEAR       (0x1u <<  6) /**< \brief (IISC_SCR) Clears the corresponding SR bit */
#define IISC_SCR_RXORCH_Pos         8
#define IISC_SCR_RXORCH_Msk         (0x3u << IISC_SCR_RXORCH_Pos) /**< \brief (IISC_SCR) Receive Overrun Channels */
#define IISC_SCR_RXORCH(value)      ((IISC_SCR_RXORCH_Msk & ((value) << IISC_SCR_RXORCH_Pos)))
#define IISC_SCR_TXURCH_Pos         20
#define IISC_SCR_TXURCH_Msk         (0x3u << IISC_SCR_TXURCH_Pos) /**< \brief (IISC_SCR) Transmit Underrun Channels */
#define IISC_SCR_TXURCH(value)      ((IISC_SCR_TXURCH_Msk & ((value) << IISC_SCR_TXURCH_Pos)))
/* -------- IISC_SSR : (IISC Offset: 0x10) Status Set Register -------- */
#define IISC_SSR_RXOR               (0x1u <<  2) /**< \brief (IISC_SSR) Receive Overrun */
#define   IISC_SSR_RXOR_NO          (0x0u <<  2) /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_RXOR_SET         (0x1u <<  2) /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_TXUR               (0x1u <<  6) /**< \brief (IISC_SSR) Transmit Underrun */
#define   IISC_SSR_TXUR_NO          (0x0u <<  6) /**< \brief (IISC_SSR) No effect */
#define   IISC_SSR_TXUR_SET         (0x1u <<  6) /**< \brief (IISC_SSR) Sets corresponding SR bit */
#define IISC_SSR_RXORCH_Pos         8
#define IISC_SSR_RXORCH_Msk         (0x3u << IISC_SSR_RXORCH_Pos) /**< \brief (IISC_SSR) Receive Overrun Channels */
#define IISC_SSR_RXORCH(value)      ((IISC_SSR_RXORCH_Msk & ((value) << IISC_SSR_RXORCH_Pos)))
#define IISC_SSR_TXURCH_Pos         20
#define IISC_SSR_TXURCH_Msk         (0x3u << IISC_SSR_TXURCH_Pos) /**< \brief (IISC_SSR) Transmit Underrun Channels */
#define IISC_SSR_TXURCH(value)      ((IISC_SSR_TXURCH_Msk & ((value) << IISC_SSR_TXURCH_Pos)))
/* -------- IISC_IER : (IISC Offset: 0x14) Interrupt Enable Register -------- */
#define IISC_IER_RXRDY              (0x1u <<  1) /**< \brief (IISC_IER) Receiver Ready Interrupt Enable */
#define   IISC_IER_RXRDY_OFF        (0x0u <<  1) /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXRDY_ON         (0x1u <<  1) /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_RXOR               (0x1u <<  2) /**< \brief (IISC_IER) Receive Overrun Interrupt Enable */
#define   IISC_IER_RXOR_OFF         (0x0u <<  2) /**< \brief (IISC_IER) No effect */
#define   IISC_IER_RXOR_ON          (0x1u <<  2) /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXRDY              (0x1u <<  5) /**< \brief (IISC_IER) Transmit Ready Interrupt Enable */
#define   IISC_IER_TXRDY_OFF        (0x0u <<  5) /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXRDY_ON         (0x1u <<  5) /**< \brief (IISC_IER) Enables the corresponding interrupt */
#define IISC_IER_TXUR               (0x1u <<  6) /**< \brief (IISC_IER) Transmit Underrun Interrupt Enable */
#define   IISC_IER_TXUR_OFF         (0x0u <<  6) /**< \brief (IISC_IER) No effect */
#define   IISC_IER_TXUR_ON          (0x1u <<  6) /**< \brief (IISC_IER) Enables the corresponding interrupt */
/* -------- IISC_IDR : (IISC Offset: 0x18) Interrupt Disable Register -------- */
#define IISC_IDR_RXRDY              (0x1u <<  1) /**< \brief (IISC_IDR) Receive Ready Interrupt Disable */
#define   IISC_IDR_RXRDY_OFF        (0x0u <<  1) /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXRDY_ON         (0x1u <<  1) /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_RXOR               (0x1u <<  2) /**< \brief (IISC_IDR) Receive Overrun Interrupt Disable */
#define   IISC_IDR_RXOR_OFF         (0x0u <<  2) /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_RXOR_ON          (0x1u <<  2) /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXRDY              (0x1u <<  5) /**< \brief (IISC_IDR) Transmit Ready Interrupt Disable */
#define   IISC_IDR_TXRDY_OFF        (0x0u <<  5) /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXRDY_ON         (0x1u <<  5) /**< \brief (IISC_IDR) Disables the corresponding interrupt */
#define IISC_IDR_TXUR               (0x1u <<  6) /**< \brief (IISC_IDR) Transmit Underrun Interrupt Disable */
#define   IISC_IDR_TXUR_OFF         (0x0u <<  6) /**< \brief (IISC_IDR) No effect */
#define   IISC_IDR_TXUR_ON          (0x1u <<  6) /**< \brief (IISC_IDR) Disables the corresponding interrupt */
/* -------- IISC_IMR : (IISC Offset: 0x1C) Interrupt Mask Register -------- */
#define IISC_IMR_RXRDY              (0x1u <<  1) /**< \brief (IISC_IMR) Receive Ready Interrupt Mask */
#define   IISC_IMR_RXRDY_DISABLED   (0x0u <<  1) /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_RXRDY_ENABLED    (0x1u <<  1) /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_RXOR               (0x1u <<  2) /**< \brief (IISC_IMR) Receive Overrun Interrupt Mask */
#define   IISC_IMR_RXOR_DISABLED    (0x0u <<  2) /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_RXOR_ENABLED     (0x1u <<  2) /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_TXRDY              (0x1u <<  5) /**< \brief (IISC_IMR) Transmit Ready Interrupt Mask */
#define   IISC_IMR_TXRDY_DISABLED   (0x0u <<  5) /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_TXRDY_ENABLED    (0x1u <<  5) /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
#define IISC_IMR_TXUR               (0x1u <<  6) /**< \brief (IISC_IMR) Transmit Underrun Interrupt Mask */
#define   IISC_IMR_TXUR_DISABLED    (0x0u <<  6) /**< \brief (IISC_IMR) The corresponding interrupt is disabled */
#define   IISC_IMR_TXUR_ENABLED     (0x1u <<  6) /**< \brief (IISC_IMR) The corresponding interrupt is enabled */
/* -------- IISC_RHR : (IISC Offset: 0x20) Receive Holding Register -------- */
#define IISC_RHR_RDAT_Pos           0
#define IISC_RHR_RDAT_Msk           (0xFFFFFFFFu << IISC_RHR_RDAT_Pos) /**< \brief (IISC_RHR) Receive Data */
#define IISC_RHR_RDAT(value)        ((IISC_RHR_RDAT_Msk & ((value) << IISC_RHR_RDAT_Pos)))
/* -------- IISC_THR : (IISC Offset: 0x24) Transmit Holding Register -------- */
#define IISC_THR_TDAT_Pos           0
#define IISC_THR_TDAT_Msk           (0xFFFFFFFFu << IISC_THR_TDAT_Pos) /**< \brief (IISC_THR) Transmit Data */
#define IISC_THR_TDAT(value)        ((IISC_THR_TDAT_Msk & ((value) << IISC_THR_TDAT_Pos)))
/* -------- IISC_VERSION : (IISC Offset: 0x28) Version Register -------- */
#define IISC_VERSION_VERSION_Pos    0
#define IISC_VERSION_VERSION_Msk    (0xFFFu << IISC_VERSION_VERSION_Pos) /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. This is the Atmel internal version of the macrocell. */
#define IISC_VERSION_VERSION(value) ((IISC_VERSION_VERSION_Msk & ((value) << IISC_VERSION_VERSION_Pos)))
#define IISC_VERSION_VARIANT_Pos    16
#define IISC_VERSION_VARIANT_Msk    (0xFu << IISC_VERSION_VARIANT_Pos) /**< \brief (IISC_VERSION) Reserved. Value subject to change. No functionality associated. */
#define IISC_VERSION_VARIANT(value) ((IISC_VERSION_VARIANT_Msk & ((value) << IISC_VERSION_VARIANT_Pos)))
/* -------- IISC_PARAMETER : (IISC Offset: 0x2C) Parameter Register -------- */
#define IISC_PARAMETER_FORMAT       (0x1u <<  7) /**< \brief (IISC_PARAMETER) Data protocol format */
#define   IISC_PARAMETER_FORMAT_I2S (0x0u <<  7) /**< \brief (IISC_PARAMETER) I2S format, stereo with IWS low for left channel */
#define IISC_PARAMETER_NBCHAN_Pos    16
#define IISC_PARAMETER_NBCHAN_Msk    (0x1Fu << IISC_PARAMETER_NBCHAN_Pos) /**< \brief (IISC_PARAMETER) Maximum number of channels - 1 */
#define IISC_PARAMETER_NBCHAN(value) ((IISC_PARAMETER_NBCHAN_Msk & ((value) << IISC_PARAMETER_NBCHAN_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR LCDCA */
/* ============================================================================= */
/** \addtogroup SAM4L4_LCDCA LCD Controller */
/*@{*/

#define REV_LCDCA      0x100

