Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief LCDCA hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (LCDCA Offset: 0x00) Control Register */
  RwReg   CFG;         /**< \brief (LCDCA Offset: 0x04) Configuration Register */
  RwReg   TIM;         /**< \brief (LCDCA Offset: 0x08) Timing Register */
  RoReg   SR;          /**< \brief (LCDCA Offset: 0x0C) Status Register */
  WoReg   SCR;         /**< \brief (LCDCA Offset: 0x10) Status Clear Register */
  RwReg   DRL0;        /**< \brief (LCDCA Offset: 0x14) Data Register Low 0 */
  RwReg   DRH0;        /**< \brief (LCDCA Offset: 0x18) Data Register High 0 */
  RwReg   DRL1;        /**< \brief (LCDCA Offset: 0x1C) Data Register Low 1 */
  RwReg   DRH1;        /**< \brief (LCDCA Offset: 0x20) Data Register High 1 */
  RwReg   DRL2;        /**< \brief (LCDCA Offset: 0x24) Data Register Low 2 */
  RwReg   DRH2;        /**< \brief (LCDCA Offset: 0x28) Data Register High 2 */
  RwReg   DRL3;        /**< \brief (LCDCA Offset: 0x2C) Data Register Low 3 */
  RwReg   DRH3;        /**< \brief (LCDCA Offset: 0x30) Data Register High 3 */
  WoReg   IADR;        /**< \brief (LCDCA Offset: 0x34) Indirect Access Data Register */
  RwReg   BCFG;        /**< \brief (LCDCA Offset: 0x38) Blink Configuration Register */
  RwReg   CSRCFG;      /**< \brief (LCDCA Offset: 0x3C) Circular Shift Register Configuration */
  RwReg   CMCFG;       /**< \brief (LCDCA Offset: 0x40) Character Mapping Configuration Register */
  WoReg   CMDR;        /**< \brief (LCDCA Offset: 0x44) Character Mapping Data Register */
  RwReg   ACMCFG;      /**< \brief (LCDCA Offset: 0x48) Automated Character Mapping Configuration Register */
  WoReg   ACMDR;       /**< \brief (LCDCA Offset: 0x4C) Automated Character Mapping Data Register */
  RwReg   ABMCFG;      /**< \brief (LCDCA Offset: 0x50) Automated Bit Mapping Configuration Register */
  WoReg   ABMDR;       /**< \brief (LCDCA Offset: 0x54) Automated Bit Mapping Data Register */
  WoReg   IER;         /**< \brief (LCDCA Offset: 0x58) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (LCDCA Offset: 0x5C) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (LCDCA Offset: 0x60) Interrupt Mask Register */
  RoReg   VERSION;     /**< \brief (LCDCA Offset: 0x64) Version Register */
} Lcdca;
#endif /* __ASSEMBLY__ */
/* -------- LCDCA_CR : (LCDCA Offset: 0x00) Control Register -------- */
#define LCDCA_CR_DIS                (0x1u <<  0) /**< \brief (LCDCA_CR) Disable */
#define LCDCA_CR_EN                 (0x1u <<  1) /**< \brief (LCDCA_CR) Enable */
#define LCDCA_CR_FC0DIS             (0x1u <<  2) /**< \brief (LCDCA_CR) Frame Counter 0 Disable */
#define LCDCA_CR_FC0EN              (0x1u <<  3) /**< \brief (LCDCA_CR) Frame Counter 0 Enable */
#define LCDCA_CR_FC1DIS             (0x1u <<  4) /**< \brief (LCDCA_CR) Frame Counter 1 Disable */
#define LCDCA_CR_FC1EN              (0x1u <<  5) /**< \brief (LCDCA_CR) Frame Counter 1 Enable */
#define LCDCA_CR_FC2DIS             (0x1u <<  6) /**< \brief (LCDCA_CR) Frame Counter 2 Disable */
#define LCDCA_CR_FC2EN              (0x1u <<  7) /**< \brief (LCDCA_CR) Frame Counter 2 Enable */
#define LCDCA_CR_CDM                (0x1u <<  8) /**< \brief (LCDCA_CR) Clear Display Memory */
#define LCDCA_CR_WDIS               (0x1u <<  9) /**< \brief (LCDCA_CR) Wake up Disable */
#define LCDCA_CR_WEN                (0x1u << 10) /**< \brief (LCDCA_CR) Wake up Enable */
#define LCDCA_CR_BSTART             (0x1u << 11) /**< \brief (LCDCA_CR) Blinking Start */
#define LCDCA_CR_BSTOP              (0x1u << 12) /**< \brief (LCDCA_CR) Blinking Stop */
#define LCDCA_CR_CSTART             (0x1u << 13) /**< \brief (LCDCA_CR) Circular Shift Start */
#define LCDCA_CR_CSTOP              (0x1u << 14) /**< \brief (LCDCA_CR) Circular Shift Stop */
/* -------- LCDCA_CFG : (LCDCA Offset: 0x04) Configuration Register -------- */
#define LCDCA_CFG_XBIAS             (0x1u <<  0) /**< \brief (LCDCA_CFG) External Bias Generation */
#define LCDCA_CFG_WMOD              (0x1u <<  1) /**< \brief (LCDCA_CFG) Waveform Mode */
#define LCDCA_CFG_BLANK             (0x1u <<  2) /**< \brief (LCDCA_CFG) Blank LCD */
#define LCDCA_CFG_LOCK              (0x1u <<  3) /**< \brief (LCDCA_CFG) Lock */
#define LCDCA_CFG_DUTY_Pos          8
#define LCDCA_CFG_DUTY_Msk          (0x3u << LCDCA_CFG_DUTY_Pos) /**< \brief (LCDCA_CFG) Duty Select */
#define LCDCA_CFG_DUTY(value)       ((LCDCA_CFG_DUTY_Msk & ((value) << LCDCA_CFG_DUTY_Pos)))
#define LCDCA_CFG_FCST_Pos          16
#define LCDCA_CFG_FCST_Msk          (0x3Fu << LCDCA_CFG_FCST_Pos) /**< \brief (LCDCA_CFG) Fine Contrast */
#define LCDCA_CFG_FCST(value)       ((LCDCA_CFG_FCST_Msk & ((value) << LCDCA_CFG_FCST_Pos)))
#define LCDCA_CFG_NSU_Pos           24
#define LCDCA_CFG_NSU_Msk           (0x3Fu << LCDCA_CFG_NSU_Pos) /**< \brief (LCDCA_CFG) Number of Segment Terminals in Use */
#define LCDCA_CFG_NSU(value)        ((LCDCA_CFG_NSU_Msk & ((value) << LCDCA_CFG_NSU_Pos)))
/* -------- LCDCA_TIM : (LCDCA Offset: 0x08) Timing Register -------- */
#define LCDCA_TIM_PRESC             (0x1u <<  0) /**< \brief (LCDCA_TIM) LCD Prescaler Select */
#define LCDCA_TIM_CLKDIV_Pos        1
#define LCDCA_TIM_CLKDIV_Msk        (0x7u << LCDCA_TIM_CLKDIV_Pos) /**< \brief (LCDCA_TIM) LCD Clock Division */
#define LCDCA_TIM_CLKDIV(value)     ((LCDCA_TIM_CLKDIV_Msk & ((value) << LCDCA_TIM_CLKDIV_Pos)))
#define LCDCA_TIM_FC0_Pos           8
#define LCDCA_TIM_FC0_Msk           (0x1Fu << LCDCA_TIM_FC0_Pos) /**< \brief (LCDCA_TIM) Frame Counter 0 */
#define LCDCA_TIM_FC0(value)        ((LCDCA_TIM_FC0_Msk & ((value) << LCDCA_TIM_FC0_Pos)))
#define LCDCA_TIM_FC0PB             (0x1u << 13) /**< \brief (LCDCA_TIM) Frame Counter 0 Prescaler Bypass */
#define LCDCA_TIM_FC1_Pos           16
#define LCDCA_TIM_FC1_Msk           (0x1Fu << LCDCA_TIM_FC1_Pos) /**< \brief (LCDCA_TIM) Frame Counter 1 */
#define LCDCA_TIM_FC1(value)        ((LCDCA_TIM_FC1_Msk & ((value) << LCDCA_TIM_FC1_Pos)))
#define LCDCA_TIM_FC2_Pos           24
#define LCDCA_TIM_FC2_Msk           (0x1Fu << LCDCA_TIM_FC2_Pos) /**< \brief (LCDCA_TIM) Frame Counter 2 */
#define LCDCA_TIM_FC2(value)        ((LCDCA_TIM_FC2_Msk & ((value) << LCDCA_TIM_FC2_Pos)))
/* -------- LCDCA_SR : (LCDCA Offset: 0x0C) Status Register -------- */
#define LCDCA_SR_FC0R               (0x1u <<  0) /**< \brief (LCDCA_SR) Frame Counter 0 Rollover */
#define LCDCA_SR_FC0S               (0x1u <<  1) /**< \brief (LCDCA_SR) Frame Counter 0 Status */
#define LCDCA_SR_FC1S               (0x1u <<  2) /**< \brief (LCDCA_SR) Frame Counter 1 Status */
#define LCDCA_SR_FC2S               (0x1u <<  3) /**< \brief (LCDCA_SR) Frame Counter 2 Status */
#define LCDCA_SR_EN                 (0x1u <<  4) /**< \brief (LCDCA_SR) LCDCA Status */
#define LCDCA_SR_WEN                (0x1u <<  5) /**< \brief (LCDCA_SR) Wake up Status */
#define LCDCA_SR_BLKS               (0x1u <<  6) /**< \brief (LCDCA_SR) Blink Status */
#define LCDCA_SR_CSRS               (0x1u <<  7) /**< \brief (LCDCA_SR) Circular Shift Register Status */
#define LCDCA_SR_CPS                (0x1u <<  8) /**< \brief (LCDCA_SR) Charge Pump Status */
/* -------- LCDCA_SCR : (LCDCA Offset: 0x10) Status Clear Register -------- */
#define LCDCA_SCR_FC0R              (0x1u <<  0) /**< \brief (LCDCA_SCR) Frame Counter 0 Rollover */
/* -------- LCDCA_DRL0 : (LCDCA Offset: 0x14) Data Register Low 0 -------- */
#define LCDCA_DRL0_DATA_Pos         0
#define LCDCA_DRL0_DATA_Msk         (0xFFFFFFFFu << LCDCA_DRL0_DATA_Pos) /**< \brief (LCDCA_DRL0) Segments Value */
#define LCDCA_DRL0_DATA(value)      ((LCDCA_DRL0_DATA_Msk & ((value) << LCDCA_DRL0_DATA_Pos)))
/* -------- LCDCA_DRH0 : (LCDCA Offset: 0x18) Data Register High 0 -------- */
#define LCDCA_DRH0_DATA_Pos         0
#define LCDCA_DRH0_DATA_Msk         (0xFFu << LCDCA_DRH0_DATA_Pos) /**< \brief (LCDCA_DRH0) Segments Value */
#define LCDCA_DRH0_DATA(value)      ((LCDCA_DRH0_DATA_Msk & ((value) << LCDCA_DRH0_DATA_Pos)))
/* -------- LCDCA_DRL1 : (LCDCA Offset: 0x1C) Data Register Low 1 -------- */
#define LCDCA_DRL1_DATA_Pos         0
#define LCDCA_DRL1_DATA_Msk         (0xFFFFFFFFu << LCDCA_DRL1_DATA_Pos) /**< \brief (LCDCA_DRL1) Segments Value */
#define LCDCA_DRL1_DATA(value)      ((LCDCA_DRL1_DATA_Msk & ((value) << LCDCA_DRL1_DATA_Pos)))
/* -------- LCDCA_DRH1 : (LCDCA Offset: 0x20) Data Register High 1 -------- */
#define LCDCA_DRH1_DATA_Pos         0
#define LCDCA_DRH1_DATA_Msk         (0xFFu << LCDCA_DRH1_DATA_Pos) /**< \brief (LCDCA_DRH1) Segments Value */
#define LCDCA_DRH1_DATA(value)      ((LCDCA_DRH1_DATA_Msk & ((value) << LCDCA_DRH1_DATA_Pos)))
/* -------- LCDCA_DRL2 : (LCDCA Offset: 0x24) Data Register Low 2 -------- */
#define LCDCA_DRL2_DATA_Pos         0
#define LCDCA_DRL2_DATA_Msk         (0xFFFFFFFFu << LCDCA_DRL2_DATA_Pos) /**< \brief (LCDCA_DRL2) Segments Value */
#define LCDCA_DRL2_DATA(value)      ((LCDCA_DRL2_DATA_Msk & ((value) << LCDCA_DRL2_DATA_Pos)))
/* -------- LCDCA_DRH2 : (LCDCA Offset: 0x28) Data Register High 2 -------- */
#define LCDCA_DRH2_DATA_Pos         0
#define LCDCA_DRH2_DATA_Msk         (0xFFu << LCDCA_DRH2_DATA_Pos) /**< \brief (LCDCA_DRH2) Segments Value */
#define LCDCA_DRH2_DATA(value)      ((LCDCA_DRH2_DATA_Msk & ((value) << LCDCA_DRH2_DATA_Pos)))
/* -------- LCDCA_DRL3 : (LCDCA Offset: 0x2C) Data Register Low 3 -------- */
#define LCDCA_DRL3_DATA_Pos         0
#define LCDCA_DRL3_DATA_Msk         (0xFFFFFFFFu << LCDCA_DRL3_DATA_Pos) /**< \brief (LCDCA_DRL3) Segments Value */
#define LCDCA_DRL3_DATA(value)      ((LCDCA_DRL3_DATA_Msk & ((value) << LCDCA_DRL3_DATA_Pos)))
/* -------- LCDCA_DRH3 : (LCDCA Offset: 0x30) Data Register High 3 -------- */
#define LCDCA_DRH3_DATA_Pos         0
#define LCDCA_DRH3_DATA_Msk         (0xFFu << LCDCA_DRH3_DATA_Pos) /**< \brief (LCDCA_DRH3) Segments Value */
#define LCDCA_DRH3_DATA(value)      ((LCDCA_DRH3_DATA_Msk & ((value) << LCDCA_DRH3_DATA_Pos)))
/* -------- LCDCA_IADR : (LCDCA Offset: 0x34) Indirect Access Data Register -------- */
#define LCDCA_IADR_DATA_Pos         0
#define LCDCA_IADR_DATA_Msk         (0xFFu << LCDCA_IADR_DATA_Pos) /**< \brief (LCDCA_IADR) Segments Value */
#define LCDCA_IADR_DATA(value)      ((LCDCA_IADR_DATA_Msk & ((value) << LCDCA_IADR_DATA_Pos)))
#define LCDCA_IADR_DMASK_Pos        8
#define LCDCA_IADR_DMASK_Msk        (0xFFu << LCDCA_IADR_DMASK_Pos) /**< \brief (LCDCA_IADR) Data Mask */
#define LCDCA_IADR_DMASK(value)     ((LCDCA_IADR_DMASK_Msk & ((value) << LCDCA_IADR_DMASK_Pos)))
#define LCDCA_IADR_OFF_Pos          16
#define LCDCA_IADR_OFF_Msk          (0x1Fu << LCDCA_IADR_OFF_Pos) /**< \brief (LCDCA_IADR) Byte Offset */
#define LCDCA_IADR_OFF(value)       ((LCDCA_IADR_OFF_Msk & ((value) << LCDCA_IADR_OFF_Pos)))
/* -------- LCDCA_BCFG : (LCDCA Offset: 0x38) Blink Configuration Register -------- */
#define LCDCA_BCFG_MODE             (0x1u <<  0) /**< \brief (LCDCA_BCFG) Blinking Mode */
#define LCDCA_BCFG_FCS_Pos          1
#define LCDCA_BCFG_FCS_Msk          (0x3u << LCDCA_BCFG_FCS_Pos) /**< \brief (LCDCA_BCFG) Frame Counter Selection */
#define LCDCA_BCFG_FCS(value)       ((LCDCA_BCFG_FCS_Msk & ((value) << LCDCA_BCFG_FCS_Pos)))
#define LCDCA_BCFG_BSS0_Pos         8
#define LCDCA_BCFG_BSS0_Msk         (0xFu << LCDCA_BCFG_BSS0_Pos) /**< \brief (LCDCA_BCFG) Blink Segment Selection 0 */
#define LCDCA_BCFG_BSS0(value)      ((LCDCA_BCFG_BSS0_Msk & ((value) << LCDCA_BCFG_BSS0_Pos)))
#define LCDCA_BCFG_BSS1_Pos         12
#define LCDCA_BCFG_BSS1_Msk         (0xFu << LCDCA_BCFG_BSS1_Pos) /**< \brief (LCDCA_BCFG) Blink Segment Selection 1 */
#define LCDCA_BCFG_BSS1(value)      ((LCDCA_BCFG_BSS1_Msk & ((value) << LCDCA_BCFG_BSS1_Pos)))
/* -------- LCDCA_CSRCFG : (LCDCA Offset: 0x3C) Circular Shift Register Configuration -------- */
#define LCDCA_CSRCFG_DIR            (0x1u <<  0) /**< \brief (LCDCA_CSRCFG) Direction */
#define LCDCA_CSRCFG_FCS_Pos        1
#define LCDCA_CSRCFG_FCS_Msk        (0x3u << LCDCA_CSRCFG_FCS_Pos) /**< \brief (LCDCA_CSRCFG) Frame Counter Selection */
#define LCDCA_CSRCFG_FCS(value)     ((LCDCA_CSRCFG_FCS_Msk & ((value) << LCDCA_CSRCFG_FCS_Pos)))
#define LCDCA_CSRCFG_SIZE_Pos       3
#define LCDCA_CSRCFG_SIZE_Msk       (0x7u << LCDCA_CSRCFG_SIZE_Pos) /**< \brief (LCDCA_CSRCFG) Size */
#define LCDCA_CSRCFG_SIZE(value)    ((LCDCA_CSRCFG_SIZE_Msk & ((value) << LCDCA_CSRCFG_SIZE_Pos)))
#define LCDCA_CSRCFG_DATA_Pos       8
#define LCDCA_CSRCFG_DATA_Msk       (0xFFu << LCDCA_CSRCFG_DATA_Pos) /**< \brief (LCDCA_CSRCFG) Circular Shift Register Value */
#define LCDCA_CSRCFG_DATA(value)    ((LCDCA_CSRCFG_DATA_Msk & ((value) << LCDCA_CSRCFG_DATA_Pos)))
/* -------- LCDCA_CMCFG : (LCDCA Offset: 0x40) Character Mapping Configuration Register -------- */
#define LCDCA_CMCFG_DREV            (0x1u <<  0) /**< \brief (LCDCA_CMCFG) Digit Reverse Mode */
#define LCDCA_CMCFG_TDG_Pos         1
#define LCDCA_CMCFG_TDG_Msk         (0x3u << LCDCA_CMCFG_TDG_Pos) /**< \brief (LCDCA_CMCFG) Type of Digit */
#define LCDCA_CMCFG_TDG(value)      ((LCDCA_CMCFG_TDG_Msk & ((value) << LCDCA_CMCFG_TDG_Pos)))
#define LCDCA_CMCFG_STSEG_Pos       8
#define LCDCA_CMCFG_STSEG_Msk       (0x3Fu << LCDCA_CMCFG_STSEG_Pos) /**< \brief (LCDCA_CMCFG) Start Segment */
#define LCDCA_CMCFG_STSEG(value)    ((LCDCA_CMCFG_STSEG_Msk & ((value) << LCDCA_CMCFG_STSEG_Pos)))
/* -------- LCDCA_CMDR : (LCDCA Offset: 0x44) Character Mapping Data Register -------- */
#define LCDCA_CMDR_ASCII_Pos        0
#define LCDCA_CMDR_ASCII_Msk        (0x7Fu << LCDCA_CMDR_ASCII_Pos) /**< \brief (LCDCA_CMDR) ASCII Code */
#define LCDCA_CMDR_ASCII(value)     ((LCDCA_CMDR_ASCII_Msk & ((value) << LCDCA_CMDR_ASCII_Pos)))
/* -------- LCDCA_ACMCFG : (LCDCA Offset: 0x48) Automated Character Mapping Configuration Register -------- */
#define LCDCA_ACMCFG_EN             (0x1u <<  0) /**< \brief (LCDCA_ACMCFG) Enable */
#define LCDCA_ACMCFG_FCS_Pos        1
#define LCDCA_ACMCFG_FCS_Msk        (0x3u << LCDCA_ACMCFG_FCS_Pos) /**< \brief (LCDCA_ACMCFG) Frame Counter Selection */
#define LCDCA_ACMCFG_FCS(value)     ((LCDCA_ACMCFG_FCS_Msk & ((value) << LCDCA_ACMCFG_FCS_Pos)))
#define LCDCA_ACMCFG_MODE           (0x1u <<  3) /**< \brief (LCDCA_ACMCFG) Mode (sequential or scrolling) */
#define LCDCA_ACMCFG_DREV           (0x1u <<  4) /**< \brief (LCDCA_ACMCFG) Digit Reverse */
#define LCDCA_ACMCFG_TDG_Pos        5
#define LCDCA_ACMCFG_TDG_Msk        (0x3u << LCDCA_ACMCFG_TDG_Pos) /**< \brief (LCDCA_ACMCFG) Type of Digit */
#define LCDCA_ACMCFG_TDG(value)     ((LCDCA_ACMCFG_TDG_Msk & ((value) << LCDCA_ACMCFG_TDG_Pos)))
#define LCDCA_ACMCFG_STSEG_Pos      8
#define LCDCA_ACMCFG_STSEG_Msk      (0x3Fu << LCDCA_ACMCFG_STSEG_Pos) /**< \brief (LCDCA_ACMCFG) Start Segment */
#define LCDCA_ACMCFG_STSEG(value)   ((LCDCA_ACMCFG_STSEG_Msk & ((value) << LCDCA_ACMCFG_STSEG_Pos)))
#define LCDCA_ACMCFG_STEPS_Pos      16
#define LCDCA_ACMCFG_STEPS_Msk      (0xFFu << LCDCA_ACMCFG_STEPS_Pos) /**< \brief (LCDCA_ACMCFG) Scrolling Steps */
#define LCDCA_ACMCFG_STEPS(value)   ((LCDCA_ACMCFG_STEPS_Msk & ((value) << LCDCA_ACMCFG_STEPS_Pos)))
#define LCDCA_ACMCFG_DIGN_Pos       24
#define LCDCA_ACMCFG_DIGN_Msk       (0xFu << LCDCA_ACMCFG_DIGN_Pos) /**< \brief (LCDCA_ACMCFG) Digit Number */
#define LCDCA_ACMCFG_DIGN(value)    ((LCDCA_ACMCFG_DIGN_Msk & ((value) << LCDCA_ACMCFG_DIGN_Pos)))
/* -------- LCDCA_ACMDR : (LCDCA Offset: 0x4C) Automated Character Mapping Data Register -------- */
#define LCDCA_ACMDR_ASCII_Pos       0
#define LCDCA_ACMDR_ASCII_Msk       (0x7Fu << LCDCA_ACMDR_ASCII_Pos) /**< \brief (LCDCA_ACMDR) ASCII Code */
#define LCDCA_ACMDR_ASCII(value)    ((LCDCA_ACMDR_ASCII_Msk & ((value) << LCDCA_ACMDR_ASCII_Pos)))
/* -------- LCDCA_ABMCFG : (LCDCA Offset: 0x50) Automated Bit Mapping Configuration Register -------- */
#define LCDCA_ABMCFG_EN             (0x1u <<  0) /**< \brief (LCDCA_ABMCFG) Enable */
#define LCDCA_ABMCFG_FCS_Pos        1
#define LCDCA_ABMCFG_FCS_Msk        (0x3u << LCDCA_ABMCFG_FCS_Pos) /**< \brief (LCDCA_ABMCFG) Frame Counter Selection */
#define LCDCA_ABMCFG_FCS(value)     ((LCDCA_ABMCFG_FCS_Msk & ((value) << LCDCA_ABMCFG_FCS_Pos)))
#define LCDCA_ABMCFG_SIZE_Pos       8
#define LCDCA_ABMCFG_SIZE_Msk       (0x1Fu << LCDCA_ABMCFG_SIZE_Pos) /**< \brief (LCDCA_ABMCFG) Size */
#define LCDCA_ABMCFG_SIZE(value)    ((LCDCA_ABMCFG_SIZE_Msk & ((value) << LCDCA_ABMCFG_SIZE_Pos)))
/* -------- LCDCA_ABMDR : (LCDCA Offset: 0x54) Automated Bit Mapping Data Register -------- */
#define LCDCA_ABMDR_DATA_Pos        0
#define LCDCA_ABMDR_DATA_Msk        (0xFFu << LCDCA_ABMDR_DATA_Pos) /**< \brief (LCDCA_ABMDR) Segments Value */
#define LCDCA_ABMDR_DATA(value)     ((LCDCA_ABMDR_DATA_Msk & ((value) << LCDCA_ABMDR_DATA_Pos)))
#define LCDCA_ABMDR_DMASK_Pos       8
#define LCDCA_ABMDR_DMASK_Msk       (0xFFu << LCDCA_ABMDR_DMASK_Pos) /**< \brief (LCDCA_ABMDR) Data Mask */
#define LCDCA_ABMDR_DMASK(value)    ((LCDCA_ABMDR_DMASK_Msk & ((value) << LCDCA_ABMDR_DMASK_Pos)))
#define LCDCA_ABMDR_OFF_Pos         16
#define LCDCA_ABMDR_OFF_Msk         (0x1Fu << LCDCA_ABMDR_OFF_Pos) /**< \brief (LCDCA_ABMDR) Byte Offset */
#define LCDCA_ABMDR_OFF(value)      ((LCDCA_ABMDR_OFF_Msk & ((value) << LCDCA_ABMDR_OFF_Pos)))
/* -------- LCDCA_IER : (LCDCA Offset: 0x58) Interrupt Enable Register -------- */
#define LCDCA_IER_FC0R              (0x1u <<  0) /**< \brief (LCDCA_IER) Frame Counter 0 Rollover */
/* -------- LCDCA_IDR : (LCDCA Offset: 0x5C) Interrupt Disable Register -------- */
#define LCDCA_IDR_FC0R              (0x1u <<  0) /**< \brief (LCDCA_IDR) Frame Counter 0 Rollover */
/* -------- LCDCA_IMR : (LCDCA Offset: 0x60) Interrupt Mask Register -------- */
#define LCDCA_IMR_FC0R              (0x1u <<  0) /**< \brief (LCDCA_IMR) Frame Counter 0 Rollover */
/* -------- LCDCA_VERSION : (LCDCA Offset: 0x64) Version Register -------- */
#define LCDCA_VERSION_VERSION_Pos    0
#define LCDCA_VERSION_VERSION_Msk    (0xFFFu << LCDCA_VERSION_VERSION_Pos) /**< \brief (LCDCA_VERSION) Version Number */
#define LCDCA_VERSION_VERSION(value) ((LCDCA_VERSION_VERSION_Msk & ((value) << LCDCA_VERSION_VERSION_Pos)))
#define LCDCA_VERSION_VARIANT_Pos    16
#define LCDCA_VERSION_VARIANT_Msk    (0xFu << LCDCA_VERSION_VARIANT_Pos) /**< \brief (LCDCA_VERSION) Variant Number */
#define LCDCA_VERSION_VARIANT(value) ((LCDCA_VERSION_VARIANT_Msk & ((value) << LCDCA_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR PARC */
/* ============================================================================= */
/** \addtogroup SAM4L4_PARC Parallel Capture */
/*@{*/

#define REV_PARC       0x100

