Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief PARC hardware registers */
typedef struct {
  RwReg   CFG;         /**< \brief (PARC Offset: 0x00) Configuration Register */
  RwReg   CR;          /**< \brief (PARC Offset: 0x04) Control Register */
  WoReg   IER;         /**< \brief (PARC Offset: 0x08) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (PARC Offset: 0x0C) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (PARC Offset: 0x10) Interrupt Mask Register */
  RoReg   SR;          /**< \brief (PARC Offset: 0x14) Status Register */
  WoReg   ICR;         /**< \brief (PARC Offset: 0x18) Interrupt Status Clear Register */
  RoReg   RHR;         /**< \brief (PARC Offset: 0x1C) Receive Holding Register */
  RoReg   VERSION;     /**< \brief (PARC Offset: 0x20) Version Register */
} Parc;
#endif /* __ASSEMBLY__ */
/* -------- PARC_CFG : (PARC Offset: 0x00) Configuration Register -------- */
#define PARC_CFG_DSIZE_Pos          0
#define PARC_CFG_DSIZE_Msk          (0x3u << PARC_CFG_DSIZE_Pos) /**< \brief (PARC_CFG) Data Size */
#define PARC_CFG_DSIZE(value)       ((PARC_CFG_DSIZE_Msk & ((value) << PARC_CFG_DSIZE_Pos)))
#define PARC_CFG_SMODE_Pos          2
#define PARC_CFG_SMODE_Msk          (0x3u << PARC_CFG_SMODE_Pos) /**< \brief (PARC_CFG) Sampling Mode */
#define PARC_CFG_SMODE(value)       ((PARC_CFG_SMODE_Msk & ((value) << PARC_CFG_SMODE_Pos)))
#define PARC_CFG_EMODE              (0x1u <<  4) /**< \brief (PARC_CFG) Events Mode */
#define PARC_CFG_EDGE               (0x1u <<  5) /**< \brief (PARC_CFG) Sampling Edge Select */
#define PARC_CFG_HALF               (0x1u <<  6) /**< \brief (PARC_CFG) Half Capture */
#define PARC_CFG_ODD                (0x1u <<  7) /**< \brief (PARC_CFG) Odd Capture */
/* -------- PARC_CR : (PARC Offset: 0x04) Control Register -------- */
#define PARC_CR_EN                  (0x1u <<  0) /**< \brief (PARC_CR) Enable */
#define PARC_CR_DIS                 (0x1u <<  1) /**< \brief (PARC_CR) Disable */
#define PARC_CR_START               (0x1u <<  2) /**< \brief (PARC_CR) Start Capture */
#define PARC_CR_STOP                (0x1u <<  3) /**< \brief (PARC_CR) Stop Capture */
/* -------- PARC_IER : (PARC Offset: 0x08) Interrupt Enable Register -------- */
#define PARC_IER_DRDY               (0x1u <<  2) /**< \brief (PARC_IER) Data Ready Interrupt Enable */
#define PARC_IER_OVR                (0x1u <<  3) /**< \brief (PARC_IER) Overrun Interrupt Enable */
/* -------- PARC_IDR : (PARC Offset: 0x0C) Interrupt Disable Register -------- */
#define PARC_IDR_DRDY               (0x1u <<  2) /**< \brief (PARC_IDR) Data Ready Interrupt Disable */
#define PARC_IDR_OVR                (0x1u <<  3) /**< \brief (PARC_IDR) Overrun Interrupt Disable */
/* -------- PARC_IMR : (PARC Offset: 0x10) Interrupt Mask Register -------- */
#define PARC_IMR_DRDY               (0x1u <<  2) /**< \brief (PARC_IMR) Data Ready Interrupt Mask */
#define PARC_IMR_OVR                (0x1u <<  3) /**< \brief (PARC_IMR) Overrun Interrupt Mask */
/* -------- PARC_SR : (PARC Offset: 0x14) Status Register -------- */
#define PARC_SR_EN                  (0x1u <<  0) /**< \brief (PARC_SR) Enable Status */
#define PARC_SR_CS                  (0x1u <<  1) /**< \brief (PARC_SR) Capture Status */
#define PARC_SR_DRDY                (0x1u <<  2) /**< \brief (PARC_SR) Data Ready Interrupt Status */
#define PARC_SR_OVR                 (0x1u <<  3) /**< \brief (PARC_SR) Overrun Interrupt Status */
/* -------- PARC_ICR : (PARC Offset: 0x18) Interrupt Status Clear Register -------- */
#define PARC_ICR_DRDY               (0x1u <<  2) /**< \brief (PARC_ICR) Data Ready Interrupt Status Clear */
#define PARC_ICR_OVR                (0x1u <<  3) /**< \brief (PARC_ICR) Overrun Interrupt Status Clear */
/* -------- PARC_RHR : (PARC Offset: 0x1C) Receive Holding Register -------- */
#define PARC_RHR_CDATA_Pos          0
#define PARC_RHR_CDATA_Msk          (0xFFFFFFFFu << PARC_RHR_CDATA_Pos) /**< \brief (PARC_RHR) Captured Data */
#define PARC_RHR_CDATA(value)       ((PARC_RHR_CDATA_Msk & ((value) << PARC_RHR_CDATA_Pos)))
/* -------- PARC_VERSION : (PARC Offset: 0x20) Version Register -------- */
#define PARC_VERSION_VERSION_Pos    0
#define PARC_VERSION_VERSION_Msk    (0xFFFu << PARC_VERSION_VERSION_Pos) /**< \brief (PARC_VERSION) Version Number */
#define PARC_VERSION_VERSION(value) ((PARC_VERSION_VERSION_Msk & ((value) << PARC_VERSION_VERSION_Pos)))
#define PARC_VERSION_VARIANT_Pos    16
#define PARC_VERSION_VARIANT_Msk    (0xFu << PARC_VERSION_VARIANT_Pos) /**< \brief (PARC_VERSION) Variant Number */
#define PARC_VERSION_VARIANT(value) ((PARC_VERSION_VARIANT_Msk & ((value) << PARC_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR PDCA */
/* ============================================================================= */
/** \addtogroup SAM4L4_PDCA Peripheral DMA Controller */
/*@{*/

#define REV_PDCA       0x124

#ifndef __ASSEMBLY__
/** \brief PdcaChannel hardware registers */
typedef struct {
  RwReg   MAR;         /**< \brief (PdcaChannel Offset: 0x000) Memory Address Register */
  RwReg   PSR;         /**< \brief (PdcaChannel Offset: 0x004) Peripheral Select Register */
  RwReg   TCR;         /**< \brief (PdcaChannel Offset: 0x008) Transfer Counter Register */
  RwReg   MARR;        /**< \brief (PdcaChannel Offset: 0x00C) Memory Address Reload Register */
  RwReg   TCRR;        /**< \brief (PdcaChannel Offset: 0x010) Transfer Counter Reload Register */
  WoReg   CR;          /**< \brief (PdcaChannel Offset: 0x014) Control Register */
  RwReg   MR;          /**< \brief (PdcaChannel Offset: 0x018) Mode Register */
  RoReg   SR;          /**< \brief (PdcaChannel Offset: 0x01C) Status Register */
  WoReg   IER;         /**< \brief (PdcaChannel Offset: 0x020) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (PdcaChannel Offset: 0x024) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (PdcaChannel Offset: 0x028) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (PdcaChannel Offset: 0x02C) Interrupt Status Register */
  RoReg   Reserved1[4];
} PdcaChannel;
