Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/** \brief PDCA hardware registers */
#define PDCA_CHANNEL_LENGTH 16
typedef struct {
  PdcaChannel Channel[PDCA_CHANNEL_LENGTH]; /**< \brief (PDCA Offset: 0x000) PdcaChannel groups */
  PdcaChannel Reserved1[32 - PDCA_CHANNEL_LENGTH];
  RwReg   PCONTROL;    /**< \brief (PDCA Offset: 0x800) Performance Control Register */
  RoReg   PRDATA0;     /**< \brief (PDCA Offset: 0x804) Channel 0 Read Data Cycles */
  RoReg   PRSTALL0;    /**< \brief (PDCA Offset: 0x808) Channel 0 Read Stall Cycles */
  RoReg   PRLAT0;      /**< \brief (PDCA Offset: 0x80C) Channel 0 Read Max Latency */
  RoReg   PWDATA0;     /**< \brief (PDCA Offset: 0x810) Channel 0 Write Data Cycles */
  RoReg   PWSTALL0;    /**< \brief (PDCA Offset: 0x814) Channel 0 Write Stall Cycles */
  RoReg   PWLAT0;      /**< \brief (PDCA Offset: 0x818) Channel0 Write Max Latency */
  RoReg   PRDATA1;     /**< \brief (PDCA Offset: 0x81C) Channel 1 Read Data Cycles */
  RoReg   PRSTALL1;    /**< \brief (PDCA Offset: 0x820) Channel Read Stall Cycles */
  RoReg   PRLAT1;      /**< \brief (PDCA Offset: 0x824) Channel 1 Read Max Latency */
  RoReg   PWDATA1;     /**< \brief (PDCA Offset: 0x828) Channel 1 Write Data Cycles */
  RoReg   PWSTALL1;    /**< \brief (PDCA Offset: 0x82C) Channel 1 Write stall Cycles */
  RoReg   PWLAT1;      /**< \brief (PDCA Offset: 0x830) Channel 1 Read Max Latency */
  RoReg   VERSION;     /**< \brief (PDCA Offset: 0x834) Version Register */
} Pdca;
#endif /* __ASSEMBLY__ */
/* -------- PDCA_MAR : (PDCA Offset: 0x000) Channel Memory Address Register -------- */
#define PDCA_MAR_MADDR_Pos          0
#define PDCA_MAR_MADDR_Msk          (0xFFFFFFFFu << PDCA_MAR_MADDR_Pos) /**< \brief (PDCA_MAR) Memory Address */
#define PDCA_MAR_MADDR(value)       ((PDCA_MAR_MADDR_Msk & ((value) << PDCA_MAR_MADDR_Pos)))
/* -------- PDCA_PSR : (PDCA Offset: 0x004) Channel Peripheral Select Register -------- */
#define PDCA_PSR_PID_Pos            0
#define PDCA_PSR_PID_Msk            (0xFFu << PDCA_PSR_PID_Pos) /**< \brief (PDCA_PSR) Peripheral Identifier */
#define PDCA_PSR_PID(value)         ((PDCA_PSR_PID_Msk & ((value) << PDCA_PSR_PID_Pos)))
/* -------- PDCA_TCR : (PDCA Offset: 0x008) Channel Transfer Counter Register -------- */
#define PDCA_TCR_TCV_Pos            0
#define PDCA_TCR_TCV_Msk            (0xFFFFu << PDCA_TCR_TCV_Pos) /**< \brief (PDCA_TCR) Transfer Counter Value */
#define PDCA_TCR_TCV(value)         ((PDCA_TCR_TCV_Msk & ((value) << PDCA_TCR_TCV_Pos)))
/* -------- PDCA_MARR : (PDCA Offset: 0x00C) Channel Memory Address Reload Register -------- */
#define PDCA_MARR_MARV_Pos          0
#define PDCA_MARR_MARV_Msk          (0xFFFFFFFFu << PDCA_MARR_MARV_Pos) /**< \brief (PDCA_MARR) Memory Address Reload Value */
#define PDCA_MARR_MARV(value)       ((PDCA_MARR_MARV_Msk & ((value) << PDCA_MARR_MARV_Pos)))
/* -------- PDCA_TCRR : (PDCA Offset: 0x010) Channel Transfer Counter Reload Register -------- */
#define PDCA_TCRR_TCRV_Pos          0
#define PDCA_TCRR_TCRV_Msk          (0xFFFFu << PDCA_TCRR_TCRV_Pos) /**< \brief (PDCA_TCRR) Transfer Counter Reload Value */
#define PDCA_TCRR_TCRV(value)       ((PDCA_TCRR_TCRV_Msk & ((value) << PDCA_TCRR_TCRV_Pos)))
/* -------- PDCA_CR : (PDCA Offset: 0x014) Channel Control Register -------- */
#define PDCA_CR_TEN                 (0x1u <<  0) /**< \brief (PDCA_CR) Transfer Enable */
#define PDCA_CR_TDIS                (0x1u <<  1) /**< \brief (PDCA_CR) Transfer Disable */
#define PDCA_CR_ECLR                (0x1u <<  8) /**< \brief (PDCA_CR) Error Clear */
/* -------- PDCA_MR : (PDCA Offset: 0x018) Channel Mode Register -------- */
#define PDCA_MR_SIZE_Pos            0
#define PDCA_MR_SIZE_Msk            (0x3u << PDCA_MR_SIZE_Pos) /**< \brief (PDCA_MR) Transfer size */
#define PDCA_MR_SIZE(value)         ((PDCA_MR_SIZE_Msk & ((value) << PDCA_MR_SIZE_Pos)))
#define   PDCA_MR_SIZE_BYTE         (0x0u <<  0) /**< \brief (PDCA_MR)  */
#define   PDCA_MR_SIZE_HALF_WORD    (0x1u <<  0) /**< \brief (PDCA_MR)  */
#define   PDCA_MR_SIZE_WORD         (0x2u <<  0) /**< \brief (PDCA_MR)  */
#define PDCA_MR_ETRIG               (0x1u <<  2) /**< \brief (PDCA_MR) Event trigger */
#define PDCA_MR_RING                (0x1u <<  3) /**< \brief (PDCA_MR) Ring Buffer */
/* -------- PDCA_SR : (PDCA Offset: 0x01C) Channel Status Register -------- */
#define PDCA_SR_TEN                 (0x1u <<  0) /**< \brief (PDCA_SR) Transfer Enabled */
/* -------- PDCA_IER : (PDCA Offset: 0x020) Channel Interrupt Enable Register -------- */
#define PDCA_IER_RCZ                (0x1u <<  0) /**< \brief (PDCA_IER) Reload Counter Zero */
#define PDCA_IER_TRC                (0x1u <<  1) /**< \brief (PDCA_IER) Transfer Complete */
#define PDCA_IER_TERR               (0x1u <<  2) /**< \brief (PDCA_IER) Transfer Error */
/* -------- PDCA_IDR : (PDCA Offset: 0x024) Channel Interrupt Disable Register -------- */
#define PDCA_IDR_RCZ                (0x1u <<  0) /**< \brief (PDCA_IDR) Reload Counter Zero */
#define PDCA_IDR_TRC                (0x1u <<  1) /**< \brief (PDCA_IDR) Transfer Complete */
#define PDCA_IDR_TERR               (0x1u <<  2) /**< \brief (PDCA_IDR) Transfer Error */
/* -------- PDCA_IMR : (PDCA Offset: 0x028) Channel Interrupt Mask Register -------- */
#define PDCA_IMR_RCZ                (0x1u <<  0) /**< \brief (PDCA_IMR) Reload Counter Zero */
#define PDCA_IMR_TRC                (0x1u <<  1) /**< \brief (PDCA_IMR) Transfer Complete */
#define PDCA_IMR_TERR               (0x1u <<  2) /**< \brief (PDCA_IMR) Transfer Error */
/* -------- PDCA_ISR : (PDCA Offset: 0x02C) Channel Interrupt Status Register -------- */
#define PDCA_ISR_RCZ                (0x1u <<  0) /**< \brief (PDCA_ISR) Reload Counter Zero */
#define PDCA_ISR_TRC                (0x1u <<  1) /**< \brief (PDCA_ISR) Transfer Complete */
#define PDCA_ISR_TERR               (0x1u <<  2) /**< \brief (PDCA_ISR) Transfer Error */
/* -------- PDCA_PCONTROL : (PDCA Offset: 0x800) Performance Control Register -------- */
#define PDCA_PCONTROL_CH0EN         (0x1u <<  0) /**< \brief (PDCA_PCONTROL) Channel 0 Enabled */
#define PDCA_PCONTROL_CH1EN         (0x1u <<  1) /**< \brief (PDCA_PCONTROL) Channel 1 Enabled. */
#define PDCA_PCONTROL_CH0OF         (0x1u <<  4) /**< \brief (PDCA_PCONTROL) Channel 0 Overflow Freeze */
#define PDCA_PCONTROL_CH1OF         (0x1u <<  5) /**< \brief (PDCA_PCONTROL) Channel 1 overflow freeze */
#define PDCA_PCONTROL_CH0RES        (0x1u <<  8) /**< \brief (PDCA_PCONTROL) Channel 0 counter reset */
#define PDCA_PCONTROL_CH1RES        (0x1u <<  9) /**< \brief (PDCA_PCONTROL) Channel 1 counter reset */
#define PDCA_PCONTROL_MON0CH_Pos    16
#define PDCA_PCONTROL_MON0CH_Msk    (0x3Fu << PDCA_PCONTROL_MON0CH_Pos) /**< \brief (PDCA_PCONTROL) PDCA Channel to monitor with counter 0 */
#define PDCA_PCONTROL_MON0CH(value) ((PDCA_PCONTROL_MON0CH_Msk & ((value) << PDCA_PCONTROL_MON0CH_Pos)))
#define PDCA_PCONTROL_MON1CH_Pos    24
#define PDCA_PCONTROL_MON1CH_Msk    (0x3Fu << PDCA_PCONTROL_MON1CH_Pos) /**< \brief (PDCA_PCONTROL) PDCA Channel to monitor with counter 1 */
#define PDCA_PCONTROL_MON1CH(value) ((PDCA_PCONTROL_MON1CH_Msk & ((value) << PDCA_PCONTROL_MON1CH_Pos)))
/* -------- PDCA_PRDATA0 : (PDCA Offset: 0x804) Channel 0 Read Data Cycles -------- */
#define PDCA_PRDATA0_DATA_Pos       0
#define PDCA_PRDATA0_DATA_Msk       (0xFFFFFFFFu << PDCA_PRDATA0_DATA_Pos) /**< \brief (PDCA_PRDATA0) Data Cycles Counted Since Last reset */
#define PDCA_PRDATA0_DATA(value)    ((PDCA_PRDATA0_DATA_Msk & ((value) << PDCA_PRDATA0_DATA_Pos)))
/* -------- PDCA_PRSTALL0 : (PDCA Offset: 0x808) Channel 0 Read Stall Cycles -------- */
#define PDCA_PRSTALL0_STALL_Pos     0
#define PDCA_PRSTALL0_STALL_Msk     (0xFFFFFFFFu << PDCA_PRSTALL0_STALL_Pos) /**< \brief (PDCA_PRSTALL0) Stall Cycles counted since last reset */
#define PDCA_PRSTALL0_STALL(value)  ((PDCA_PRSTALL0_STALL_Msk & ((value) << PDCA_PRSTALL0_STALL_Pos)))
/* -------- PDCA_PRLAT0 : (PDCA Offset: 0x80C) Channel 0 Read Max Latency -------- */
#define PDCA_PRLAT0_LAT_Pos         0
#define PDCA_PRLAT0_LAT_Msk         (0xFFFFu << PDCA_PRLAT0_LAT_Pos) /**< \brief (PDCA_PRLAT0) Maximum Transfer Initiation cycles counted since last reset */
#define PDCA_PRLAT0_LAT(value)      ((PDCA_PRLAT0_LAT_Msk & ((value) << PDCA_PRLAT0_LAT_Pos)))
/* -------- PDCA_PWDATA0 : (PDCA Offset: 0x810) Channel 0 Write Data Cycles -------- */
#define PDCA_PWDATA0_DATA_Pos       0
#define PDCA_PWDATA0_DATA_Msk       (0xFFFFFFFFu << PDCA_PWDATA0_DATA_Pos) /**< \brief (PDCA_PWDATA0) Data Cycles Counted since last Reset */
#define PDCA_PWDATA0_DATA(value)    ((PDCA_PWDATA0_DATA_Msk & ((value) << PDCA_PWDATA0_DATA_Pos)))
/* -------- PDCA_PWSTALL0 : (PDCA Offset: 0x814) Channel 0 Write Stall Cycles -------- */
#define PDCA_PWSTALL0_STALL_Pos     0
#define PDCA_PWSTALL0_STALL_Msk     (0xFFFFFFFFu << PDCA_PWSTALL0_STALL_Pos) /**< \brief (PDCA_PWSTALL0) Stall cycles counted since last reset */
#define PDCA_PWSTALL0_STALL(value)  ((PDCA_PWSTALL0_STALL_Msk & ((value) << PDCA_PWSTALL0_STALL_Pos)))
/* -------- PDCA_PWLAT0 : (PDCA Offset: 0x818) Channel0 Write Max Latency -------- */
#define PDCA_PWLAT0_LAT_Pos         0
#define PDCA_PWLAT0_LAT_Msk         (0xFFFFu << PDCA_PWLAT0_LAT_Pos) /**< \brief (PDCA_PWLAT0) Maximum transfer initiation cycles counted since last reset */
#define PDCA_PWLAT0_LAT(value)      ((PDCA_PWLAT0_LAT_Msk & ((value) << PDCA_PWLAT0_LAT_Pos)))
/* -------- PDCA_PRDATA1 : (PDCA Offset: 0x81C) Channel 1 Read Data Cycles -------- */
#define PDCA_PRDATA1_DATA_Pos       0
#define PDCA_PRDATA1_DATA_Msk       (0xFFFFFFFFu << PDCA_PRDATA1_DATA_Pos) /**< \brief (PDCA_PRDATA1) Data Cycles Counted Since Last reset */
#define PDCA_PRDATA1_DATA(value)    ((PDCA_PRDATA1_DATA_Msk & ((value) << PDCA_PRDATA1_DATA_Pos)))
/* -------- PDCA_PRSTALL1 : (PDCA Offset: 0x820) Channel Read Stall Cycles -------- */
#define PDCA_PRSTALL1_STALL_Pos     0
#define PDCA_PRSTALL1_STALL_Msk     (0xFFFFFFFFu << PDCA_PRSTALL1_STALL_Pos) /**< \brief (PDCA_PRSTALL1) Stall Cycles Counted since last reset */
#define PDCA_PRSTALL1_STALL(value)  ((PDCA_PRSTALL1_STALL_Msk & ((value) << PDCA_PRSTALL1_STALL_Pos)))
/* -------- PDCA_PRLAT1 : (PDCA Offset: 0x824) Channel 1 Read Max Latency -------- */
#define PDCA_PRLAT1_LAT_Pos         0
#define PDCA_PRLAT1_LAT_Msk         (0xFFFFu << PDCA_PRLAT1_LAT_Pos) /**< \brief (PDCA_PRLAT1) Maximum Transfer initiation cycles counted since last reset */
#define PDCA_PRLAT1_LAT(value)      ((PDCA_PRLAT1_LAT_Msk & ((value) << PDCA_PRLAT1_LAT_Pos)))
/* -------- PDCA_PWDATA1 : (PDCA Offset: 0x828) Channel 1 Write Data Cycles -------- */
#define PDCA_PWDATA1_DATA_Pos       0
#define PDCA_PWDATA1_DATA_Msk       (0xFFFFFFFFu << PDCA_PWDATA1_DATA_Pos) /**< \brief (PDCA_PWDATA1) Data cycles Counted Since last reset */
#define PDCA_PWDATA1_DATA(value)    ((PDCA_PWDATA1_DATA_Msk & ((value) << PDCA_PWDATA1_DATA_Pos)))
/* -------- PDCA_PWSTALL1 : (PDCA Offset: 0x82C) Channel 1 Write stall Cycles -------- */
#define PDCA_PWSTALL1_STALL_Pos     0
#define PDCA_PWSTALL1_STALL_Msk     (0xFFFFFFFFu << PDCA_PWSTALL1_STALL_Pos) /**< \brief (PDCA_PWSTALL1) Stall cycles counted since last reset */
#define PDCA_PWSTALL1_STALL(value)  ((PDCA_PWSTALL1_STALL_Msk & ((value) << PDCA_PWSTALL1_STALL_Pos)))
/* -------- PDCA_PWLAT1 : (PDCA Offset: 0x830) Channel 1 Read Max Latency -------- */
#define PDCA_PWLAT1_LAT_Pos         0
#define PDCA_PWLAT1_LAT_Msk         (0xFFFFu << PDCA_PWLAT1_LAT_Pos) /**< \brief (PDCA_PWLAT1) Maximum transfer initiation cycles counted since last reset */
#define PDCA_PWLAT1_LAT(value)      ((PDCA_PWLAT1_LAT_Msk & ((value) << PDCA_PWLAT1_LAT_Pos)))
/* -------- PDCA_VERSION : (PDCA Offset: 0x834) Version Register -------- */
#define PDCA_VERSION_VERSION_Pos    0
#define PDCA_VERSION_VERSION_Msk    (0xFFFu << PDCA_VERSION_VERSION_Pos) /**< \brief (PDCA_VERSION) Version Number */
#define PDCA_VERSION_VERSION(value) ((PDCA_VERSION_VERSION_Msk & ((value) << PDCA_VERSION_VERSION_Pos)))
#define PDCA_VERSION_VARIANT_Pos    16
#define PDCA_VERSION_VARIANT_Msk    (0xFu << PDCA_VERSION_VARIANT_Pos) /**< \brief (PDCA_VERSION) Variant Number */
#define PDCA_VERSION_VARIANT(value) ((PDCA_VERSION_VARIANT_Msk & ((value) << PDCA_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR PEVC */
/* ============================================================================= */
/** \addtogroup SAM4L4_PEVC Peripheral Event Controller */
/*@{*/

#define REV_PEVC       0x200

