Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief PICOUART hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (PICOUART Offset: 0x00) Control Register */
  RwReg   CFG;         /**< \brief (PICOUART Offset: 0x04) Configuration Register */
  RoReg   SR;          /**< \brief (PICOUART Offset: 0x08) Status Register */
  RoReg   RHR;         /**< \brief (PICOUART Offset: 0x0C) Receive Holding Register */
  RoReg   Reserved1[4];
  RoReg   VERSION;     /**< \brief (PICOUART Offset: 0x20) Version Register */
} Picouart;
#endif /* __ASSEMBLY__ */
/* -------- PICOUART_CR : (PICOUART Offset: 0x00) Control Register -------- */
#define PICOUART_CR_EN              (0x1u <<  0) /**< \brief (PICOUART_CR) Enable */
#define PICOUART_CR_DIS             (0x1u <<  1) /**< \brief (PICOUART_CR) Disable */
/* -------- PICOUART_CFG : (PICOUART Offset: 0x04) Configuration Register -------- */
#define PICOUART_CFG_SOURCE_Pos     0
#define PICOUART_CFG_SOURCE_Msk     (0x3u << PICOUART_CFG_SOURCE_Pos) /**< \brief (PICOUART_CFG) Source Enable Mode */
#define PICOUART_CFG_SOURCE(value)  ((PICOUART_CFG_SOURCE_Msk & ((value) << PICOUART_CFG_SOURCE_Pos)))
#define PICOUART_CFG_ACTION         (0x1u <<  2) /**< \brief (PICOUART_CFG) Action to perform */
#define PICOUART_CFG_MATCH_Pos      8
#define PICOUART_CFG_MATCH_Msk      (0xFFu << PICOUART_CFG_MATCH_Pos) /**< \brief (PICOUART_CFG) Data Match */
#define PICOUART_CFG_MATCH(value)   ((PICOUART_CFG_MATCH_Msk & ((value) << PICOUART_CFG_MATCH_Pos)))
/* -------- PICOUART_SR : (PICOUART Offset: 0x08) Status Register -------- */
#define PICOUART_SR_EN              (0x1u <<  0) /**< \brief (PICOUART_SR) Enable Interrupt Status */
#define PICOUART_SR_DRDY            (0x1u <<  1) /**< \brief (PICOUART_SR) Data Ready Interrupt Status */
/* -------- PICOUART_RHR : (PICOUART Offset: 0x0C) Receive Holding Register -------- */
#define PICOUART_RHR_CDATA_Pos      0
#define PICOUART_RHR_CDATA_Msk      (0xFFFFFFFFu << PICOUART_RHR_CDATA_Pos) /**< \brief (PICOUART_RHR) Received Data */
#define PICOUART_RHR_CDATA(value)   ((PICOUART_RHR_CDATA_Msk & ((value) << PICOUART_RHR_CDATA_Pos)))
/* -------- PICOUART_VERSION : (PICOUART Offset: 0x20) Version Register -------- */
#define PICOUART_VERSION_VERSION_Pos    0
#define PICOUART_VERSION_VERSION_Msk    (0xFFFu << PICOUART_VERSION_VERSION_Pos) /**< \brief (PICOUART_VERSION) Version Number */
#define PICOUART_VERSION_VERSION(value) ((PICOUART_VERSION_VERSION_Msk & ((value) << PICOUART_VERSION_VERSION_Pos)))
#define PICOUART_VERSION_VARIANT_Pos    16
#define PICOUART_VERSION_VARIANT_Msk    (0xFu << PICOUART_VERSION_VARIANT_Pos) /**< \brief (PICOUART_VERSION) Variant Number */
#define PICOUART_VERSION_VARIANT(value) ((PICOUART_VERSION_VARIANT_Msk & ((value) << PICOUART_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR PM */
/* ============================================================================= */
/** \addtogroup SAM4L4_PM Power Manager */
/*@{*/

#define REV_PM         0x441

#ifndef __ASSEMBLY__
/** \brief PM hardware registers */
typedef struct {
  RwReg   MCCTRL;      /**< \brief (PM Offset: 0x000) Main Clock Control */
  RwReg   CPUSEL;      /**< \brief (PM Offset: 0x004) CPU Clock Select */
  RoReg   Reserved1[1];
  RwReg   PBASEL;      /**< \brief (PM Offset: 0x00C) PBA Clock Select */
  RwReg   PBBSEL;      /**< \brief (PM Offset: 0x010) PBB Clock Select */
  RwReg   PBCSEL;      /**< \brief (PM Offset: 0x014) PBC Clock Select */
  RwReg   PBDSEL;      /**< \brief (PM Offset: 0x018) PBD Clock Select */
  RoReg   Reserved2[1];
  RwReg   CPUMASK;     /**< \brief (PM Offset: 0x020) CPU Mask */
  RwReg   HSBMASK;     /**< \brief (PM Offset: 0x024) HSB Mask */
  RwReg   PBAMASK;     /**< \brief (PM Offset: 0x028) PBA Mask */
  RwReg   PBBMASK;     /**< \brief (PM Offset: 0x02C) PBB Mask */
  RwReg   PBCMASK;     /**< \brief (PM Offset: 0x030) PBC Mask */
  RwReg   PBDMASK;     /**< \brief (PM Offset: 0x034) PBD Mask */
  RoReg   Reserved3[2];
  RwReg   PBADIVMASK;  /**< \brief (PM Offset: 0x040) PBA Divided Clock Mask */
  RoReg   Reserved4[4];
  RwReg   CFDCTRL;     /**< \brief (PM Offset: 0x054) Clock Failure Detector Control */
  WoReg   UNLOCK;      /**< \brief (PM Offset: 0x058) Unlock Register */
  RoReg   Reserved5[25];
  WoReg   IER;         /**< \brief (PM Offset: 0x0C0) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (PM Offset: 0x0C4) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (PM Offset: 0x0C8) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (PM Offset: 0x0CC) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (PM Offset: 0x0D0) Interrupt Clear Register */
  RoReg   SR;          /**< \brief (PM Offset: 0x0D4) Status Register */
  RoReg   Reserved6[34];
  RwReg   PPCR;        /**< \brief (PM Offset: 0x160) Peripheral Power Control Register */
  RoReg   Reserved7[7];
  RoReg   RCAUSE;      /**< \brief (PM Offset: 0x180) Reset Cause Register */
  RoReg   WCAUSE;      /**< \brief (PM Offset: 0x184) Wake Cause Register */
  RwReg   AWEN;        /**< \brief (PM Offset: 0x188) Asynchronous Wake Enable */
  RoReg   Reserved8[1];
  RwReg   OBS;         /**< \brief (PM Offset: 0x190) Obsvervability */
  RwReg   FASTSLEEP;   /**< \brief (PM Offset: 0x194) Fast Sleep Register */
  RoReg   Reserved9[152];
  RoReg   CONFIG;      /**< \brief (PM Offset: 0x3F8) Configuration Register */
  RoReg   VERSION;     /**< \brief (PM Offset: 0x3FC) Version Register */
} Pm;
#endif /* __ASSEMBLY__ */
/* -------- PM_MCCTRL : (PM Offset: 0x000) Main Clock Control -------- */
#define PM_MCCTRL_MCSEL_Pos         0
#define PM_MCCTRL_MCSEL_Msk         (0x7u << PM_MCCTRL_MCSEL_Pos) /**< \brief (PM_MCCTRL) Main Clock Select */
#define PM_MCCTRL_MCSEL(value)      ((PM_MCCTRL_MCSEL_Msk & ((value) << PM_MCCTRL_MCSEL_Pos)))
/* -------- PM_CPUSEL : (PM Offset: 0x004) CPU Clock Select -------- */
#define PM_CPUSEL_CPUSEL_Pos        0
#define PM_CPUSEL_CPUSEL_Msk        (0x7u << PM_CPUSEL_CPUSEL_Pos) /**< \brief (PM_CPUSEL) CPU Clock Select */
#define PM_CPUSEL_CPUSEL(value)     ((PM_CPUSEL_CPUSEL_Msk & ((value) << PM_CPUSEL_CPUSEL_Pos)))
#define   PM_CPUSEL_CPUSEL_0        (0x0u <<  0) /**< \brief (PM_CPUSEL) fCPU:fmain. CPUDIV: */
#define   PM_CPUSEL_CPUSEL_1        (0x1u <<  0) /**< \brief (PM_CPUSEL) fCPU:fmain / 2^(CPUSEL+1) */
#define PM_CPUSEL_CPUDIV            (0x1u <<  7) /**< \brief (PM_CPUSEL) CPU Division */
/* -------- PM_PBASEL : (PM Offset: 0x00C) PBA Clock Select -------- */
#define PM_PBASEL_PBSEL_Pos         0
#define PM_PBASEL_PBSEL_Msk         (0x7u << PM_PBASEL_PBSEL_Pos) /**< \brief (PM_PBASEL) PBA Clock Select */
#define PM_PBASEL_PBSEL(value)      ((PM_PBASEL_PBSEL_Msk & ((value) << PM_PBASEL_PBSEL_Pos)))
#define PM_PBASEL_PBDIV             (0x1u <<  7) /**< \brief (PM_PBASEL) PBA Division Select */
/* -------- PM_PBBSEL : (PM Offset: 0x010) PBB Clock Select -------- */
#define PM_PBBSEL_PBSEL_Pos         0
#define PM_PBBSEL_PBSEL_Msk         (0x7u << PM_PBBSEL_PBSEL_Pos) /**< \brief (PM_PBBSEL) PBB Clock Select */
#define PM_PBBSEL_PBSEL(value)      ((PM_PBBSEL_PBSEL_Msk & ((value) << PM_PBBSEL_PBSEL_Pos)))
#define PM_PBBSEL_PBDIV             (0x1u <<  7) /**< \brief (PM_PBBSEL) PBB Division Select */
/* -------- PM_PBCSEL : (PM Offset: 0x014) PBC Clock Select -------- */
#define PM_PBCSEL_PBSEL_Pos         0
#define PM_PBCSEL_PBSEL_Msk         (0x7u << PM_PBCSEL_PBSEL_Pos) /**< \brief (PM_PBCSEL) PBC Clock Select */
#define PM_PBCSEL_PBSEL(value)      ((PM_PBCSEL_PBSEL_Msk & ((value) << PM_PBCSEL_PBSEL_Pos)))
#define PM_PBCSEL_PBDIV             (0x1u <<  7) /**< \brief (PM_PBCSEL) PBC Division Select */
/* -------- PM_PBDSEL : (PM Offset: 0x018) PBD Clock Select -------- */
#define PM_PBDSEL_PBSEL_Pos         0
#define PM_PBDSEL_PBSEL_Msk         (0x7u << PM_PBDSEL_PBSEL_Pos) /**< \brief (PM_PBDSEL) PBD Clock Select */
#define PM_PBDSEL_PBSEL(value)      ((PM_PBDSEL_PBSEL_Msk & ((value) << PM_PBDSEL_PBSEL_Pos)))
#define PM_PBDSEL_PBDIV             (0x1u <<  7) /**< \brief (PM_PBDSEL) PBD Division Select */
/* -------- PM_CPUMASK : (PM Offset: 0x020) CPU Mask -------- */
#define PM_CPUMASK_OCD              (0x1u <<  0) /**< \brief (PM_CPUMASK) OCD CPU Clock Mask */
/* -------- PM_HSBMASK : (PM Offset: 0x024) HSB Mask -------- */
#define PM_HSBMASK_PDCA             (0x1u <<  0) /**< \brief (PM_HSBMASK) PDCA HSB Clock Mask */
#define PM_HSBMASK_HFLASHC          (0x1u <<  1) /**< \brief (PM_HSBMASK) HFLASHC HSB Clock Mask */
#define PM_HSBMASK_HRAMC1           (0x1u <<  2) /**< \brief (PM_HSBMASK) HRAMC1 HSB Clock Mask */
#define PM_HSBMASK_USBC             (0x1u <<  3) /**< \brief (PM_HSBMASK) USBC HSB Clock Mask */
#define PM_HSBMASK_CRCCU            (0x1u <<  4) /**< \brief (PM_HSBMASK) CRCCU HSB Clock Mask */
#define PM_HSBMASK_HTOP0            (0x1u <<  5) /**< \brief (PM_HSBMASK) HTOP0 HSB Clock Mask */
#define PM_HSBMASK_HTOP1            (0x1u <<  6) /**< \brief (PM_HSBMASK) HTOP1 HSB Clock Mask */
#define PM_HSBMASK_HTOP2            (0x1u <<  7) /**< \brief (PM_HSBMASK) HTOP2 HSB Clock Mask */
#define PM_HSBMASK_HTOP3            (0x1u <<  8) /**< \brief (PM_HSBMASK) HTOP3 HSB Clock Mask */
#define PM_HSBMASK_AESA             (0x1u <<  9) /**< \brief (PM_HSBMASK) AESA HSB Clock Mask */
/* -------- PM_PBAMASK : (PM Offset: 0x028) PBA Mask -------- */
#define PM_PBAMASK_IISC             (0x1u <<  0) /**< \brief (PM_PBAMASK) IISC PB Clock Mask */
#define PM_PBAMASK_SPI              (0x1u <<  1) /**< \brief (PM_PBAMASK) SPI PB Clock Mask */
#define PM_PBAMASK_TC0              (0x1u <<  2) /**< \brief (PM_PBAMASK) TC0 PB Clock Mask */
#define PM_PBAMASK_TC1              (0x1u <<  3) /**< \brief (PM_PBAMASK) TC1 PB Clock Mask */
#define PM_PBAMASK_TWIM0            (0x1u <<  4) /**< \brief (PM_PBAMASK) TWIM0 PB Clock Mask */
#define PM_PBAMASK_TWIS0            (0x1u <<  5) /**< \brief (PM_PBAMASK) TWIS0 PB Clock Mask */
#define PM_PBAMASK_TWIM1            (0x1u <<  6) /**< \brief (PM_PBAMASK) TWIM1 PB Clock Mask */
#define PM_PBAMASK_TWIS1            (0x1u <<  7) /**< \brief (PM_PBAMASK) TWIS1 PB Clock Mask */
#define PM_PBAMASK_USART0           (0x1u <<  8) /**< \brief (PM_PBAMASK) USART0 PB Clock Mask */
#define PM_PBAMASK_USART1           (0x1u <<  9) /**< \brief (PM_PBAMASK) USART1 PB Clock Mask */
#define PM_PBAMASK_USART2           (0x1u << 10) /**< \brief (PM_PBAMASK) USART2 PB Clock Mask */
#define PM_PBAMASK_USART3           (0x1u << 11) /**< \brief (PM_PBAMASK) USART3 PB Clock Mask */
#define PM_PBAMASK_ADCIFE           (0x1u << 12) /**< \brief (PM_PBAMASK) ADCIFE PB Clock Mask */
#define PM_PBAMASK_DACC             (0x1u << 13) /**< \brief (PM_PBAMASK) DACC PB Clock Mask */
#define PM_PBAMASK_ACIFC            (0x1u << 14) /**< \brief (PM_PBAMASK) ACIFC PB Clock Mask */
#define PM_PBAMASK_GLOC             (0x1u << 15) /**< \brief (PM_PBAMASK) GLOC PB Clock Mask */
#define PM_PBAMASK_ABDACB           (0x1u << 16) /**< \brief (PM_PBAMASK) ABDACB PB Clock Mask */
#define PM_PBAMASK_TRNG             (0x1u << 17) /**< \brief (PM_PBAMASK) TRNG PB Clock Mask */
#define PM_PBAMASK_PARC             (0x1u << 18) /**< \brief (PM_PBAMASK) PARC PB Clock Mask */
#define PM_PBAMASK_CATB             (0x1u << 19) /**< \brief (PM_PBAMASK) CATB PB Clock Mask */
#define PM_PBAMASK_TWIM2            (0x1u << 21) /**< \brief (PM_PBAMASK) TWIM2 PB Clock Mask */
#define PM_PBAMASK_TWIM3            (0x1u << 22) /**< \brief (PM_PBAMASK) TWIM3 PB Clock Mask */
#define PM_PBAMASK_LCDCA            (0x1u << 23) /**< \brief (PM_PBAMASK) LCDCA PB Clock Mask */
/* -------- PM_PBBMASK : (PM Offset: 0x02C) PBB Mask -------- */
#define PM_PBBMASK_HFLASHC          (0x1u <<  0) /**< \brief (PM_PBBMASK) HFLASHC PB Clock Mask */
#define PM_PBBMASK_HCACHE           (0x1u <<  1) /**< \brief (PM_PBBMASK) HCACHE PB Clock Mask */
#define PM_PBBMASK_HMATRIX          (0x1u <<  2) /**< \brief (PM_PBBMASK) HMATRIX PB Clock Mask */
#define PM_PBBMASK_PDCA             (0x1u <<  3) /**< \brief (PM_PBBMASK) PDCA PB Clock Mask */
#define PM_PBBMASK_CRCCU            (0x1u <<  4) /**< \brief (PM_PBBMASK) CRCCU PB Clock Mask */
#define PM_PBBMASK_USBC             (0x1u <<  5) /**< \brief (PM_PBBMASK) USBC PB Clock Mask */
#define PM_PBBMASK_PEVC             (0x1u <<  6) /**< \brief (PM_PBBMASK) PEVC PB Clock Mask */
/* -------- PM_PBCMASK : (PM Offset: 0x030) PBC Mask -------- */
#define PM_PBCMASK_PM               (0x1u <<  0) /**< \brief (PM_PBCMASK) PM PB Clock Mask */
#define PM_PBCMASK_CHIPID           (0x1u <<  1) /**< \brief (PM_PBCMASK) CHIPID PB Clock Mask */
#define PM_PBCMASK_SCIF             (0x1u <<  2) /**< \brief (PM_PBCMASK) SCIF PB Clock Mask */
#define PM_PBCMASK_FREQM            (0x1u <<  3) /**< \brief (PM_PBCMASK) FREQM PB Clock Mask */
#define PM_PBCMASK_GPIO             (0x1u <<  4) /**< \brief (PM_PBCMASK) GPIO PB Clock Mask */
/* -------- PM_PBDMASK : (PM Offset: 0x034) PBD Mask -------- */
#define PM_PBDMASK_BPM              (0x1u <<  0) /**< \brief (PM_PBDMASK) BPM PB Clock Mask */
#define PM_PBDMASK_BSCIF            (0x1u <<  1) /**< \brief (PM_PBDMASK) BSCIF PB Clock Mask */
#define PM_PBDMASK_AST              (0x1u <<  2) /**< \brief (PM_PBDMASK) AST PB Clock Mask */
#define PM_PBDMASK_WDT              (0x1u <<  3) /**< \brief (PM_PBDMASK) WDT PB Clock Mask */
#define PM_PBDMASK_EIC              (0x1u <<  4) /**< \brief (PM_PBDMASK) EIC PB Clock Mask */
#define PM_PBDMASK_PICOUART         (0x1u <<  5) /**< \brief (PM_PBDMASK) PICOUART PB Clock Mask */
/* -------- PM_CFDCTRL : (PM Offset: 0x054) Clock Failure Detector Control -------- */
#define PM_CFDCTRL_CFDEN            (0x1u <<  0) /**< \brief (PM_CFDCTRL) Clock Failure Detection Enable */
#define PM_CFDCTRL_SFV              (0x1u << 31) /**< \brief (PM_CFDCTRL) Store Final Value */
/* -------- PM_UNLOCK : (PM Offset: 0x058) Unlock Register -------- */
#define PM_UNLOCK_ADDR_Pos          0
#define PM_UNLOCK_ADDR_Msk          (0x3FFu << PM_UNLOCK_ADDR_Pos) /**< \brief (PM_UNLOCK) Unlock Address */
#define PM_UNLOCK_ADDR(value)       ((PM_UNLOCK_ADDR_Msk & ((value) << PM_UNLOCK_ADDR_Pos)))
#define PM_UNLOCK_KEY_Pos           24
#define PM_UNLOCK_KEY_Msk           (0xFFu << PM_UNLOCK_KEY_Pos) /**< \brief (PM_UNLOCK) Unlock Key */
#define PM_UNLOCK_KEY(value)        ((PM_UNLOCK_KEY_Msk & ((value) << PM_UNLOCK_KEY_Pos)))
/* -------- PM_IER : (PM Offset: 0x0C0) Interrupt Enable Register -------- */
#define PM_IER_CFD                  (0x1u <<  0) /**< \brief (PM_IER) Clock Failure Detected Interrupt Enable */
#define PM_IER_CKRDY                (0x1u <<  5) /**< \brief (PM_IER) Clock Ready Interrupt Enable */
#define PM_IER_WAKE                 (0x1u <<  8) /**< \brief (PM_IER) Wake up Interrupt Enable */
#define   PM_IER_WAKE_0             (0x0u <<  8) /**< \brief (PM_IER) No effect */
#define   PM_IER_WAKE_1             (0x1u <<  8) /**< \brief (PM_IER) Disable Interrupt. */
#define PM_IER_AE                   (0x1u << 31) /**< \brief (PM_IER) Access Error Interrupt Enable */
/* -------- PM_IDR : (PM Offset: 0x0C4) Interrupt Disable Register -------- */
#define PM_IDR_CFD                  (0x1u <<  0) /**< \brief (PM_IDR) Clock Failure Detected Interrupt Disable */
#define PM_IDR_CKRDY                (0x1u <<  5) /**< \brief (PM_IDR) Clock Ready Interrupt Disable */
#define PM_IDR_WAKE                 (0x1u <<  8) /**< \brief (PM_IDR) Wake up Interrupt Disable */
#define   PM_IDR_WAKE_0             (0x0u <<  8) /**< \brief (PM_IDR) No effect */
#define   PM_IDR_WAKE_1             (0x1u <<  8) /**< \brief (PM_IDR) Disable Interrupt. */
#define PM_IDR_AE                   (0x1u << 31) /**< \brief (PM_IDR) Access Error Interrupt Disable */
/* -------- PM_IMR : (PM Offset: 0x0C8) Interrupt Mask Register -------- */
#define PM_IMR_CFD                  (0x1u <<  0) /**< \brief (PM_IMR) Clock Failure Detected Interrupt Mask */
#define PM_IMR_CKRDY                (0x1u <<  5) /**< \brief (PM_IMR) Clock Ready Interrupt Mask */
#define PM_IMR_WAKE                 (0x1u <<  8) /**< \brief (PM_IMR) Wake up Interrupt Mask */
#define   PM_IMR_WAKE_0             (0x0u <<  8) /**< \brief (PM_IMR) No effect */
#define   PM_IMR_WAKE_1             (0x1u <<  8) /**< \brief (PM_IMR) Disable Interrupt. */
#define PM_IMR_AE                   (0x1u << 31) /**< \brief (PM_IMR) Access Error Interrupt Mask */
/* -------- PM_ISR : (PM Offset: 0x0CC) Interrupt Status Register -------- */
#define PM_ISR_CFD                  (0x1u <<  0) /**< \brief (PM_ISR) Clock Failure Detected Interrupt Status */
#define PM_ISR_CKRDY                (0x1u <<  5) /**< \brief (PM_ISR) Clock Ready Interrupt Status */
#define PM_ISR_WAKE                 (0x1u <<  8) /**< \brief (PM_ISR) Wake up Interrupt Status */
#define   PM_ISR_WAKE_0             (0x0u <<  8) /**< \brief (PM_ISR) No effect */
#define   PM_ISR_WAKE_1             (0x1u <<  8) /**< \brief (PM_ISR) Disable Interrupt. */
#define PM_ISR_AE                   (0x1u << 31) /**< \brief (PM_ISR) Access Error Interrupt Status */
/* -------- PM_ICR : (PM Offset: 0x0D0) Interrupt Clear Register -------- */
#define PM_ICR_CFD                  (0x1u <<  0) /**< \brief (PM_ICR) Clock Failure Detected Interrupt Status Clear */
#define PM_ICR_CKRDY                (0x1u <<  5) /**< \brief (PM_ICR) Clock Ready Interrupt Status Clear */
#define PM_ICR_WAKE                 (0x1u <<  8) /**< \brief (PM_ICR) Wake up Interrupt Status Clear */
#define PM_ICR_AE                   (0x1u << 31) /**< \brief (PM_ICR) Access Error Interrupt Status Clear */
/* -------- PM_SR : (PM Offset: 0x0D4) Status Register -------- */
#define PM_SR_CFD                   (0x1u <<  0) /**< \brief (PM_SR) Clock Failure Detected */
#define PM_SR_OCP                   (0x1u <<  1) /**< \brief (PM_SR) Over Clock Detected */
#define PM_SR_CKRDY                 (0x1u <<  5) /**< \brief (PM_SR) Clock Ready */
#define PM_SR_WAKE                  (0x1u <<  8) /**< \brief (PM_SR) Wake up */
#define   PM_SR_WAKE_0              (0x0u <<  8) /**< \brief (PM_SR) No effect */
#define   PM_SR_WAKE_1              (0x1u <<  8) /**< \brief (PM_SR) Disable Interrupt. */
#define PM_SR_PERRDY                (0x1u << 28) /**< \brief (PM_SR) Peripheral Ready */
#define PM_SR_AE                    (0x1u << 31) /**< \brief (PM_SR) Access Error */
/* -------- PM_PPCR : (PM Offset: 0x160) Peripheral Power Control Register -------- */
#define PM_PPCR_RSTPUN              (0x1u <<  0) /**< \brief (PM_PPCR) Reset Pullup */
#define PM_PPCR_CATBRCMASK          (0x1u <<  1) /**< \brief (PM_PPCR) CAT Request Clock Mask */
#define PM_PPCR_ACIFCRCMASK         (0x1u <<  2) /**< \brief (PM_PPCR) ACIFC Request Clock Mask */
#define PM_PPCR_ASTRCMASK           (0x1u <<  3) /**< \brief (PM_PPCR) AST Request Clock Mask */
#define PM_PPCR_TWIS0RCMASK         (0x1u <<  4) /**< \brief (PM_PPCR) TWIS0 Request Clock Mask */
#define PM_PPCR_TWIS1RCMASK         (0x1u <<  5) /**< \brief (PM_PPCR) TWIS1 Request Clock Mask */
#define PM_PPCR_PEVCRCMASK          (0x1u <<  6) /**< \brief (PM_PPCR) PEVC Request Clock Mask */
#define PM_PPCR_ADCIFERCMASK        (0x1u <<  7) /**< \brief (PM_PPCR) ADCIFE Request Clock Mask */
#define PM_PPCR_VREGRCMASK          (0x1u <<  8) /**< \brief (PM_PPCR) VREG Request Clock Mask */
#define PM_PPCR_FWBGREF             (0x1u <<  9) /**< \brief (PM_PPCR) Flash Wait BGREF */
#define PM_PPCR_FWBOD18             (0x1u << 10) /**< \brief (PM_PPCR) Flash Wait BOD18 */
/* -------- PM_RCAUSE : (PM Offset: 0x180) Reset Cause Register -------- */
#define PM_RCAUSE_POR               (0x1u <<  0) /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_BOD               (0x1u <<  1) /**< \brief (PM_RCAUSE) Brown-out Reset */
#define PM_RCAUSE_EXT               (0x1u <<  2) /**< \brief (PM_RCAUSE) External Reset Pin */
#define PM_RCAUSE_WDT               (0x1u <<  3) /**< \brief (PM_RCAUSE) Watchdog Reset */
#define PM_RCAUSE_OCDRST            (0x1u <<  8) /**< \brief (PM_RCAUSE) OCD Reset */
#define PM_RCAUSE_POR33             (0x1u << 10) /**< \brief (PM_RCAUSE) Power-on Reset */
#define PM_RCAUSE_BOD33             (0x1u << 13) /**< \brief (PM_RCAUSE) Brown-out 3.3V Reset */
/* -------- PM_WCAUSE : (PM Offset: 0x184) Wake Cause Register -------- */
#define PM_WCAUSE_TWI_SLAVE_0_Pos    0
#define PM_WCAUSE_TWI_SLAVE_0_Msk    (0xFFFFu << PM_WCAUSE_TWI_SLAVE_0_Pos) /**< \brief (PM_WCAUSE) Two-wire Slave Interface 0 */
#define PM_WCAUSE_TWI_SLAVE_0(value) ((PM_WCAUSE_TWI_SLAVE_0_Msk & ((value) << PM_WCAUSE_TWI_SLAVE_0_Pos)))
#define PM_WCAUSE_TWI_SLAVE_1       (0x1u <<  1) /**< \brief (PM_WCAUSE) Two-wire Slave Interface 1 */
#define PM_WCAUSE_USBC              (0x1u <<  2) /**< \brief (PM_WCAUSE) USB Device and Embedded Host Interface */
#define PM_WCAUSE_PSOK              (0x1u <<  3) /**< \brief (PM_WCAUSE) Power Scaling OK */
#define PM_WCAUSE_BOD18_IRQ         (0x1u <<  4) /**< \brief (PM_WCAUSE) BOD18 Interrupt */
#define PM_WCAUSE_BOD33_IRQ         (0x1u <<  5) /**< \brief (PM_WCAUSE) BOD33 Interrupt */
#define PM_WCAUSE_PICOUART          (0x1u <<  6) /**< \brief (PM_WCAUSE) Picopower UART */
#define PM_WCAUSE_LCDCA             (0x1u <<  7) /**< \brief (PM_WCAUSE) LCD Controller */
#define PM_WCAUSE_EIC               (0x1u << 16) /**< \brief (PM_WCAUSE) External Interrupt Controller */
#define PM_WCAUSE_AST               (0x1u << 17) /**< \brief (PM_WCAUSE) Asynchronous Timer */
/* -------- PM_AWEN : (PM Offset: 0x188) Asynchronous Wake Enable -------- */
#define PM_AWEN_AWEN_Pos            0
#define PM_AWEN_AWEN_Msk            (0xFFFFFFFFu << PM_AWEN_AWEN_Pos) /**< \brief (PM_AWEN) Asynchronous Wake Up */
#define PM_AWEN_AWEN(value)         ((PM_AWEN_AWEN_Msk & ((value) << PM_AWEN_AWEN_Pos)))
/* -------- PM_OBS : (PM Offset: 0x190) Obsvervability -------- */
/* -------- PM_FASTSLEEP : (PM Offset: 0x194) Fast Sleep Register -------- */
#define PM_FASTSLEEP_OSC            (0x1u <<  0) /**< \brief (PM_FASTSLEEP) Oscillator */
#define PM_FASTSLEEP_PLL            (0x1u <<  8) /**< \brief (PM_FASTSLEEP) PLL */
#define PM_FASTSLEEP_FASTRCOSC_Pos    16
#define PM_FASTSLEEP_FASTRCOSC_Msk    (0x1Fu << PM_FASTSLEEP_FASTRCOSC_Pos) /**< \brief (PM_FASTSLEEP) RC80 or FLO */
#define PM_FASTSLEEP_FASTRCOSC(value) ((PM_FASTSLEEP_FASTRCOSC_Msk & ((value) << PM_FASTSLEEP_FASTRCOSC_Pos)))
#define PM_FASTSLEEP_DFLL           (0x1u << 24) /**< \brief (PM_FASTSLEEP) DFLL */
/* -------- PM_CONFIG : (PM Offset: 0x3F8) Configuration Register -------- */
#define PM_CONFIG_PBA               (0x1u <<  0) /**< \brief (PM_CONFIG) APBA Implemented */
#define PM_CONFIG_PBB               (0x1u <<  1) /**< \brief (PM_CONFIG) APBB Implemented */
#define PM_CONFIG_PBC               (0x1u <<  2) /**< \brief (PM_CONFIG) APBC Implemented */
#define PM_CONFIG_PBD               (0x1u <<  3) /**< \brief (PM_CONFIG) APBD Implemented */
#define PM_CONFIG_HSBPEVC           (0x1u <<  7) /**< \brief (PM_CONFIG) HSB PEVC Clock Implemented */
/* -------- PM_VERSION : (PM Offset: 0x3FC) Version Register -------- */
#define PM_VERSION_VERSION_Pos      0
#define PM_VERSION_VERSION_Msk      (0xFFFu << PM_VERSION_VERSION_Pos) /**< \brief (PM_VERSION) Version number */
#define PM_VERSION_VERSION(value)   ((PM_VERSION_VERSION_Msk & ((value) << PM_VERSION_VERSION_Pos)))
#define PM_VERSION_VARIANT_Pos      16
#define PM_VERSION_VARIANT_Msk      (0xFu << PM_VERSION_VARIANT_Pos) /**< \brief (PM_VERSION) Variant number */
#define PM_VERSION_VARIANT(value)   ((PM_VERSION_VARIANT_Msk & ((value) << PM_VERSION_VARIANT_Pos)))

/*@}*/

