Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR PTC */
/* ============================================================================= */
/** \addtogroup SAM4L4_PTC  */
/*@{*/

#define REV_PTC        0x100

#ifndef __ASSEMBLY__
/** \brief PTC hardware registers */
typedef struct {
  RoReg   Reserved1[63];
  RoReg   DMA;         /**< \brief (PTC Offset: 0xFC)  */
} Ptc;
#endif /* __ASSEMBLY__ */

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR SCIF */
/* ============================================================================= */
/** \addtogroup SAM4L4_SCIF System Control Interface */
/*@{*/

#define REV_SCIF       0x130

#ifndef __ASSEMBLY__
/** \brief ScifGcctrl hardware registers */
typedef struct {
  RwReg   GCCTRL;      /**< \brief (ScifGcctrl Offset: 0x000) Generic Clock Control */
} ScifGcctrl;
/** \brief ScifPll hardware registers */
typedef struct {
  RwReg   PLL;         /**< \brief (ScifPll Offset: 0x000) PLL0 Control Register */
} ScifPll;
/** \brief SCIF hardware registers */
typedef struct {
  WoReg   IER;         /**< \brief (SCIF Offset: 0x000) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (SCIF Offset: 0x004) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (SCIF Offset: 0x008) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (SCIF Offset: 0x00C) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (SCIF Offset: 0x010) Interrupt Clear Register */
  RoReg   PCLKSR;      /**< \brief (SCIF Offset: 0x014) Power and Clocks Status Register */
  WoReg   UNLOCK;      /**< \brief (SCIF Offset: 0x018) Unlock Register */
  RwReg   CSCR;        /**< \brief (SCIF Offset: 0x01C) Chip Specific Configuration Register */
  RwReg   OSCCTRL0;    /**< \brief (SCIF Offset: 0x020) Oscillator Control Register */
  ScifPll Pll[1]; /**< \brief (SCIF Offset: 0x024) ScifPll groups */
  RwReg   DFLL0CONF;   /**< \brief (SCIF Offset: 0x028) DFLL0 Config Register */
  RwReg   DFLL0VAL;    /**< \brief (SCIF Offset: 0x02C) DFLL Value Register */
  RwReg   DFLL0MUL;    /**< \brief (SCIF Offset: 0x030) DFLL0 Multiplier Register */
  RwReg   DFLL0STEP;   /**< \brief (SCIF Offset: 0x034) DFLL0 Step Register */
  RwReg   DFLL0SSG;    /**< \brief (SCIF Offset: 0x038) DFLL0 Spread Spectrum Generator Control Register */
  RoReg   DFLL0RATIO;  /**< \brief (SCIF Offset: 0x03C) DFLL0 Ratio Registe */
  WoReg   DFLL0SYNC;   /**< \brief (SCIF Offset: 0x040) DFLL0 Synchronization Register */
  RwReg   RCCR;        /**< \brief (SCIF Offset: 0x044) System RC Oscillator Calibration Register */
  RwReg   RCFASTCFG;   /**< \brief (SCIF Offset: 0x048) 4/8/12 MHz RC Oscillator Configuration
Register */
  RwReg   RCFASTSR;    /**< \brief (SCIF Offset: 0x04C) 4/8/12 MHz RC Oscillator Status Register */
  RwReg   RC80MCR;     /**< \brief (SCIF Offset: 0x050) 80 MHz RC Oscillator Register */
  RoReg   Reserved1[4];
  RwReg   HRPCR;       /**< \brief (SCIF Offset: 0x064) High Resolution Prescaler Control Register */
  RwReg   FPCR;        /**< \brief (SCIF Offset: 0x068) Fractional Prescaler Control Register */
  RwReg   FPMUL;       /**< \brief (SCIF Offset: 0x06C) Fractional Prescaler Multiplier Register */
  RwReg   FPDIV;       /**< \brief (SCIF Offset: 0x070) Fractional Prescaler DIVIDER Register */
  ScifGcctrl Gcctrl[12]; /**< \brief (SCIF Offset: 0x074) ScifGcctrl groups */
  RoReg   Reserved2[205];
  RoReg   RCFASTVERSION; /**< \brief (SCIF Offset: 0x3D8) 4/8/12 MHz RC Oscillator Version Register */
  RoReg   GCLKPRESCVERSION; /**< \brief (SCIF Offset: 0x3DC) Generic Clock Prescaler Version Register */
  RoReg   PLLIFAVERSION; /**< \brief (SCIF Offset: 0x3E0) PLL Version Register */
  RoReg   OSCIFAVERSION; /**< \brief (SCIF Offset: 0x3E4) Oscillator 0 Version Register */
  RoReg   DFLLIFBVERSION; /**< \brief (SCIF Offset: 0x3E8) DFLL Version Register */
  RoReg   RCOSCIFAVERSION; /**< \brief (SCIF Offset: 0x3EC) System RC Oscillator Version Register */
  RoReg   FLOVERSION;  /**< \brief (SCIF Offset: 0x3F0) Frequency Locked Oscillator Version Register */
  RoReg   RC80MVERSION; /**< \brief (SCIF Offset: 0x3F4) 80MHz RC Oscillator Version Register */
  RoReg   GCLKIFVERSION; /**< \brief (SCIF Offset: 0x3F8) Generic Clock Version Register */
  RoReg   VERSION;     /**< \brief (SCIF Offset: 0x3FC) SCIF Version Register */
} Scif;
#endif /* __ASSEMBLY__ */
/* -------- SCIF_IER : (SCIF Offset: 0x000) Interrupt Enable Register -------- */
#define SCIF_IER_OSC0RDY            (0x1u <<  0) /**< \brief (SCIF_IER)  */
#define SCIF_IER_DFLL0LOCKC         (0x1u <<  1) /**< \brief (SCIF_IER)  */
#define SCIF_IER_DFLL0LOCKF         (0x1u <<  2) /**< \brief (SCIF_IER)  */
#define SCIF_IER_DFLL0RDY           (0x1u <<  3) /**< \brief (SCIF_IER)  */
#define SCIF_IER_DFLL0RCS           (0x1u <<  4) /**< \brief (SCIF_IER)  */
#define SCIF_IER_DFLL0OOB           (0x1u <<  5) /**< \brief (SCIF_IER)  */
#define SCIF_IER_PLLLOCK0           (0x1u <<  6) /**< \brief (SCIF_IER)  */
#define SCIF_IER_PLLLOCKLOST0       (0x1u <<  7) /**< \brief (SCIF_IER)  */
#define SCIF_IER_RCFASTLOCK         (0x1u << 13) /**< \brief (SCIF_IER)  */
#define SCIF_IER_RCFASTLOCKLOST     (0x1u << 14) /**< \brief (SCIF_IER)  */
#define SCIF_IER_AE                 (0x1u << 31) /**< \brief (SCIF_IER)  */
/* -------- SCIF_IDR : (SCIF Offset: 0x004) Interrupt Disable Register -------- */
#define SCIF_IDR_OSC0RDY            (0x1u <<  0) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_DFLL0LOCKC         (0x1u <<  1) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_DFLL0LOCKF         (0x1u <<  2) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_DFLL0RDY           (0x1u <<  3) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_DFLL0RCS           (0x1u <<  4) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_DFLL0OOB           (0x1u <<  5) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_PLLLOCK0           (0x1u <<  6) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_PLLLOCKLOST0       (0x1u <<  7) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_RCFASTLOCK         (0x1u << 13) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_RCFASTLOCKLOST     (0x1u << 14) /**< \brief (SCIF_IDR)  */
#define SCIF_IDR_AE                 (0x1u << 31) /**< \brief (SCIF_IDR)  */
/* -------- SCIF_IMR : (SCIF Offset: 0x008) Interrupt Mask Register -------- */
#define SCIF_IMR_OSC0RDY            (0x1u <<  0) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_DFLL0LOCKC         (0x1u <<  1) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_DFLL0LOCKF         (0x1u <<  2) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_DFLL0RDY           (0x1u <<  3) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_DFLL0RCS           (0x1u <<  4) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_DFLL0OOB           (0x1u <<  5) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_PLLLOCK0           (0x1u <<  6) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_PLLLOCKLOST0       (0x1u <<  7) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_RCFASTLOCK         (0x1u << 13) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_RCFASTLOCKLOST     (0x1u << 14) /**< \brief (SCIF_IMR)  */
#define SCIF_IMR_AE                 (0x1u << 31) /**< \brief (SCIF_IMR)  */
/* -------- SCIF_ISR : (SCIF Offset: 0x00C) Interrupt Status Register -------- */
#define SCIF_ISR_OSC0RDY            (0x1u <<  0) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_DFLL0LOCKC         (0x1u <<  1) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_DFLL0LOCKF         (0x1u <<  2) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_DFLL0RDY           (0x1u <<  3) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_DFLL0RCS           (0x1u <<  4) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_DFLL0OOB           (0x1u <<  5) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_PLLLOCK0           (0x1u <<  6) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_PLLLOCKLOST0       (0x1u <<  7) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_RCFASTLOCK         (0x1u << 13) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_RCFASTLOCKLOST     (0x1u << 14) /**< \brief (SCIF_ISR)  */
#define SCIF_ISR_AE                 (0x1u << 31) /**< \brief (SCIF_ISR)  */
/* -------- SCIF_ICR : (SCIF Offset: 0x010) Interrupt Clear Register -------- */
#define SCIF_ICR_OSC0RDY            (0x1u <<  0) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_DFLL0LOCKC         (0x1u <<  1) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_DFLL0LOCKF         (0x1u <<  2) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_DFLL0RDY           (0x1u <<  3) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_DFLL0RCS           (0x1u <<  4) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_DFLL0OOB           (0x1u <<  5) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_PLLLOCK0           (0x1u <<  6) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_PLLLOCKLOST0       (0x1u <<  7) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_RCFASTLOCK         (0x1u << 13) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_RCFASTLOCKLOST     (0x1u << 14) /**< \brief (SCIF_ICR)  */
#define SCIF_ICR_AE                 (0x1u << 31) /**< \brief (SCIF_ICR)  */
/* -------- SCIF_PCLKSR : (SCIF Offset: 0x014) Power and Clocks Status Register -------- */
#define SCIF_PCLKSR_OSC0RDY         (0x1u <<  0) /**< \brief (SCIF_PCLKSR) OSC0 Ready */
#define SCIF_PCLKSR_DFLL0LOCKC      (0x1u <<  1) /**< \brief (SCIF_PCLKSR) DFLL0 Locked on Coarse Value */
#define SCIF_PCLKSR_DFLL0LOCKF      (0x1u <<  2) /**< \brief (SCIF_PCLKSR) DFLL0 Locked on Fine Value */
#define SCIF_PCLKSR_DFLL0RDY        (0x1u <<  3) /**< \brief (SCIF_PCLKSR) DFLL0 Synchronization Ready */
#define SCIF_PCLKSR_DFLL0RCS        (0x1u <<  4) /**< \brief (SCIF_PCLKSR) DFLL0 Reference Clock Stopped */
#define SCIF_PCLKSR_DFLL0OOB        (0x1u <<  5) /**< \brief (SCIF_PCLKSR) DFLL0 Track Out Of Bounds */
#define SCIF_PCLKSR_PLL0LOCK        (0x1u <<  6) /**< \brief (SCIF_PCLKSR) PLL0 Locked on Accurate value */
#define SCIF_PCLKSR_PLLL0LOCKLOST   (0x1u <<  7) /**< \brief (SCIF_PCLKSR) PLL0 lock lost value */
#define SCIF_PCLKSR_RCFASTLOCK      (0x1u << 13) /**< \brief (SCIF_PCLKSR) RCFAST Locked on Accurate value */
#define SCIF_PCLKSR_RCFASTLOCKLOST  (0x1u << 14) /**< \brief (SCIF_PCLKSR) RCFAST lock lost value */
/* -------- SCIF_UNLOCK : (SCIF Offset: 0x018) Unlock Register -------- */
#define SCIF_UNLOCK_ADDR_Pos        0
#define SCIF_UNLOCK_ADDR_Msk        (0x3FFu << SCIF_UNLOCK_ADDR_Pos) /**< \brief (SCIF_UNLOCK) Unlock Address */
#define SCIF_UNLOCK_ADDR(value)     ((SCIF_UNLOCK_ADDR_Msk & ((value) << SCIF_UNLOCK_ADDR_Pos)))
#define SCIF_UNLOCK_KEY_Pos         24
#define SCIF_UNLOCK_KEY_Msk         (0xFFu << SCIF_UNLOCK_KEY_Pos) /**< \brief (SCIF_UNLOCK) Unlock Key */
#define SCIF_UNLOCK_KEY(value)      ((SCIF_UNLOCK_KEY_Msk & ((value) << SCIF_UNLOCK_KEY_Pos)))
/* -------- SCIF_OSCCTRL0 : (SCIF Offset: 0x020) Oscillator Control Register -------- */
#define SCIF_OSCCTRL0_MODE          (0x1u <<  0) /**< \brief (SCIF_OSCCTRL0) Oscillator Mode */
#define SCIF_OSCCTRL0_GAIN_Pos      1
#define SCIF_OSCCTRL0_GAIN_Msk      (0x3u << SCIF_OSCCTRL0_GAIN_Pos) /**< \brief (SCIF_OSCCTRL0) Gain */
#define SCIF_OSCCTRL0_GAIN(value)   ((SCIF_OSCCTRL0_GAIN_Msk & ((value) << SCIF_OSCCTRL0_GAIN_Pos)))
#define SCIF_OSCCTRL0_AGC           (0x1u <<  3) /**< \brief (SCIF_OSCCTRL0) Automatic Gain Control */
#define SCIF_OSCCTRL0_STARTUP_Pos    8
#define SCIF_OSCCTRL0_STARTUP_Msk    (0xFu << SCIF_OSCCTRL0_STARTUP_Pos) /**< \brief (SCIF_OSCCTRL0) Oscillator Start-up Time */
#define SCIF_OSCCTRL0_STARTUP(value) ((SCIF_OSCCTRL0_STARTUP_Msk & ((value) << SCIF_OSCCTRL0_STARTUP_Pos)))
#define SCIF_OSCCTRL0_OSCEN         (0x1u << 16) /**< \brief (SCIF_OSCCTRL0) Oscillator Enable */
/* -------- SCIF_PLL : (SCIF Offset: 0x024) Pll PLL0 Control Register -------- */
#define SCIF_PLL_PLLEN              (0x1u <<  0) /**< \brief (SCIF_PLL) PLL Enable */
#define SCIF_PLL_PLLOSC_Pos         1
#define SCIF_PLL_PLLOSC_Msk         (0x3u << SCIF_PLL_PLLOSC_Pos) /**< \brief (SCIF_PLL) PLL Oscillator Select */
#define SCIF_PLL_PLLOSC(value)      ((SCIF_PLL_PLLOSC_Msk & ((value) << SCIF_PLL_PLLOSC_Pos)))
#define SCIF_PLL_PLLOPT_Pos         3
#define SCIF_PLL_PLLOPT_Msk         (0x7u << SCIF_PLL_PLLOPT_Pos) /**< \brief (SCIF_PLL) PLL Option */
#define SCIF_PLL_PLLOPT(value)      ((SCIF_PLL_PLLOPT_Msk & ((value) << SCIF_PLL_PLLOPT_Pos)))
#define SCIF_PLL_PLLDIV_Pos         8
#define SCIF_PLL_PLLDIV_Msk         (0xFu << SCIF_PLL_PLLDIV_Pos) /**< \brief (SCIF_PLL) PLL Division Factor */
#define SCIF_PLL_PLLDIV(value)      ((SCIF_PLL_PLLDIV_Msk & ((value) << SCIF_PLL_PLLDIV_Pos)))
#define SCIF_PLL_PLLMUL_Pos         16
#define SCIF_PLL_PLLMUL_Msk         (0xFu << SCIF_PLL_PLLMUL_Pos) /**< \brief (SCIF_PLL) PLL Multiply Factor */
#define SCIF_PLL_PLLMUL(value)      ((SCIF_PLL_PLLMUL_Msk & ((value) << SCIF_PLL_PLLMUL_Pos)))
#define SCIF_PLL_PLLCOUNT_Pos       24
#define SCIF_PLL_PLLCOUNT_Msk       (0x3Fu << SCIF_PLL_PLLCOUNT_Pos) /**< \brief (SCIF_PLL) PLL Count */
#define SCIF_PLL_PLLCOUNT(value)    ((SCIF_PLL_PLLCOUNT_Msk & ((value) << SCIF_PLL_PLLCOUNT_Pos)))
/* -------- SCIF_DFLL0CONF : (SCIF Offset: 0x028) DFLL0 Config Register -------- */
#define SCIF_DFLL0CONF_EN           (0x1u <<  0) /**< \brief (SCIF_DFLL0CONF) Enable */
#define SCIF_DFLL0CONF_MODE         (0x1u <<  1) /**< \brief (SCIF_DFLL0CONF) Mode Selection */
#define SCIF_DFLL0CONF_STABLE       (0x1u <<  2) /**< \brief (SCIF_DFLL0CONF) Stable DFLL Frequency */
#define SCIF_DFLL0CONF_LLAW         (0x1u <<  3) /**< \brief (SCIF_DFLL0CONF) Lose Lock After Wake */
#define SCIF_DFLL0CONF_CCDIS        (0x1u <<  5) /**< \brief (SCIF_DFLL0CONF) Chill Cycle Disable */
#define SCIF_DFLL0CONF_QLDIS        (0x1u <<  6) /**< \brief (SCIF_DFLL0CONF) Quick Lock Disable */
#define SCIF_DFLL0CONF_RANGE_Pos    16
#define SCIF_DFLL0CONF_RANGE_Msk    (0x3u << SCIF_DFLL0CONF_RANGE_Pos) /**< \brief (SCIF_DFLL0CONF) Range Value */
#define SCIF_DFLL0CONF_RANGE(value) ((SCIF_DFLL0CONF_RANGE_Msk & ((value) << SCIF_DFLL0CONF_RANGE_Pos)))
#define SCIF_DFLL0CONF_FCD          (0x1u << 23) /**< \brief (SCIF_DFLL0CONF) Fuse Calibration Done */
#define SCIF_DFLL0CONF_CALIB_Pos    24
#define SCIF_DFLL0CONF_CALIB_Msk    (0xFu << SCIF_DFLL0CONF_CALIB_Pos) /**< \brief (SCIF_DFLL0CONF) Calibration Value */
#define SCIF_DFLL0CONF_CALIB(value) ((SCIF_DFLL0CONF_CALIB_Msk & ((value) << SCIF_DFLL0CONF_CALIB_Pos)))
/* -------- SCIF_DFLL0VAL : (SCIF Offset: 0x02C) DFLL Value Register -------- */
#define SCIF_DFLL0VAL_FINE_Pos      0
#define SCIF_DFLL0VAL_FINE_Msk      (0xFFu << SCIF_DFLL0VAL_FINE_Pos) /**< \brief (SCIF_DFLL0VAL) Fine Value */
#define SCIF_DFLL0VAL_FINE(value)   ((SCIF_DFLL0VAL_FINE_Msk & ((value) << SCIF_DFLL0VAL_FINE_Pos)))
#define SCIF_DFLL0VAL_COARSE_Pos    16
#define SCIF_DFLL0VAL_COARSE_Msk    (0x1Fu << SCIF_DFLL0VAL_COARSE_Pos) /**< \brief (SCIF_DFLL0VAL) Coarse Value */
#define SCIF_DFLL0VAL_COARSE(value) ((SCIF_DFLL0VAL_COARSE_Msk & ((value) << SCIF_DFLL0VAL_COARSE_Pos)))
/* -------- SCIF_DFLL0MUL : (SCIF Offset: 0x030) DFLL0 Multiplier Register -------- */
#define SCIF_DFLL0MUL_MUL_Pos       0
#define SCIF_DFLL0MUL_MUL_Msk       (0xFFFFu << SCIF_DFLL0MUL_MUL_Pos) /**< \brief (SCIF_DFLL0MUL) DFLL Multiply Factor */
#define SCIF_DFLL0MUL_MUL(value)    ((SCIF_DFLL0MUL_MUL_Msk & ((value) << SCIF_DFLL0MUL_MUL_Pos)))
/* -------- SCIF_DFLL0STEP : (SCIF Offset: 0x034) DFLL0 Step Register -------- */
#define SCIF_DFLL0STEP_FSTEP_Pos    0
#define SCIF_DFLL0STEP_FSTEP_Msk    (0xFFu << SCIF_DFLL0STEP_FSTEP_Pos) /**< \brief (SCIF_DFLL0STEP) Fine Maximum Step */
#define SCIF_DFLL0STEP_FSTEP(value) ((SCIF_DFLL0STEP_FSTEP_Msk & ((value) << SCIF_DFLL0STEP_FSTEP_Pos)))
#define SCIF_DFLL0STEP_CSTEP_Pos    16
#define SCIF_DFLL0STEP_CSTEP_Msk    (0x1Fu << SCIF_DFLL0STEP_CSTEP_Pos) /**< \brief (SCIF_DFLL0STEP) Coarse Maximum Step */
#define SCIF_DFLL0STEP_CSTEP(value) ((SCIF_DFLL0STEP_CSTEP_Msk & ((value) << SCIF_DFLL0STEP_CSTEP_Pos)))
/* -------- SCIF_DFLL0SSG : (SCIF Offset: 0x038) DFLL0 Spread Spectrum Generator Control Register -------- */
#define SCIF_DFLL0SSG_EN            (0x1u <<  0) /**< \brief (SCIF_DFLL0SSG) Enable */
#define SCIF_DFLL0SSG_PRBS          (0x1u <<  1) /**< \brief (SCIF_DFLL0SSG) Pseudo Random Bit Sequence */
#define SCIF_DFLL0SSG_AMPLITUDE_Pos    8
#define SCIF_DFLL0SSG_AMPLITUDE_Msk    (0x1Fu << SCIF_DFLL0SSG_AMPLITUDE_Pos) /**< \brief (SCIF_DFLL0SSG) SSG Amplitude */
#define SCIF_DFLL0SSG_AMPLITUDE(value) ((SCIF_DFLL0SSG_AMPLITUDE_Msk & ((value) << SCIF_DFLL0SSG_AMPLITUDE_Pos)))
#define SCIF_DFLL0SSG_STEPSIZE_Pos    16
#define SCIF_DFLL0SSG_STEPSIZE_Msk    (0x1Fu << SCIF_DFLL0SSG_STEPSIZE_Pos) /**< \brief (SCIF_DFLL0SSG) SSG Step Size */
#define SCIF_DFLL0SSG_STEPSIZE(value) ((SCIF_DFLL0SSG_STEPSIZE_Msk & ((value) << SCIF_DFLL0SSG_STEPSIZE_Pos)))
/* -------- SCIF_DFLL0RATIO : (SCIF Offset: 0x03C) DFLL0 Ratio Registe -------- */
#define SCIF_DFLL0RATIO_RATIODIFF_Pos    0
#define SCIF_DFLL0RATIO_RATIODIFF_Msk    (0xFFFFu << SCIF_DFLL0RATIO_RATIODIFF_Pos) /**< \brief (SCIF_DFLL0RATIO) Multiplication Ratio Difference */
#define SCIF_DFLL0RATIO_RATIODIFF(value) ((SCIF_DFLL0RATIO_RATIODIFF_Msk & ((value) << SCIF_DFLL0RATIO_RATIODIFF_Pos)))
/* -------- SCIF_DFLL0SYNC : (SCIF Offset: 0x040) DFLL0 Synchronization Register -------- */
#define SCIF_DFLL0SYNC_SYNC         (0x1u <<  0) /**< \brief (SCIF_DFLL0SYNC) Synchronization */
/* -------- SCIF_RCCR : (SCIF Offset: 0x044) System RC Oscillator Calibration Register -------- */
#define SCIF_RCCR_CALIB_Pos         0
#define SCIF_RCCR_CALIB_Msk         (0x3FFu << SCIF_RCCR_CALIB_Pos) /**< \brief (SCIF_RCCR) Calibration Value */
#define SCIF_RCCR_CALIB(value)      ((SCIF_RCCR_CALIB_Msk & ((value) << SCIF_RCCR_CALIB_Pos)))
#define SCIF_RCCR_FCD               (0x1u << 16) /**< \brief (SCIF_RCCR) Flash Calibration Done */
/* -------- SCIF_RCFASTCFG : (SCIF Offset: 0x048) 4/8/12 MHz RC Oscillator Configuration
Register -------- */
#define SCIF_RCFASTCFG_EN           (0x1u <<  0) /**< \brief (SCIF_RCFASTCFG) Oscillator Enable */
#define SCIF_RCFASTCFG_TUNEEN       (0x1u <<  1) /**< \brief (SCIF_RCFASTCFG) Tuner Enable */
#define SCIF_RCFASTCFG_JITMODE      (0x1u <<  2) /**< \brief (SCIF_RCFASTCFG) Jitter Mode */
#define SCIF_RCFASTCFG_NBPERIODS_Pos    4
#define SCIF_RCFASTCFG_NBPERIODS_Msk    (0x7u << SCIF_RCFASTCFG_NBPERIODS_Pos) /**< \brief (SCIF_RCFASTCFG) Number of 32kHz Periods */
#define SCIF_RCFASTCFG_NBPERIODS(value) ((SCIF_RCFASTCFG_NBPERIODS_Msk & ((value) << SCIF_RCFASTCFG_NBPERIODS_Pos)))
#define SCIF_RCFASTCFG_FCD          (0x1u <<  7) /**< \brief (SCIF_RCFASTCFG) RCFAST Fuse Calibration Done */
#define SCIF_RCFASTCFG_FRANGE_Pos    8
#define SCIF_RCFASTCFG_FRANGE_Msk    (0x3u << SCIF_RCFASTCFG_FRANGE_Pos) /**< \brief (SCIF_RCFASTCFG) Frequency Range */
#define SCIF_RCFASTCFG_FRANGE(value) ((SCIF_RCFASTCFG_FRANGE_Msk & ((value) << SCIF_RCFASTCFG_FRANGE_Pos)))
#define SCIF_RCFASTCFG_LOCKMARGIN_Pos    12
#define SCIF_RCFASTCFG_LOCKMARGIN_Msk    (0xFu << SCIF_RCFASTCFG_LOCKMARGIN_Pos) /**< \brief (SCIF_RCFASTCFG) Accepted Count Error for Lock */
#define SCIF_RCFASTCFG_LOCKMARGIN(value) ((SCIF_RCFASTCFG_LOCKMARGIN_Msk & ((value) << SCIF_RCFASTCFG_LOCKMARGIN_Pos)))
#define SCIF_RCFASTCFG_CALIB_Pos    16
#define SCIF_RCFASTCFG_CALIB_Msk    (0x7Fu << SCIF_RCFASTCFG_CALIB_Pos) /**< \brief (SCIF_RCFASTCFG) Oscillator Calibration Value */
#define SCIF_RCFASTCFG_CALIB(value) ((SCIF_RCFASTCFG_CALIB_Msk & ((value) << SCIF_RCFASTCFG_CALIB_Pos)))
/* -------- SCIF_RCFASTSR : (SCIF Offset: 0x04C) 4/8/12 MHz RC Oscillator Status Register -------- */
#define SCIF_RCFASTSR_CURTRIM_Pos    0
#define SCIF_RCFASTSR_CURTRIM_Msk    (0x7Fu << SCIF_RCFASTSR_CURTRIM_Pos) /**< \brief (SCIF_RCFASTSR) Current Trim Value */
#define SCIF_RCFASTSR_CURTRIM(value) ((SCIF_RCFASTSR_CURTRIM_Msk & ((value) << SCIF_RCFASTSR_CURTRIM_Pos)))
#define SCIF_RCFASTSR_CNTERR_Pos    16
#define SCIF_RCFASTSR_CNTERR_Msk    (0x1Fu << SCIF_RCFASTSR_CNTERR_Pos) /**< \brief (SCIF_RCFASTSR) Current Count Error */
#define SCIF_RCFASTSR_CNTERR(value) ((SCIF_RCFASTSR_CNTERR_Msk & ((value) << SCIF_RCFASTSR_CNTERR_Pos)))
#define SCIF_RCFASTSR_SIGN          (0x1u << 21) /**< \brief (SCIF_RCFASTSR) Sign of Current Count Error */
#define SCIF_RCFASTSR_LOCK          (0x1u << 24) /**< \brief (SCIF_RCFASTSR) Lock */
#define SCIF_RCFASTSR_LOCKLOST      (0x1u << 25) /**< \brief (SCIF_RCFASTSR) Lock Lost */
#define SCIF_RCFASTSR_UPDATED       (0x1u << 31) /**< \brief (SCIF_RCFASTSR) Current Trim Value Updated */
/* -------- SCIF_RC80MCR : (SCIF Offset: 0x050) 80 MHz RC Oscillator Register -------- */
#define SCIF_RC80MCR_EN             (0x1u <<  0) /**< \brief (SCIF_RC80MCR) Enable */
#define SCIF_RC80MCR_FCD            (0x1u <<  7) /**< \brief (SCIF_RC80MCR) Flash Calibration Done */
#define SCIF_RC80MCR_CALIB_Pos      16
#define SCIF_RC80MCR_CALIB_Msk      (0x3u << SCIF_RC80MCR_CALIB_Pos) /**< \brief (SCIF_RC80MCR) Calibration Value */
#define SCIF_RC80MCR_CALIB(value)   ((SCIF_RC80MCR_CALIB_Msk & ((value) << SCIF_RC80MCR_CALIB_Pos)))
/* -------- SCIF_HRPCR : (SCIF Offset: 0x064) High Resolution Prescaler Control Register -------- */
#define SCIF_HRPCR_HRPEN            (0x1u <<  0) /**< \brief (SCIF_HRPCR) High Resolution Prescaler Enable */
#define SCIF_HRPCR_CKSEL_Pos        1
#define SCIF_HRPCR_CKSEL_Msk        (0x7u << SCIF_HRPCR_CKSEL_Pos) /**< \brief (SCIF_HRPCR) Clock Input Selection */
#define SCIF_HRPCR_CKSEL(value)     ((SCIF_HRPCR_CKSEL_Msk & ((value) << SCIF_HRPCR_CKSEL_Pos)))
#define SCIF_HRPCR_HRCOUNT_Pos      8
#define SCIF_HRPCR_HRCOUNT_Msk      (0xFFFFFFu << SCIF_HRPCR_HRCOUNT_Pos) /**< \brief (SCIF_HRPCR) High Resolution Counter */
#define SCIF_HRPCR_HRCOUNT(value)   ((SCIF_HRPCR_HRCOUNT_Msk & ((value) << SCIF_HRPCR_HRCOUNT_Pos)))
/* -------- SCIF_FPCR : (SCIF Offset: 0x068) Fractional Prescaler Control Register -------- */
#define SCIF_FPCR_FPEN              (0x1u <<  0) /**< \brief (SCIF_FPCR) High Resolution Prescaler Enable */
#define SCIF_FPCR_CKSEL_Pos         1
#define SCIF_FPCR_CKSEL_Msk         (0x7u << SCIF_FPCR_CKSEL_Pos) /**< \brief (SCIF_FPCR) Clock Input Selection */
#define SCIF_FPCR_CKSEL(value)      ((SCIF_FPCR_CKSEL_Msk & ((value) << SCIF_FPCR_CKSEL_Pos)))
/* -------- SCIF_FPMUL : (SCIF Offset: 0x06C) Fractional Prescaler Multiplier Register -------- */
#define SCIF_FPMUL_FPMUL_Pos        0
#define SCIF_FPMUL_FPMUL_Msk        (0xFFFFu << SCIF_FPMUL_FPMUL_Pos) /**< \brief (SCIF_FPMUL) Fractional Prescaler Multiplication Factor */
#define SCIF_FPMUL_FPMUL(value)     ((SCIF_FPMUL_FPMUL_Msk & ((value) << SCIF_FPMUL_FPMUL_Pos)))
/* -------- SCIF_FPDIV : (SCIF Offset: 0x070) Fractional Prescaler DIVIDER Register -------- */
#define SCIF_FPDIV_FPDIV_Pos        0
#define SCIF_FPDIV_FPDIV_Msk        (0xFFFFu << SCIF_FPDIV_FPDIV_Pos) /**< \brief (SCIF_FPDIV) Fractional Prescaler Division Factor */
#define SCIF_FPDIV_FPDIV(value)     ((SCIF_FPDIV_FPDIV_Msk & ((value) << SCIF_FPDIV_FPDIV_Pos)))
/* -------- SCIF_GCCTRL : (SCIF Offset: 0x074) Gcctrl Generic Clock Control -------- */
#define SCIF_GCCTRL_CEN             (0x1u <<  0) /**< \brief (SCIF_GCCTRL) Clock Enable */
#define SCIF_GCCTRL_DIVEN           (0x1u <<  1) /**< \brief (SCIF_GCCTRL) Divide Enable */
#define SCIF_GCCTRL_OSCSEL_Pos      8
#define SCIF_GCCTRL_OSCSEL_Msk      (0x1Fu << SCIF_GCCTRL_OSCSEL_Pos) /**< \brief (SCIF_GCCTRL) Clock Select */
#define SCIF_GCCTRL_OSCSEL(value)   ((SCIF_GCCTRL_OSCSEL_Msk & ((value) << SCIF_GCCTRL_OSCSEL_Pos)))
#define SCIF_GCCTRL_DIV_Pos         16
#define SCIF_GCCTRL_DIV_Msk         (0xFFFFu << SCIF_GCCTRL_DIV_Pos) /**< \brief (SCIF_GCCTRL) Division Factor */
