Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief SMAP hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (SMAP Offset: 0x00) Control Register */
  RoReg   SR;          /**< \brief (SMAP Offset: 0x04) Status Register */
  WoReg   SCR;         /**< \brief (SMAP Offset: 0x08) Status Clear Register */
  RwReg   ADDR;        /**< \brief (SMAP Offset: 0x0C) Address Register */
  RwReg   LENGTH;      /**< \brief (SMAP Offset: 0x10) Length Register */
  RwReg   DATA;        /**< \brief (SMAP Offset: 0x14) Data Register */
  RoReg   Reserved1[4];
  RoReg   VERSION;     /**< \brief (SMAP Offset: 0x28) VERSION register */
  RoReg   Reserved2[49];
  RoReg   CIDR;        /**< \brief (SMAP Offset: 0xF0) Chip ID Register */
  RoReg   EXID;        /**< \brief (SMAP Offset: 0xF4) Chip ID Extension Register */
  RoReg   Reserved3[1];
  RoReg   IDR;         /**< \brief (SMAP Offset: 0xFC) AP Identification register */
} Smap;
#endif /* __ASSEMBLY__ */
/* -------- SMAP_CR : (SMAP Offset: 0x00) Control Register -------- */
#define SMAP_CR_EN                  (0x1u <<  0) /**< \brief (SMAP_CR) Enable */
#define SMAP_CR_DIS                 (0x1u <<  1) /**< \brief (SMAP_CR) Disable */
#define SMAP_CR_CRC                 (0x1u <<  2) /**< \brief (SMAP_CR) User Page Read */
#define SMAP_CR_FSPR                (0x1u <<  3) /**< \brief (SMAP_CR) Flash Supplementary Page Read */
#define SMAP_CR_CE                  (0x1u <<  4) /**< \brief (SMAP_CR) Chip Erase */
/* -------- SMAP_SR : (SMAP Offset: 0x04) Status Register -------- */
#define SMAP_SR_DONE                (0x1u <<  0) /**< \brief (SMAP_SR) Operation done */
#define SMAP_SR_HCR                 (0x1u <<  1) /**< \brief (SMAP_SR) Hold Core reset */
#define SMAP_SR_BERR                (0x1u <<  2) /**< \brief (SMAP_SR) Bus error */
#define SMAP_SR_FAIL                (0x1u <<  3) /**< \brief (SMAP_SR) Failure */
#define SMAP_SR_LCK                 (0x1u <<  4) /**< \brief (SMAP_SR) Lock */
#define SMAP_SR_EN                  (0x1u <<  8) /**< \brief (SMAP_SR) Enabled */
#define SMAP_SR_PROT                (0x1u <<  9) /**< \brief (SMAP_SR) Protected */
#define SMAP_SR_DBGP                (0x1u << 10) /**< \brief (SMAP_SR) Debugger Present */
#define SMAP_SR_STATE_Pos           24
#define SMAP_SR_STATE_Msk           (0x7u << SMAP_SR_STATE_Pos) /**< \brief (SMAP_SR) State */
#define SMAP_SR_STATE(value)        ((SMAP_SR_STATE_Msk & ((value) << SMAP_SR_STATE_Pos)))
/* -------- SMAP_SCR : (SMAP Offset: 0x08) Status Clear Register -------- */
#define SMAP_SCR_DONE               (0x1u <<  0) /**< \brief (SMAP_SCR) Done */
#define SMAP_SCR_HCR                (0x1u <<  1) /**< \brief (SMAP_SCR) Hold Core Register */
#define SMAP_SCR_BERR               (0x1u <<  2) /**< \brief (SMAP_SCR) Bus error */
#define SMAP_SCR_FAIL               (0x1u <<  3) /**< \brief (SMAP_SCR) Failure */
#define SMAP_SCR_LCK                (0x1u <<  4) /**< \brief (SMAP_SCR) Lock error */
/* -------- SMAP_ADDR : (SMAP Offset: 0x0C) Address Register -------- */
#define SMAP_ADDR_ADDR_Pos          2
#define SMAP_ADDR_ADDR_Msk          (0x3FFFFFFFu << SMAP_ADDR_ADDR_Pos) /**< \brief (SMAP_ADDR) Address Value */
#define SMAP_ADDR_ADDR(value)       ((SMAP_ADDR_ADDR_Msk & ((value) << SMAP_ADDR_ADDR_Pos)))
/* -------- SMAP_LENGTH : (SMAP Offset: 0x10) Length Register -------- */
#define SMAP_LENGTH_LENGTH_Pos      2
#define SMAP_LENGTH_LENGTH_Msk      (0x3FFFFFFFu << SMAP_LENGTH_LENGTH_Pos) /**< \brief (SMAP_LENGTH) Length Register */
#define SMAP_LENGTH_LENGTH(value)   ((SMAP_LENGTH_LENGTH_Msk & ((value) << SMAP_LENGTH_LENGTH_Pos)))
/* -------- SMAP_DATA : (SMAP Offset: 0x14) Data Register -------- */
#define SMAP_DATA_DATA_Pos          0
#define SMAP_DATA_DATA_Msk          (0xFFFFFFFFu << SMAP_DATA_DATA_Pos) /**< \brief (SMAP_DATA) Generic data register */
#define SMAP_DATA_DATA(value)       ((SMAP_DATA_DATA_Msk & ((value) << SMAP_DATA_DATA_Pos)))
/* -------- SMAP_VERSION : (SMAP Offset: 0x28) VERSION register -------- */
#define SMAP_VERSION_VERSION_Pos    0
#define SMAP_VERSION_VERSION_Msk    (0xFFFu << SMAP_VERSION_VERSION_Pos) /**< \brief (SMAP_VERSION) Version number */
#define SMAP_VERSION_VERSION(value) ((SMAP_VERSION_VERSION_Msk & ((value) << SMAP_VERSION_VERSION_Pos)))
#define SMAP_VERSION_VARIANT_Pos    16
#define SMAP_VERSION_VARIANT_Msk    (0xFu << SMAP_VERSION_VARIANT_Pos) /**< \brief (SMAP_VERSION) Variant number */
#define SMAP_VERSION_VARIANT(value) ((SMAP_VERSION_VARIANT_Msk & ((value) << SMAP_VERSION_VARIANT_Pos)))
/* -------- SMAP_CIDR : (SMAP Offset: 0xF0) Chip ID Register -------- */
#define SMAP_CIDR_VERSION_Pos       0
#define SMAP_CIDR_VERSION_Msk       (0x1Fu << SMAP_CIDR_VERSION_Pos) /**< \brief (SMAP_CIDR) Version of the Device */
#define SMAP_CIDR_VERSION(value)    ((SMAP_CIDR_VERSION_Msk & ((value) << SMAP_CIDR_VERSION_Pos)))
#define SMAP_CIDR_EPROC_Pos         5
#define SMAP_CIDR_EPROC_Msk         (0x7u << SMAP_CIDR_EPROC_Pos) /**< \brief (SMAP_CIDR) Embedded Processor */
#define SMAP_CIDR_EPROC(value)      ((SMAP_CIDR_EPROC_Msk & ((value) << SMAP_CIDR_EPROC_Pos)))
#define SMAP_CIDR_NVPSIZ_Pos        8
#define SMAP_CIDR_NVPSIZ_Msk        (0xFu << SMAP_CIDR_NVPSIZ_Pos) /**< \brief (SMAP_CIDR) Nonvolatile Program Memory Size */
#define SMAP_CIDR_NVPSIZ(value)     ((SMAP_CIDR_NVPSIZ_Msk & ((value) << SMAP_CIDR_NVPSIZ_Pos)))
#define SMAP_CIDR_NVPSIZ2_Pos       12
#define SMAP_CIDR_NVPSIZ2_Msk       (0xFu << SMAP_CIDR_NVPSIZ2_Pos) /**< \brief (SMAP_CIDR) Second Nonvolatile Program Memory Size */
#define SMAP_CIDR_NVPSIZ2(value)    ((SMAP_CIDR_NVPSIZ2_Msk & ((value) << SMAP_CIDR_NVPSIZ2_Pos)))
#define SMAP_CIDR_SRAMSIZ_Pos       16
#define SMAP_CIDR_SRAMSIZ_Msk       (0x1Fu << SMAP_CIDR_SRAMSIZ_Pos) /**< \brief (SMAP_CIDR) Internal SRAM Size */
#define SMAP_CIDR_SRAMSIZ(value)    ((SMAP_CIDR_SRAMSIZ_Msk & ((value) << SMAP_CIDR_SRAMSIZ_Pos)))
#define SMAP_CIDR_ARCH_Pos          21
#define SMAP_CIDR_ARCH_Msk          (0x7Fu << SMAP_CIDR_ARCH_Pos) /**< \brief (SMAP_CIDR) Architecture Identifier */
#define SMAP_CIDR_ARCH(value)       ((SMAP_CIDR_ARCH_Msk & ((value) << SMAP_CIDR_ARCH_Pos)))
#define SMAP_CIDR_NVPTYP_Pos        28
#define SMAP_CIDR_NVPTYP_Msk        (0x7u << SMAP_CIDR_NVPTYP_Pos) /**< \brief (SMAP_CIDR) Nonvolatile Program Memory Type */
#define SMAP_CIDR_NVPTYP(value)     ((SMAP_CIDR_NVPTYP_Msk & ((value) << SMAP_CIDR_NVPTYP_Pos)))
#define SMAP_CIDR_EXT               (0x1u << 31) /**< \brief (SMAP_CIDR) Extension Flag */
/* -------- SMAP_EXID : (SMAP Offset: 0xF4) Chip ID Extension Register -------- */
#define SMAP_EXID_EXID_Pos          0
#define SMAP_EXID_EXID_Msk          (0xFFFFFFFFu << SMAP_EXID_EXID_Pos) /**< \brief (SMAP_EXID) Chip ID Extension */
#define SMAP_EXID_EXID(value)       ((SMAP_EXID_EXID_Msk & ((value) << SMAP_EXID_EXID_Pos)))
/* -------- SMAP_IDR : (SMAP Offset: 0xFC) AP Identification register -------- */
#define SMAP_IDR_APIDV_Pos          0
#define SMAP_IDR_APIDV_Msk          (0xFu << SMAP_IDR_APIDV_Pos) /**< \brief (SMAP_IDR) AP Identification Variant */
#define SMAP_IDR_APIDV(value)       ((SMAP_IDR_APIDV_Msk & ((value) << SMAP_IDR_APIDV_Pos)))
#define SMAP_IDR_APID_Pos           4
#define SMAP_IDR_APID_Msk           (0xFu << SMAP_IDR_APID_Pos) /**< \brief (SMAP_IDR) AP Identification */
#define SMAP_IDR_APID(value)        ((SMAP_IDR_APID_Msk & ((value) << SMAP_IDR_APID_Pos)))
#define SMAP_IDR_CLSS               (0x1u << 16) /**< \brief (SMAP_IDR) Class */
#define SMAP_IDR_IC_Pos             17
#define SMAP_IDR_IC_Msk             (0x7Fu << SMAP_IDR_IC_Pos) /**< \brief (SMAP_IDR) JEP-106 Identity Code */
#define SMAP_IDR_IC(value)          ((SMAP_IDR_IC_Msk & ((value) << SMAP_IDR_IC_Pos)))
#define SMAP_IDR_CC_Pos             24
#define SMAP_IDR_CC_Msk             (0xFu << SMAP_IDR_CC_Pos) /**< \brief (SMAP_IDR) JEP-106 Continuation Code */
#define SMAP_IDR_CC(value)          ((SMAP_IDR_CC_Msk & ((value) << SMAP_IDR_CC_Pos)))
#define SMAP_IDR_REVISION_Pos       28
#define SMAP_IDR_REVISION_Msk       (0xFu << SMAP_IDR_REVISION_Pos) /**< \brief (SMAP_IDR) Revision */
#define SMAP_IDR_REVISION(value)    ((SMAP_IDR_REVISION_Msk & ((value) << SMAP_IDR_REVISION_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR SPI */
/* ============================================================================= */
/** \addtogroup SAM4L4_SPI Serial Peripheral Interface */
/*@{*/

#define REV_SPI        0x211

