Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define   SPI_CSR0_CSAAT_1          (0x1u <<  3) /**< \brief (SPI_CSR0) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR0_BITS_Pos           4
#define SPI_CSR0_BITS_Msk           (0xFu << SPI_CSR0_BITS_Pos) /**< \brief (SPI_CSR0) Bits Per Transfer */
#define SPI_CSR0_BITS(value)        ((SPI_CSR0_BITS_Msk & ((value) << SPI_CSR0_BITS_Pos)))
#define   SPI_CSR0_BITS_8_BPT       (0x0u <<  4) /**< \brief (SPI_CSR0) 8 bits per transfer */
#define   SPI_CSR0_BITS_9_BPT       (0x1u <<  4) /**< \brief (SPI_CSR0) 9 bits per transfer */
#define   SPI_CSR0_BITS_10_BPT      (0x2u <<  4) /**< \brief (SPI_CSR0) 10 bits per transfer */
#define   SPI_CSR0_BITS_11_BPT      (0x3u <<  4) /**< \brief (SPI_CSR0) 11 bits per transfer */
#define   SPI_CSR0_BITS_12_BPT      (0x4u <<  4) /**< \brief (SPI_CSR0) 12 bits per transfer */
#define   SPI_CSR0_BITS_13_BPT      (0x5u <<  4) /**< \brief (SPI_CSR0) 13 bits per transfer */
#define   SPI_CSR0_BITS_14_BPT      (0x6u <<  4) /**< \brief (SPI_CSR0) 14 bits per transfer */
#define   SPI_CSR0_BITS_15_BPT      (0x7u <<  4) /**< \brief (SPI_CSR0) 15 bits per transfer */
#define   SPI_CSR0_BITS_16_BPT      (0x8u <<  4) /**< \brief (SPI_CSR0) 16 bits per transfer */
#define SPI_CSR0_SCBR_Pos           8
#define SPI_CSR0_SCBR_Msk           (0xFFu << SPI_CSR0_SCBR_Pos) /**< \brief (SPI_CSR0) Serial Clock Baud Rate */
#define SPI_CSR0_SCBR(value)        ((SPI_CSR0_SCBR_Msk & ((value) << SPI_CSR0_SCBR_Pos)))
#define SPI_CSR0_DLYBS_Pos          16
#define SPI_CSR0_DLYBS_Msk          (0xFFu << SPI_CSR0_DLYBS_Pos) /**< \brief (SPI_CSR0) Delay Before SPCK */
#define SPI_CSR0_DLYBS(value)       ((SPI_CSR0_DLYBS_Msk & ((value) << SPI_CSR0_DLYBS_Pos)))
#define SPI_CSR0_DLYBCT_Pos         24
#define SPI_CSR0_DLYBCT_Msk         (0xFFu << SPI_CSR0_DLYBCT_Pos) /**< \brief (SPI_CSR0) Delay Between Consecutive Transfers */
#define SPI_CSR0_DLYBCT(value)      ((SPI_CSR0_DLYBCT_Msk & ((value) << SPI_CSR0_DLYBCT_Pos)))
/* -------- SPI_CSR1 : (SPI Offset: 0x34) Chip Select Register 1 -------- */
#define SPI_CSR1_CPOL               (0x1u <<  0) /**< \brief (SPI_CSR1) Clock Polarity */
#define   SPI_CSR1_CPOL_0           (0x0u <<  0) /**< \brief (SPI_CSR1) The inactive state value of SPCK is logic level zero. */
#define   SPI_CSR1_CPOL_1           (0x1u <<  0) /**< \brief (SPI_CSR1) The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices. */
#define SPI_CSR1_NCPHA              (0x1u <<  1) /**< \brief (SPI_CSR1) Clock Phase */
#define   SPI_CSR1_NCPHA_0          (0x0u <<  1) /**< \brief (SPI_CSR1) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK. */
#define   SPI_CSR1_NCPHA_1          (0x1u <<  1) /**< \brief (SPI_CSR1) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices. */
#define SPI_CSR1_CSNAAT             (0x1u <<  2) /**< \brief (SPI_CSR1) Chip Select Not Active After Transfer */
#define SPI_CSR1_CSAAT              (0x1u <<  3) /**< \brief (SPI_CSR1) Chip Select Active After Transfer */
#define   SPI_CSR1_CSAAT_0          (0x0u <<  3) /**< \brief (SPI_CSR1) The Peripheral Chip Select Line rises as soon as the last transfer is achieved. */
#define   SPI_CSR1_CSAAT_1          (0x1u <<  3) /**< \brief (SPI_CSR1) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR1_BITS_Pos           4
#define SPI_CSR1_BITS_Msk           (0xFu << SPI_CSR1_BITS_Pos) /**< \brief (SPI_CSR1) Bits Per Transfer */
#define SPI_CSR1_BITS(value)        ((SPI_CSR1_BITS_Msk & ((value) << SPI_CSR1_BITS_Pos)))
#define   SPI_CSR1_BITS_8_BPT       (0x0u <<  4) /**< \brief (SPI_CSR1) 8 bits per transfer */
#define   SPI_CSR1_BITS_9_BPT       (0x1u <<  4) /**< \brief (SPI_CSR1) 9 bits per transfer */
#define   SPI_CSR1_BITS_10_BPT      (0x2u <<  4) /**< \brief (SPI_CSR1) 10 bits per transfer */
#define   SPI_CSR1_BITS_11_BPT      (0x3u <<  4) /**< \brief (SPI_CSR1) 11 bits per transfer */
#define   SPI_CSR1_BITS_12_BPT      (0x4u <<  4) /**< \brief (SPI_CSR1) 12 bits per transfer */
#define   SPI_CSR1_BITS_13_BPT      (0x5u <<  4) /**< \brief (SPI_CSR1) 13 bits per transfer */
#define   SPI_CSR1_BITS_14_BPT      (0x6u <<  4) /**< \brief (SPI_CSR1) 14 bits per transfer */
#define   SPI_CSR1_BITS_15_BPT      (0x7u <<  4) /**< \brief (SPI_CSR1) 15 bits per transfer */
#define   SPI_CSR1_BITS_16_BPT      (0x8u <<  4) /**< \brief (SPI_CSR1) 16 bits per transfer */
#define SPI_CSR1_SCBR_Pos           8
#define SPI_CSR1_SCBR_Msk           (0xFFu << SPI_CSR1_SCBR_Pos) /**< \brief (SPI_CSR1) Serial Clock Baud Rate */
#define SPI_CSR1_SCBR(value)        ((SPI_CSR1_SCBR_Msk & ((value) << SPI_CSR1_SCBR_Pos)))
#define SPI_CSR1_DLYBS_Pos          16
#define SPI_CSR1_DLYBS_Msk          (0xFFu << SPI_CSR1_DLYBS_Pos) /**< \brief (SPI_CSR1) Delay Before SPCK */
#define SPI_CSR1_DLYBS(value)       ((SPI_CSR1_DLYBS_Msk & ((value) << SPI_CSR1_DLYBS_Pos)))
#define SPI_CSR1_DLYBCT_Pos         24
#define SPI_CSR1_DLYBCT_Msk         (0xFFu << SPI_CSR1_DLYBCT_Pos) /**< \brief (SPI_CSR1) Delay Between Consecutive Transfers */
#define SPI_CSR1_DLYBCT(value)      ((SPI_CSR1_DLYBCT_Msk & ((value) << SPI_CSR1_DLYBCT_Pos)))
/* -------- SPI_CSR2 : (SPI Offset: 0x38) Chip Select Register 2 -------- */
#define SPI_CSR2_CPOL               (0x1u <<  0) /**< \brief (SPI_CSR2) Clock Polarity */
#define   SPI_CSR2_CPOL_0           (0x0u <<  0) /**< \brief (SPI_CSR2) The inactive state value of SPCK is logic level zero. */
#define   SPI_CSR2_CPOL_1           (0x1u <<  0) /**< \brief (SPI_CSR2) The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices. */
#define SPI_CSR2_NCPHA              (0x1u <<  1) /**< \brief (SPI_CSR2) Clock Phase */
#define   SPI_CSR2_NCPHA_0          (0x0u <<  1) /**< \brief (SPI_CSR2) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK. */
#define   SPI_CSR2_NCPHA_1          (0x1u <<  1) /**< \brief (SPI_CSR2) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices. */
#define SPI_CSR2_CSNAAT             (0x1u <<  2) /**< \brief (SPI_CSR2) Chip Select Not Active After Transfer */
#define SPI_CSR2_CSAAT              (0x1u <<  3) /**< \brief (SPI_CSR2) Chip Select Active After Transfer */
#define   SPI_CSR2_CSAAT_0          (0x0u <<  3) /**< \brief (SPI_CSR2) The Peripheral Chip Select Line rises as soon as the last transfer is achieved. */
#define   SPI_CSR2_CSAAT_1          (0x1u <<  3) /**< \brief (SPI_CSR2) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR2_BITS_Pos           4
#define SPI_CSR2_BITS_Msk           (0xFu << SPI_CSR2_BITS_Pos) /**< \brief (SPI_CSR2) Bits Per Transfer */
#define SPI_CSR2_BITS(value)        ((SPI_CSR2_BITS_Msk & ((value) << SPI_CSR2_BITS_Pos)))
#define   SPI_CSR2_BITS_8_BPT       (0x0u <<  4) /**< \brief (SPI_CSR2) 8 bits per transfer */
#define   SPI_CSR2_BITS_9_BPT       (0x1u <<  4) /**< \brief (SPI_CSR2) 9 bits per transfer */
#define   SPI_CSR2_BITS_10_BPT      (0x2u <<  4) /**< \brief (SPI_CSR2) 10 bits per transfer */
#define   SPI_CSR2_BITS_11_BPT      (0x3u <<  4) /**< \brief (SPI_CSR2) 11 bits per transfer */
#define   SPI_CSR2_BITS_12_BPT      (0x4u <<  4) /**< \brief (SPI_CSR2) 12 bits per transfer */
#define   SPI_CSR2_BITS_13_BPT      (0x5u <<  4) /**< \brief (SPI_CSR2) 13 bits per transfer */
#define   SPI_CSR2_BITS_14_BPT      (0x6u <<  4) /**< \brief (SPI_CSR2) 14 bits per transfer */
#define   SPI_CSR2_BITS_15_BPT      (0x7u <<  4) /**< \brief (SPI_CSR2) 15 bits per transfer */
#define   SPI_CSR2_BITS_16_BPT      (0x8u <<  4) /**< \brief (SPI_CSR2) 16 bits per transfer */
#define SPI_CSR2_SCBR_Pos           8
#define SPI_CSR2_SCBR_Msk           (0xFFu << SPI_CSR2_SCBR_Pos) /**< \brief (SPI_CSR2) Serial Clock Baud Rate */
#define SPI_CSR2_SCBR(value)        ((SPI_CSR2_SCBR_Msk & ((value) << SPI_CSR2_SCBR_Pos)))
#define SPI_CSR2_DLYBS_Pos          16
#define SPI_CSR2_DLYBS_Msk          (0xFFu << SPI_CSR2_DLYBS_Pos) /**< \brief (SPI_CSR2) Delay Before SPCK */
#define SPI_CSR2_DLYBS(value)       ((SPI_CSR2_DLYBS_Msk & ((value) << SPI_CSR2_DLYBS_Pos)))
#define SPI_CSR2_DLYBCT_Pos         24
#define SPI_CSR2_DLYBCT_Msk         (0xFFu << SPI_CSR2_DLYBCT_Pos) /**< \brief (SPI_CSR2) Delay Between Consecutive Transfers */
#define SPI_CSR2_DLYBCT(value)      ((SPI_CSR2_DLYBCT_Msk & ((value) << SPI_CSR2_DLYBCT_Pos)))
/* -------- SPI_CSR3 : (SPI Offset: 0x3C) Chip Select Register 3 -------- */
#define SPI_CSR3_CPOL               (0x1u <<  0) /**< \brief (SPI_CSR3) Clock Polarity */
#define   SPI_CSR3_CPOL_0           (0x0u <<  0) /**< \brief (SPI_CSR3) The inactive state value of SPCK is logic level zero. */
#define   SPI_CSR3_CPOL_1           (0x1u <<  0) /**< \brief (SPI_CSR3) The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices. */
#define SPI_CSR3_NCPHA              (0x1u <<  1) /**< \brief (SPI_CSR3) Clock Phase */
#define   SPI_CSR3_NCPHA_0          (0x0u <<  1) /**< \brief (SPI_CSR3) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK. */
#define   SPI_CSR3_NCPHA_1          (0x1u <<  1) /**< \brief (SPI_CSR3) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices. */
#define SPI_CSR3_CSNAAT             (0x1u <<  2) /**< \brief (SPI_CSR3) Chip Select Not Active After Transfer */
#define SPI_CSR3_CSAAT              (0x1u <<  3) /**< \brief (SPI_CSR3) Chip Select Active After Transfer */
#define   SPI_CSR3_CSAAT_0          (0x0u <<  3) /**< \brief (SPI_CSR3) The Peripheral Chip Select Line rises as soon as the last transfer is achieved. */
#define   SPI_CSR3_CSAAT_1          (0x1u <<  3) /**< \brief (SPI_CSR3) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR3_BITS_Pos           4
#define SPI_CSR3_BITS_Msk           (0xFu << SPI_CSR3_BITS_Pos) /**< \brief (SPI_CSR3) Bits Per Transfer */
#define SPI_CSR3_BITS(value)        ((SPI_CSR3_BITS_Msk & ((value) << SPI_CSR3_BITS_Pos)))
#define   SPI_CSR3_BITS_8_BPT       (0x0u <<  4) /**< \brief (SPI_CSR3) 8 bits per transfer */
#define   SPI_CSR3_BITS_9_BPT       (0x1u <<  4) /**< \brief (SPI_CSR3) 9 bits per transfer */
#define   SPI_CSR3_BITS_10_BPT      (0x2u <<  4) /**< \brief (SPI_CSR3) 10 bits per transfer */
#define   SPI_CSR3_BITS_11_BPT      (0x3u <<  4) /**< \brief (SPI_CSR3) 11 bits per transfer */
#define   SPI_CSR3_BITS_12_BPT      (0x4u <<  4) /**< \brief (SPI_CSR3) 12 bits per transfer */
#define   SPI_CSR3_BITS_13_BPT      (0x5u <<  4) /**< \brief (SPI_CSR3) 13 bits per transfer */
#define   SPI_CSR3_BITS_14_BPT      (0x6u <<  4) /**< \brief (SPI_CSR3) 14 bits per transfer */
#define   SPI_CSR3_BITS_15_BPT      (0x7u <<  4) /**< \brief (SPI_CSR3) 15 bits per transfer */
#define   SPI_CSR3_BITS_16_BPT      (0x8u <<  4) /**< \brief (SPI_CSR3) 16 bits per transfer */
#define SPI_CSR3_SCBR_Pos           8
#define SPI_CSR3_SCBR_Msk           (0xFFu << SPI_CSR3_SCBR_Pos) /**< \brief (SPI_CSR3) Serial Clock Baud Rate */
#define SPI_CSR3_SCBR(value)        ((SPI_CSR3_SCBR_Msk & ((value) << SPI_CSR3_SCBR_Pos)))
#define SPI_CSR3_DLYBS_Pos          16
#define SPI_CSR3_DLYBS_Msk          (0xFFu << SPI_CSR3_DLYBS_Pos) /**< \brief (SPI_CSR3) Delay Before SPCK */
#define SPI_CSR3_DLYBS(value)       ((SPI_CSR3_DLYBS_Msk & ((value) << SPI_CSR3_DLYBS_Pos)))
#define SPI_CSR3_DLYBCT_Pos         24
#define SPI_CSR3_DLYBCT_Msk         (0xFFu << SPI_CSR3_DLYBCT_Pos) /**< \brief (SPI_CSR3) Delay Between Consecutive Transfers */
#define SPI_CSR3_DLYBCT(value)      ((SPI_CSR3_DLYBCT_Msk & ((value) << SPI_CSR3_DLYBCT_Pos)))
/* -------- SPI_WPCR : (SPI Offset: 0xE4) Write Protection control Register -------- */
#define SPI_WPCR_SPIWPEN            (0x1u <<  0) /**< \brief (SPI_WPCR) SPI write Protection Enable */
#define SPI_WPCR_SPIWPKEY_Pos       8
#define SPI_WPCR_SPIWPKEY_Msk       (0xFFFFFFu << SPI_WPCR_SPIWPKEY_Pos) /**< \brief (SPI_WPCR) SPI write Protection Key Password */
#define SPI_WPCR_SPIWPKEY(value)    ((SPI_WPCR_SPIWPKEY_Msk & ((value) << SPI_WPCR_SPIWPKEY_Pos)))
#define   SPI_WPCR_SPIWPKEY_VALUE   (0x535049u <<  8) /**< \brief (SPI_WPCR) SPI Write Protection Key Password */
/* -------- SPI_WPSR : (SPI Offset: 0xE8) Write Protection status Register -------- */
#define SPI_WPSR_SPIWPVS_Pos        0
#define SPI_WPSR_SPIWPVS_Msk        (0x7u << SPI_WPSR_SPIWPVS_Pos) /**< \brief (SPI_WPSR) SPI write protection Violation Status */
#define SPI_WPSR_SPIWPVS(value)     ((SPI_WPSR_SPIWPVS_Msk & ((value) << SPI_WPSR_SPIWPVS_Pos)))
#define   SPI_WPSR_SPIWPVS_WRITE_WITH_WP (0x1u <<  0) /**< \brief (SPI_WPSR) The Write Protection has blocked a Write access to a protected register (since the last read). */
#define   SPI_WPSR_SPIWPVS_SWRST_WITH_WP (0x2u <<  0) /**< \brief (SPI_WPSR) Software Reset has been performed while Write Protection was enabled (since the last read or since the last write access on MR, IER, IDR or CSRx). */
#define   SPI_WPSR_SPIWPVS_UNEXPECTED_WRITE (0x4u <<  0) /**< \brief (SPI_WPSR) Write accesses have been detected on MR (while a chip select was active) or on CSRi (while the Chip Select “i” was active) since the last read. */
#define SPI_WPSR_SPIWPVSRC_Pos      8
#define SPI_WPSR_SPIWPVSRC_Msk      (0xFFu << SPI_WPSR_SPIWPVSRC_Pos) /**< \brief (SPI_WPSR) SPI write Protection Violation source */
#define SPI_WPSR_SPIWPVSRC(value)   ((SPI_WPSR_SPIWPVSRC_Msk & ((value) << SPI_WPSR_SPIWPVSRC_Pos)))
/* -------- SPI_FEATURES : (SPI Offset: 0xF8) Features Register -------- */
#define SPI_FEATURES_NCS_Pos        0
#define SPI_FEATURES_NCS_Msk        (0xFu << SPI_FEATURES_NCS_Pos) /**< \brief (SPI_FEATURES) Number of Chip Selects */
#define SPI_FEATURES_NCS(value)     ((SPI_FEATURES_NCS_Msk & ((value) << SPI_FEATURES_NCS_Pos)))
#define SPI_FEATURES_PCONF          (0x1u <<  4) /**< \brief (SPI_FEATURES) Polarity is Configurable */
#define SPI_FEATURES_PPNCONF        (0x1u <<  5) /**< \brief (SPI_FEATURES) Polarity is Positive if Polarity is not Configurable */
#define SPI_FEATURES_PHCONF         (0x1u <<  6) /**< \brief (SPI_FEATURES) Phase is Configurable */
#define SPI_FEATURES_PHZNCONF       (0x1u <<  7) /**< \brief (SPI_FEATURES) Phase is Zero if Phase is not Configurable */
#define SPI_FEATURES_LENCONF        (0x1u <<  8) /**< \brief (SPI_FEATURES) Character Length is Configurable */
#define SPI_FEATURES_LENNCONF_Pos    9
#define SPI_FEATURES_LENNCONF_Msk    (0x7Fu << SPI_FEATURES_LENNCONF_Pos) /**< \brief (SPI_FEATURES) Character Length if not Configurable */
#define SPI_FEATURES_LENNCONF(value) ((SPI_FEATURES_LENNCONF_Msk & ((value) << SPI_FEATURES_LENNCONF_Pos)))
#define SPI_FEATURES_EXTDEC         (0x1u << 16) /**< \brief (SPI_FEATURES) External Decoder is True */
#define SPI_FEATURES_CSNAATIMPL     (0x1u << 17) /**< \brief (SPI_FEATURES) CSNAAT Features are Implemented */
#define SPI_FEATURES_BRPBHSB        (0x1u << 18) /**< \brief (SPI_FEATURES) Bridge Type is PB to HSB */
#define SPI_FEATURES_FIFORIMPL      (0x1u << 19) /**< \brief (SPI_FEATURES) FIFO in Reception is Implemented */
#define SPI_FEATURES_SWPIMPL        (0x1u << 20) /**< \brief (SPI_FEATURES) Spurious Write Protection is Implemented */
/* -------- SPI_VERSION : (SPI Offset: 0xFC) Version Register -------- */
#define SPI_VERSION_VERSION_Pos     0
#define SPI_VERSION_VERSION_Msk     (0xFFFu << SPI_VERSION_VERSION_Pos) /**< \brief (SPI_VERSION) Version */
#define SPI_VERSION_VERSION(value)  ((SPI_VERSION_VERSION_Msk & ((value) << SPI_VERSION_VERSION_Pos)))
#define SPI_VERSION_MFN_Pos         16
#define SPI_VERSION_MFN_Msk         (0x7u << SPI_VERSION_MFN_Pos) /**< \brief (SPI_VERSION) mfn */
#define SPI_VERSION_MFN(value)      ((SPI_VERSION_MFN_Msk & ((value) << SPI_VERSION_MFN_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR TC */
/* ============================================================================= */
/** \addtogroup SAM4L4_TC Timer/Counter */
/*@{*/

#define REV_TC         0x402

