Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief TcChannel hardware registers */
typedef struct {
  WoReg   CCR;         /**< \brief (TcChannel Offset: 0x00) Channel Control Register Channel 0 */
  RwReg   CMR;         /**< \brief (TcChannel Offset: 0x04) Channel Mode Register Channel 0 */
  RwReg   SMC;         /**< \brief (TcChannel Offset: 0x08) Stepper Motor Mode Register */
  RoReg   Reserved1[1];
  RoReg   CV;          /**< \brief (TcChannel Offset: 0x10) Counter Value Channel 0 */
  RwReg   RA;          /**< \brief (TcChannel Offset: 0x14) Register A Channel 0 */
  RwReg   RB;          /**< \brief (TcChannel Offset: 0x18) Register B Channel 0 */
  RwReg   RC;          /**< \brief (TcChannel Offset: 0x1C) Register C Channel 0 */
  RoReg   SR;          /**< \brief (TcChannel Offset: 0x20) Status Register Channel 0 */
  WoReg   IER;         /**< \brief (TcChannel Offset: 0x24) Interrupt Enable Register Channel 0 */
  WoReg   IDR;         /**< \brief (TcChannel Offset: 0x28) Interrupt Disable Register Channel 0 */
  RoReg   IMR;         /**< \brief (TcChannel Offset: 0x2C) Interrupt Mask Register Channel 0 */
  RoReg   Reserved2[4];
} TcChannel;
/** \brief TC hardware registers */
typedef struct {
  TcChannel Channel[3]; /**< \brief (TC Offset: 0x00) TcChannel groups */
  WoReg   BCR;         /**< \brief (TC Offset: 0xC0) TC Block Control Register */
  RwReg   BMR;         /**< \brief (TC Offset: 0xC4) TC Block Mode Register */
  WoReg   QIER;        /**< \brief (TC Offset: 0xC8) QDEC Interrupt Enable Register */
  WoReg   QIDR;        /**< \brief (TC Offset: 0xCC) QDEC Interrupt Disable Register */
  RoReg   QIMR;        /**< \brief (TC Offset: 0xD0) QDEC Interrupt Mask Register */
  RoReg   QISR;        /**< \brief (TC Offset: 0xD4) QDEC Interrupt Status Register */
  RwReg   FMR;         /**< \brief (TC Offset: 0xD8) Fault Mode Register */
  RoReg   Reserved1[2];
  RwReg   WPMR;        /**< \brief (TC Offset: 0xE4) Write Protect Mode Register */
  RoReg   Reserved2[4];
  RoReg   FEATURES;    /**< \brief (TC Offset: 0xF8) Features Register */
  RoReg   VERSION;     /**< \brief (TC Offset: 0xFC) Version Register */
} Tc;
#endif /* __ASSEMBLY__ */
/* -------- TC_CCR : (TC Offset: 0x00) Channel Channel Control Register Channel 0 -------- */
#define TC_CCR_CLKEN                (0x1u <<  0) /**< \brief (TC_CCR) Counter Clock Enable Command */
#define   TC_CCR_CLKEN_0            (0x0u <<  0) /**< \brief (TC_CCR) No effect. */
#define   TC_CCR_CLKEN_1            (0x1u <<  0) /**< \brief (TC_CCR) Enables the clock if CLKDIS is not 1. */
#define TC_CCR_CLKDIS               (0x1u <<  1) /**< \brief (TC_CCR) Counter Clock Disable Command */
#define   TC_CCR_CLKDIS_0           (0x0u <<  1) /**< \brief (TC_CCR) No effect. */
#define   TC_CCR_CLKDIS_1           (0x1u <<  1) /**< \brief (TC_CCR) Disables the clock. */
#define TC_CCR_SWTRG                (0x1u <<  2) /**< \brief (TC_CCR) Software Trigger Command */
#define   TC_CCR_SWTRG_0            (0x0u <<  2) /**< \brief (TC_CCR) No effect. */
#define   TC_CCR_SWTRG_1            (0x1u <<  2) /**< \brief (TC_CCR) A software trigger is performed:the counter is reset and clock is started. */
/* -------- TC_CAPTURE_CMR : (TC Offset: 0x04) Channel Channel Mode Register Channel 0 -------- */
#define TC_CAPTURE_CMR_TCCLKS_Pos    0
#define TC_CAPTURE_CMR_TCCLKS_Msk    (0x7u << TC_CAPTURE_CMR_TCCLKS_Pos) /**< \brief (TC_CAPTURE_CMR) Clock Selection */
#define TC_CAPTURE_CMR_TCCLKS(value) ((TC_CAPTURE_CMR_TCCLKS_Msk & ((value) << TC_CAPTURE_CMR_TCCLKS_Pos)))
#define   TC_CAPTURE_CMR_TCCLKS_TIMER_CLOCK1 (0x0u <<  0) /**< \brief (TC_CAPTURE_CMR) TIMER_CLOCK1 */
#define   TC_CAPTURE_CMR_TCCLKS_TIMER_CLOCK2 (0x1u <<  0) /**< \brief (TC_CAPTURE_CMR) TIMER_CLOCK2 */
#define   TC_CAPTURE_CMR_TCCLKS_TIMER_CLOCK3 (0x2u <<  0) /**< \brief (TC_CAPTURE_CMR) TIMER_CLOCK3 */
#define   TC_CAPTURE_CMR_TCCLKS_TIMER_CLOCK4 (0x3u <<  0) /**< \brief (TC_CAPTURE_CMR) TIMER_CLOCK4 */
#define   TC_CAPTURE_CMR_TCCLKS_TIMER_CLOCK5 (0x4u <<  0) /**< \brief (TC_CAPTURE_CMR) TIMER_CLOCK5 */
#define   TC_CAPTURE_CMR_TCCLKS_XC0 (0x5u <<  0) /**< \brief (TC_CAPTURE_CMR) XC0 */
#define   TC_CAPTURE_CMR_TCCLKS_XC1 (0x6u <<  0) /**< \brief (TC_CAPTURE_CMR) XC1 */
#define   TC_CAPTURE_CMR_TCCLKS_XC2 (0x7u <<  0) /**< \brief (TC_CAPTURE_CMR) XC2 */
#define TC_CAPTURE_CMR_CLKI         (0x1u <<  3) /**< \brief (TC_CAPTURE_CMR) Clock Invert */
#define   TC_CAPTURE_CMR_CLKI_0     (0x0u <<  3) /**< \brief (TC_CAPTURE_CMR) Counter is incremented on rising edge of the clock. */
#define   TC_CAPTURE_CMR_CLKI_1     (0x1u <<  3) /**< \brief (TC_CAPTURE_CMR) Counter is incremented on falling edge of the clock. */
#define TC_CAPTURE_CMR_BURST_Pos    4
#define TC_CAPTURE_CMR_BURST_Msk    (0x3u << TC_CAPTURE_CMR_BURST_Pos) /**< \brief (TC_CAPTURE_CMR) Burst Signal Selection */
#define TC_CAPTURE_CMR_BURST(value) ((TC_CAPTURE_CMR_BURST_Msk & ((value) << TC_CAPTURE_CMR_BURST_Pos)))
#define   TC_CAPTURE_CMR_BURST_NOT_GATED (0x0u <<  4) /**< \brief (TC_CAPTURE_CMR) The clock is not gated by an external signal. */
#define   TC_CAPTURE_CMR_BURST_CLK_AND_XC0 (0x1u <<  4) /**< \brief (TC_CAPTURE_CMR) XC0 is ANDed with the selected clock. */
#define   TC_CAPTURE_CMR_BURST_CLK_AND_XC1 (0x2u <<  4) /**< \brief (TC_CAPTURE_CMR) XC1 is ANDed with the selected clock. */
#define   TC_CAPTURE_CMR_BURST_CLK_AND_XC2 (0x3u <<  4) /**< \brief (TC_CAPTURE_CMR) XC2 is ANDed with the selected clock. */
#define TC_CAPTURE_CMR_LDBSTOP      (0x1u <<  6) /**< \brief (TC_CAPTURE_CMR) Counter Clock Stopped with RB Loading */
#define   TC_CAPTURE_CMR_LDBSTOP_0  (0x0u <<  6) /**< \brief (TC_CAPTURE_CMR) Counter clock is not stopped when RB loading occurs. */
#define   TC_CAPTURE_CMR_LDBSTOP_1  (0x1u <<  6) /**< \brief (TC_CAPTURE_CMR) Counter clock is stopped when RB loading occurs. */
#define TC_CAPTURE_CMR_LDBDIS       (0x1u <<  7) /**< \brief (TC_CAPTURE_CMR) Counter Clock Disable with RB Loading */
#define   TC_CAPTURE_CMR_LDBDIS_0   (0x0u <<  7) /**< \brief (TC_CAPTURE_CMR) Counter clock is not disabled when RB loading occurs. */
#define   TC_CAPTURE_CMR_LDBDIS_1   (0x1u <<  7) /**< \brief (TC_CAPTURE_CMR) Counter clock is disabled when RB loading occurs. */
#define TC_CAPTURE_CMR_ETRGEDG_Pos    8
#define TC_CAPTURE_CMR_ETRGEDG_Msk    (0x3u << TC_CAPTURE_CMR_ETRGEDG_Pos) /**< \brief (TC_CAPTURE_CMR) External Trigger Edge Selection */
#define TC_CAPTURE_CMR_ETRGEDG(value) ((TC_CAPTURE_CMR_ETRGEDG_Msk & ((value) << TC_CAPTURE_CMR_ETRGEDG_Pos)))
#define   TC_CAPTURE_CMR_ETRGEDG_NO_EDGE (0x0u <<  8) /**< \brief (TC_CAPTURE_CMR) none */
#define   TC_CAPTURE_CMR_ETRGEDG_POS_EDGE (0x1u <<  8) /**< \brief (TC_CAPTURE_CMR) rising edge */
#define   TC_CAPTURE_CMR_ETRGEDG_NEG_EDGE (0x2u <<  8) /**< \brief (TC_CAPTURE_CMR) falling edge */
#define   TC_CAPTURE_CMR_ETRGEDG_BOTH_EDGES (0x3u <<  8) /**< \brief (TC_CAPTURE_CMR) each edge */
#define TC_CAPTURE_CMR_ABETRG       (0x1u << 10) /**< \brief (TC_CAPTURE_CMR) TIOA or TIOB External Trigger Selection */
#define   TC_CAPTURE_CMR_ABETRG_0   (0x0u << 10) /**< \brief (TC_CAPTURE_CMR) TIOB is used as an external trigger. */
#define   TC_CAPTURE_CMR_ABETRG_1   (0x1u << 10) /**< \brief (TC_CAPTURE_CMR) TIOA is used as an external trigger. */
#define TC_CAPTURE_CMR_CPCTRG       (0x1u << 14) /**< \brief (TC_CAPTURE_CMR) RC Compare Trigger Enable */
#define   TC_CAPTURE_CMR_CPCTRG_0   (0x0u << 14) /**< \brief (TC_CAPTURE_CMR) RC Compare has no effect on the counter and its clock. */
#define   TC_CAPTURE_CMR_CPCTRG_1   (0x1u << 14) /**< \brief (TC_CAPTURE_CMR) RC Compare resets the counter and starts the counter clock. */
#define TC_CAPTURE_CMR_WAVE         (0x1u << 15) /**< \brief (TC_CAPTURE_CMR) Wave */
#define   TC_CAPTURE_CMR_WAVE_0     (0x0u << 15) /**< \brief (TC_CAPTURE_CMR) Capture Mode is enabled. */
#define   TC_CAPTURE_CMR_WAVE_1     (0x1u << 15) /**< \brief (TC_CAPTURE_CMR) Capture Mode is disabled (Waveform Mode is enabled). */
#define TC_CAPTURE_CMR_LDRA_Pos     16
#define TC_CAPTURE_CMR_LDRA_Msk     (0x3u << TC_CAPTURE_CMR_LDRA_Pos) /**< \brief (TC_CAPTURE_CMR) RA Loading Selection */
#define TC_CAPTURE_CMR_LDRA(value)  ((TC_CAPTURE_CMR_LDRA_Msk & ((value) << TC_CAPTURE_CMR_LDRA_Pos)))
#define   TC_CAPTURE_CMR_LDRA_NO_EDGE (0x0u << 16) /**< \brief (TC_CAPTURE_CMR) none */
#define   TC_CAPTURE_CMR_LDRA_POS_EDGE_TIOA (0x1u << 16) /**< \brief (TC_CAPTURE_CMR) rising edge of TIOA */
#define   TC_CAPTURE_CMR_LDRA_NEG_EDGE_TIOA (0x2u << 16) /**< \brief (TC_CAPTURE_CMR) falling edge of TIOA */
#define   TC_CAPTURE_CMR_LDRA_BIOTH_EDGES_TIOA (0x3u << 16) /**< \brief (TC_CAPTURE_CMR) each edge of TIOA */
#define TC_CAPTURE_CMR_LDRB_Pos     18
#define TC_CAPTURE_CMR_LDRB_Msk     (0x3u << TC_CAPTURE_CMR_LDRB_Pos) /**< \brief (TC_CAPTURE_CMR) RB Loading Selection */
#define TC_CAPTURE_CMR_LDRB(value)  ((TC_CAPTURE_CMR_LDRB_Msk & ((value) << TC_CAPTURE_CMR_LDRB_Pos)))
#define   TC_CAPTURE_CMR_LDRB_NO_EDGE (0x0u << 18) /**< \brief (TC_CAPTURE_CMR) none */
#define   TC_CAPTURE_CMR_LDRB_POS_EDGE_TIOA (0x1u << 18) /**< \brief (TC_CAPTURE_CMR) rising edge of TIOA */
#define   TC_CAPTURE_CMR_LDRB_NEG_EDGE_TIOA (0x2u << 18) /**< \brief (TC_CAPTURE_CMR) falling edge of TIOA */
#define   TC_CAPTURE_CMR_LDRB_BIOTH_EDGES_TIOA (0x3u << 18) /**< \brief (TC_CAPTURE_CMR) each edge of TIOA */
/* -------- TC_WAVEFORM_CMR : (TC Offset: 0x04) Channel Channel Mode Register Channel 0 -------- */
#define TC_WAVEFORM_CMR_TCCLKS_Pos    0
#define TC_WAVEFORM_CMR_TCCLKS_Msk    (0x7u << TC_WAVEFORM_CMR_TCCLKS_Pos) /**< \brief (TC_WAVEFORM_CMR) Clock Selection */
#define TC_WAVEFORM_CMR_TCCLKS(value) ((TC_WAVEFORM_CMR_TCCLKS_Msk & ((value) << TC_WAVEFORM_CMR_TCCLKS_Pos)))
#define   TC_WAVEFORM_CMR_TCCLKS_TIMER_DIV1_CLOCK (0x0u <<  0) /**< \brief (TC_WAVEFORM_CMR) TIMER_DIV1_CLOCK */
#define   TC_WAVEFORM_CMR_TCCLKS_TIMER_DIV2_CLOCK (0x1u <<  0) /**< \brief (TC_WAVEFORM_CMR) TIMER_DIV2_CLOCK */
#define   TC_WAVEFORM_CMR_TCCLKS_TIMER_DIV3_CLOCK (0x2u <<  0) /**< \brief (TC_WAVEFORM_CMR) TIMER_DIV3_CLOCK */
#define   TC_WAVEFORM_CMR_TCCLKS_TIMER_DIV4_CLOCK (0x3u <<  0) /**< \brief (TC_WAVEFORM_CMR) TIMER_DIV4_CLOCK */
#define   TC_WAVEFORM_CMR_TCCLKS_TIMER_DIV5_CLOCK (0x4u <<  0) /**< \brief (TC_WAVEFORM_CMR) TIMER_DIV5_CLOCK */
#define   TC_WAVEFORM_CMR_TCCLKS_XC0 (0x5u <<  0) /**< \brief (TC_WAVEFORM_CMR) XC0 */
#define   TC_WAVEFORM_CMR_TCCLKS_XC1 (0x6u <<  0) /**< \brief (TC_WAVEFORM_CMR) XC1 */
#define   TC_WAVEFORM_CMR_TCCLKS_XC2 (0x7u <<  0) /**< \brief (TC_WAVEFORM_CMR) XC2 */
#define TC_WAVEFORM_CMR_CLKI        (0x1u <<  3) /**< \brief (TC_WAVEFORM_CMR) Clock Invert */
#define   TC_WAVEFORM_CMR_CLKI_0    (0x0u <<  3) /**< \brief (TC_WAVEFORM_CMR) Counter is incremented on rising edge of the clock. */
#define   TC_WAVEFORM_CMR_CLKI_1    (0x1u <<  3) /**< \brief (TC_WAVEFORM_CMR) Counter is incremented on falling edge of the clock. */
#define TC_WAVEFORM_CMR_BURST_Pos    4
#define TC_WAVEFORM_CMR_BURST_Msk    (0x3u << TC_WAVEFORM_CMR_BURST_Pos) /**< \brief (TC_WAVEFORM_CMR) Burst Signal Selection */
#define TC_WAVEFORM_CMR_BURST(value) ((TC_WAVEFORM_CMR_BURST_Msk & ((value) << TC_WAVEFORM_CMR_BURST_Pos)))
#define   TC_WAVEFORM_CMR_BURST_NOT_GATED (0x0u <<  4) /**< \brief (TC_WAVEFORM_CMR) The clock is not gated by an external signal. */
#define   TC_WAVEFORM_CMR_BURST_CLK_AND_XC0 (0x1u <<  4) /**< \brief (TC_WAVEFORM_CMR) XC0 is ANDed with the selected clock. */
#define   TC_WAVEFORM_CMR_BURST_CLK_AND_XC1 (0x2u <<  4) /**< \brief (TC_WAVEFORM_CMR) XC1 is ANDed with the selected clock. */
#define   TC_WAVEFORM_CMR_BURST_CLK_AND_XC2 (0x3u <<  4) /**< \brief (TC_WAVEFORM_CMR) XC2 is ANDed with the selected clock. */
#define TC_WAVEFORM_CMR_CPCSTOP     (0x1u <<  6) /**< \brief (TC_WAVEFORM_CMR) Counter Clock Stopped with RC Compare */
#define   TC_WAVEFORM_CMR_CPCSTOP_0 (0x0u <<  6) /**< \brief (TC_WAVEFORM_CMR) Counter clock is not stopped when counter reaches RC. */
#define   TC_WAVEFORM_CMR_CPCSTOP_1 (0x1u <<  6) /**< \brief (TC_WAVEFORM_CMR) Counter clock is stopped when counter reaches RC. */
#define TC_WAVEFORM_CMR_CPCDIS      (0x1u <<  7) /**< \brief (TC_WAVEFORM_CMR) Counter Clock Disable with RC Compare */
#define   TC_WAVEFORM_CMR_CPCDIS_0  (0x0u <<  7) /**< \brief (TC_WAVEFORM_CMR) Counter clock is not disabled when counter reaches RC. */
#define   TC_WAVEFORM_CMR_CPCDIS_1  (0x1u <<  7) /**< \brief (TC_WAVEFORM_CMR) Counter clock is disabled when counter reaches RC. */
#define TC_WAVEFORM_CMR_EEVTEDG_Pos    8
#define TC_WAVEFORM_CMR_EEVTEDG_Msk    (0x3u << TC_WAVEFORM_CMR_EEVTEDG_Pos) /**< \brief (TC_WAVEFORM_CMR) External Event Edge Selection */
#define TC_WAVEFORM_CMR_EEVTEDG(value) ((TC_WAVEFORM_CMR_EEVTEDG_Msk & ((value) << TC_WAVEFORM_CMR_EEVTEDG_Pos)))
#define   TC_WAVEFORM_CMR_EEVTEDG_NO_EDGE (0x0u <<  8) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_EEVTEDG_POS_EDGE (0x1u <<  8) /**< \brief (TC_WAVEFORM_CMR) rising edge */
#define   TC_WAVEFORM_CMR_EEVTEDG_NEG_EDGE (0x2u <<  8) /**< \brief (TC_WAVEFORM_CMR) falling edge */
#define   TC_WAVEFORM_CMR_EEVTEDG_BOTH_EDGES (0x3u <<  8) /**< \brief (TC_WAVEFORM_CMR) each edge */
#define TC_WAVEFORM_CMR_EEVT_Pos    10
#define TC_WAVEFORM_CMR_EEVT_Msk    (0x3u << TC_WAVEFORM_CMR_EEVT_Pos) /**< \brief (TC_WAVEFORM_CMR) External Event Selection */
#define TC_WAVEFORM_CMR_EEVT(value) ((TC_WAVEFORM_CMR_EEVT_Msk & ((value) << TC_WAVEFORM_CMR_EEVT_Pos)))
#define   TC_WAVEFORM_CMR_EEVT_TIOB_INPUT (0x0u << 10) /**< \brief (TC_WAVEFORM_CMR) TIOB input. If TIOB is chosen as the external event signal, it is configured as an input and no longer generates waveforms. */
#define   TC_WAVEFORM_CMR_EEVT_XC0_OUTPUT (0x1u << 10) /**< \brief (TC_WAVEFORM_CMR) XC0 output */
#define   TC_WAVEFORM_CMR_EEVT_XC1_OUTPUT (0x2u << 10) /**< \brief (TC_WAVEFORM_CMR) XC1 output */
#define   TC_WAVEFORM_CMR_EEVT_XC2_OUTPUT (0x3u << 10) /**< \brief (TC_WAVEFORM_CMR) XC2 output */
#define TC_WAVEFORM_CMR_ENETRG      (0x1u << 12) /**< \brief (TC_WAVEFORM_CMR) External Event Trigger Enable */
#define   TC_WAVEFORM_CMR_ENETRG_0  (0x0u << 12) /**< \brief (TC_WAVEFORM_CMR) The external event has no effect on the counter and its clock. In this case, the selected external event only controls the TIOA output. */
#define   TC_WAVEFORM_CMR_ENETRG_1  (0x1u << 12) /**< \brief (TC_WAVEFORM_CMR) The external event resets the counter and starts the counter clock. */
#define TC_WAVEFORM_CMR_WAVSEL_Pos    13
#define TC_WAVEFORM_CMR_WAVSEL_Msk    (0x3u << TC_WAVEFORM_CMR_WAVSEL_Pos) /**< \brief (TC_WAVEFORM_CMR) Waveform Selection */
#define TC_WAVEFORM_CMR_WAVSEL(value) ((TC_WAVEFORM_CMR_WAVSEL_Msk & ((value) << TC_WAVEFORM_CMR_WAVSEL_Pos)))
#define   TC_WAVEFORM_CMR_WAVSEL_UP_NO_AUTO (0x0u << 13) /**< \brief (TC_WAVEFORM_CMR) UP mode without automatic trigger on RC Compare */
#define   TC_WAVEFORM_CMR_WAVSEL_UPDOWN_NO_AUTO (0x1u << 13) /**< \brief (TC_WAVEFORM_CMR) UPDOWN mode without automatic trigger on RC Compare */
#define   TC_WAVEFORM_CMR_WAVSEL_UP_AUTO (0x2u << 13) /**< \brief (TC_WAVEFORM_CMR) UP mode with automatic trigger on RC Compare */
#define   TC_WAVEFORM_CMR_WAVSEL_UPDOWN_AUTO (0x3u << 13) /**< \brief (TC_WAVEFORM_CMR) UPDOWN mode with automatic trigger on RC Compare */
#define TC_WAVEFORM_CMR_WAVE        (0x1u << 15) /**< \brief (TC_WAVEFORM_CMR) WAVE */
#define   TC_WAVEFORM_CMR_WAVE_0    (0x0u << 15) /**< \brief (TC_WAVEFORM_CMR) Waveform Mode is disabled (Capture Mode is enabled). */
#define   TC_WAVEFORM_CMR_WAVE_1    (0x1u << 15) /**< \brief (TC_WAVEFORM_CMR) Waveform Mode is enabled. */
#define TC_WAVEFORM_CMR_ACPA_Pos    16
#define TC_WAVEFORM_CMR_ACPA_Msk    (0x3u << TC_WAVEFORM_CMR_ACPA_Pos) /**< \brief (TC_WAVEFORM_CMR) RA Compare Effect on TIOA */
#define TC_WAVEFORM_CMR_ACPA(value) ((TC_WAVEFORM_CMR_ACPA_Msk & ((value) << TC_WAVEFORM_CMR_ACPA_Pos)))
#define   TC_WAVEFORM_CMR_ACPA_NONE (0x0u << 16) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_ACPA_SET  (0x1u << 16) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_ACPA_CLEAR (0x2u << 16) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_ACPA_TOGGLE (0x3u << 16) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_ACPC_Pos    18
#define TC_WAVEFORM_CMR_ACPC_Msk    (0x3u << TC_WAVEFORM_CMR_ACPC_Pos) /**< \brief (TC_WAVEFORM_CMR) RC Compare Effect on TIOA */
#define TC_WAVEFORM_CMR_ACPC(value) ((TC_WAVEFORM_CMR_ACPC_Msk & ((value) << TC_WAVEFORM_CMR_ACPC_Pos)))
#define   TC_WAVEFORM_CMR_ACPC_NONE (0x0u << 18) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_ACPC_SET  (0x1u << 18) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_ACPC_CLEAR (0x2u << 18) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_ACPC_TOGGLE (0x3u << 18) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_AEEVT_Pos    20
#define TC_WAVEFORM_CMR_AEEVT_Msk    (0x3u << TC_WAVEFORM_CMR_AEEVT_Pos) /**< \brief (TC_WAVEFORM_CMR) External Event Effect on TIOA */
#define TC_WAVEFORM_CMR_AEEVT(value) ((TC_WAVEFORM_CMR_AEEVT_Msk & ((value) << TC_WAVEFORM_CMR_AEEVT_Pos)))
#define   TC_WAVEFORM_CMR_AEEVT_NONE (0x0u << 20) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_AEEVT_SET (0x1u << 20) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_AEEVT_CLEAR (0x2u << 20) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_AEEVT_TOGGLE (0x3u << 20) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_ASWTRG_Pos    22
#define TC_WAVEFORM_CMR_ASWTRG_Msk    (0x3u << TC_WAVEFORM_CMR_ASWTRG_Pos) /**< \brief (TC_WAVEFORM_CMR) Software Trigger Effect on TIOA */
#define TC_WAVEFORM_CMR_ASWTRG(value) ((TC_WAVEFORM_CMR_ASWTRG_Msk & ((value) << TC_WAVEFORM_CMR_ASWTRG_Pos)))
#define   TC_WAVEFORM_CMR_ASWTRG_NONE (0x0u << 22) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_ASWTRG_SET (0x1u << 22) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_ASWTRG_CLEAR (0x2u << 22) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_ASWTRG_TOGGLE (0x3u << 22) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_BCPB_Pos    24
#define TC_WAVEFORM_CMR_BCPB_Msk    (0x3u << TC_WAVEFORM_CMR_BCPB_Pos) /**< \brief (TC_WAVEFORM_CMR) RB Compare Effect on TIOB */
#define TC_WAVEFORM_CMR_BCPB(value) ((TC_WAVEFORM_CMR_BCPB_Msk & ((value) << TC_WAVEFORM_CMR_BCPB_Pos)))
#define   TC_WAVEFORM_CMR_BCPB_NONE (0x0u << 24) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_BCPB_SET  (0x1u << 24) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_BCPB_CLEAR (0x2u << 24) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_BCPB_TOGGLE (0x3u << 24) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_BCPC_Pos    26
#define TC_WAVEFORM_CMR_BCPC_Msk    (0x3u << TC_WAVEFORM_CMR_BCPC_Pos) /**< \brief (TC_WAVEFORM_CMR) RC Compare Effect on TIOB */
#define TC_WAVEFORM_CMR_BCPC(value) ((TC_WAVEFORM_CMR_BCPC_Msk & ((value) << TC_WAVEFORM_CMR_BCPC_Pos)))
#define   TC_WAVEFORM_CMR_BCPC_NONE (0x0u << 26) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_BCPC_SET  (0x1u << 26) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_BCPC_CLEAR (0x2u << 26) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_BCPC_TOGGLE (0x3u << 26) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_BEEVT_Pos    28
#define TC_WAVEFORM_CMR_BEEVT_Msk    (0x3u << TC_WAVEFORM_CMR_BEEVT_Pos) /**< \brief (TC_WAVEFORM_CMR) External Event Effect on TIOB */
#define TC_WAVEFORM_CMR_BEEVT(value) ((TC_WAVEFORM_CMR_BEEVT_Msk & ((value) << TC_WAVEFORM_CMR_BEEVT_Pos)))
#define   TC_WAVEFORM_CMR_BEEVT_NONE (0x0u << 28) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_BEEVT_SET (0x1u << 28) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_BEEVT_CLEAR (0x2u << 28) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_BEEVT_TOGGLE (0x3u << 28) /**< \brief (TC_WAVEFORM_CMR) toggle */
#define TC_WAVEFORM_CMR_BSWTRG_Pos    30
#define TC_WAVEFORM_CMR_BSWTRG_Msk    (0x3u << TC_WAVEFORM_CMR_BSWTRG_Pos) /**< \brief (TC_WAVEFORM_CMR) Software Trigger Effect on TIOB */
#define TC_WAVEFORM_CMR_BSWTRG(value) ((TC_WAVEFORM_CMR_BSWTRG_Msk & ((value) << TC_WAVEFORM_CMR_BSWTRG_Pos)))
#define   TC_WAVEFORM_CMR_BSWTRG_NONE (0x0u << 30) /**< \brief (TC_WAVEFORM_CMR) none */
#define   TC_WAVEFORM_CMR_BSWTRG_SET (0x1u << 30) /**< \brief (TC_WAVEFORM_CMR) set */
#define   TC_WAVEFORM_CMR_BSWTRG_CLEAR (0x2u << 30) /**< \brief (TC_WAVEFORM_CMR) clear */
#define   TC_WAVEFORM_CMR_BSWTRG_TOGGLE (0x3u << 30) /**< \brief (TC_WAVEFORM_CMR) toggle */
/* -------- TC_SMC : (TC Offset: 0x08) Channel Stepper Motor Mode Register -------- */
#define TC_SMC_GCEN                 (0x1u <<  0) /**< \brief (TC_SMC) Gray Count Enable */
#define TC_SMC_DOWN                 (0x1u <<  1) /**< \brief (TC_SMC) Down Count */
/* -------- TC_CV : (TC Offset: 0x10) Channel Counter Value Channel 0 -------- */
#define TC_CV_CV_Pos                0
#define TC_CV_CV_Msk                (0xFFFFu << TC_CV_CV_Pos) /**< \brief (TC_CV) Counter Value */
#define TC_CV_CV(value)             ((TC_CV_CV_Msk & ((value) << TC_CV_CV_Pos)))
/* -------- TC_RA : (TC Offset: 0x14) Channel Register A Channel 0 -------- */
#define TC_RA_RA_Pos                0
#define TC_RA_RA_Msk                (0xFFFFu << TC_RA_RA_Pos) /**< \brief (TC_RA) Register A */
#define TC_RA_RA(value)             ((TC_RA_RA_Msk & ((value) << TC_RA_RA_Pos)))
/* -------- TC_RB : (TC Offset: 0x18) Channel Register B Channel 0 -------- */
#define TC_RB_RB_Pos                0
#define TC_RB_RB_Msk                (0xFFFFu << TC_RB_RB_Pos) /**< \brief (TC_RB) Register B */
#define TC_RB_RB(value)             ((TC_RB_RB_Msk & ((value) << TC_RB_RB_Pos)))
/* -------- TC_RC : (TC Offset: 0x1C) Channel Register C Channel 0 -------- */
#define TC_RC_RC_Pos                0
#define TC_RC_RC_Msk                (0xFFFFu << TC_RC_RC_Pos) /**< \brief (TC_RC) Register C */
#define TC_RC_RC(value)             ((TC_RC_RC_Msk & ((value) << TC_RC_RC_Pos)))
/* -------- TC_SR : (TC Offset: 0x20) Channel Status Register Channel 0 -------- */
#define TC_SR_COVFS                 (0x1u <<  0) /**< \brief (TC_SR) Counter Overflow Status */
#define   TC_SR_COVFS_0             (0x0u <<  0) /**< \brief (TC_SR) No counter overflow has occurred since the last read of the Status Register. */
#define   TC_SR_COVFS_1             (0x1u <<  0) /**< \brief (TC_SR) A counter overflow has occurred since the last read of the Status Register. */
#define TC_SR_LOVRS                 (0x1u <<  1) /**< \brief (TC_SR) Load Overrun Status */
#define   TC_SR_LOVRS_0             (0x0u <<  1) /**< \brief (TC_SR) Load overrun has not occurred since the last read of the Status Register or WAVE:1. */
#define   TC_SR_LOVRS_1             (0x1u <<  1) /**< \brief (TC_SR) RA or RB have been loaded at least twice without any read of the corresponding register since the last read of the StatusRegister, if WAVE:0. */
#define TC_SR_CPAS                  (0x1u <<  2) /**< \brief (TC_SR) RA Compare Status */
#define   TC_SR_CPAS_0              (0x0u <<  2) /**< \brief (TC_SR) RA Compare has not occurred since the last read of the Status Register or WAVE:0. */
#define   TC_SR_CPAS_1              (0x1u <<  2) /**< \brief (TC_SR) RA Compare has occurred since the last read of the Status Register, if WAVE:1. */
#define TC_SR_CPBS                  (0x1u <<  3) /**< \brief (TC_SR) RB Compare Status */
#define   TC_SR_CPBS_0              (0x0u <<  3) /**< \brief (TC_SR) RB Compare has not occurred since the last read of the Status Register or WAVE:0. */
