Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief TRNG hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (TRNG Offset: 0x00) Control Register */
  RoReg   Reserved1[3];
  WoReg   IER;         /**< \brief (TRNG Offset: 0x10) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (TRNG Offset: 0x14) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (TRNG Offset: 0x18) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (TRNG Offset: 0x1C) Interrupt Status Register */
  RoReg   Reserved2[12];
  RoReg   ODATA;       /**< \brief (TRNG Offset: 0x50) Output Data Register */
  RoReg   Reserved3[42];
  RoReg   VERSION;     /**< \brief (TRNG Offset: 0xFC) Version Register */
} Trng;
#endif /* __ASSEMBLY__ */
/* -------- TRNG_CR : (TRNG Offset: 0x00) Control Register -------- */
#define TRNG_CR_ENABLE              (0x1u <<  0) /**< \brief (TRNG_CR) Enables the TRNG to provide random values */
#define TRNG_CR_KEY_Pos             8
#define TRNG_CR_KEY_Msk             (0xFFFFFFu << TRNG_CR_KEY_Pos) /**< \brief (TRNG_CR) Security Key */
#define TRNG_CR_KEY(value)          ((TRNG_CR_KEY_Msk & ((value) << TRNG_CR_KEY_Pos)))
/* -------- TRNG_IER : (TRNG Offset: 0x10) Interrupt Enable Register -------- */
#define TRNG_IER_DATRDY             (0x1u <<  0) /**< \brief (TRNG_IER) Data Ready Interrupt Enable */
/* -------- TRNG_IDR : (TRNG Offset: 0x14) Interrupt Disable Register -------- */
#define TRNG_IDR_DATRDY             (0x1u <<  0) /**< \brief (TRNG_IDR) Data Ready Interrupt Disable */
/* -------- TRNG_IMR : (TRNG Offset: 0x18) Interrupt Mask Register -------- */
#define TRNG_IMR_DATRDY             (0x1u <<  0) /**< \brief (TRNG_IMR) Data Ready Interrupt Mask */
/* -------- TRNG_ISR : (TRNG Offset: 0x1C) Interrupt Status Register -------- */
#define TRNG_ISR_DATRDY             (0x1u <<  0) /**< \brief (TRNG_ISR) Data Ready Interrupt Status */
/* -------- TRNG_ODATA : (TRNG Offset: 0x50) Output Data Register -------- */
#define TRNG_ODATA_ODATA            (0x1u <<  0) /**< \brief (TRNG_ODATA) Output Data */
/* -------- TRNG_VERSION : (TRNG Offset: 0xFC) Version Register -------- */
#define TRNG_VERSION_VERSION_Pos    0
#define TRNG_VERSION_VERSION_Msk    (0xFFFu << TRNG_VERSION_VERSION_Pos) /**< \brief (TRNG_VERSION) Version Number */
#define TRNG_VERSION_VERSION(value) ((TRNG_VERSION_VERSION_Msk & ((value) << TRNG_VERSION_VERSION_Pos)))
#define TRNG_VERSION_VARIANT_Pos    16
#define TRNG_VERSION_VARIANT_Msk    (0x7u << TRNG_VERSION_VARIANT_Pos) /**< \brief (TRNG_VERSION) Variant Number */
#define TRNG_VERSION_VARIANT(value) ((TRNG_VERSION_VARIANT_Msk & ((value) << TRNG_VERSION_VARIANT_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR TWIM */
/* ============================================================================= */
/** \addtogroup SAM4L4_TWIM Two-wire Master Interface */
/*@{*/

#define REV_TWIM       0x120

#ifndef __ASSEMBLY__
/** \brief TWIM hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (TWIM Offset: 0x00) Control Register */
  RwReg   CWGR;        /**< \brief (TWIM Offset: 0x04) Clock Waveform Generator Register */
  RwReg   SMBTR;       /**< \brief (TWIM Offset: 0x08) SMBus Timing Register */
  RwReg   CMDR;        /**< \brief (TWIM Offset: 0x0C) Command Register */
  RwReg   NCMDR;       /**< \brief (TWIM Offset: 0x10) Next Command Register */
  RoReg   RHR;         /**< \brief (TWIM Offset: 0x14) Receive Holding Register */
  WoReg   THR;         /**< \brief (TWIM Offset: 0x18) Transmit Holding Register */
  RoReg   SR;          /**< \brief (TWIM Offset: 0x1C) Status Register */
  WoReg   IER;         /**< \brief (TWIM Offset: 0x20) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (TWIM Offset: 0x24) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (TWIM Offset: 0x28) Interrupt Mask Register */
  WoReg   SCR;         /**< \brief (TWIM Offset: 0x2C) Status Clear Register */
  RoReg   PR;          /**< \brief (TWIM Offset: 0x30) Parameter Register */
  RoReg   VR;          /**< \brief (TWIM Offset: 0x34) Version Register */
  RwReg   HSCWGR;      /**< \brief (TWIM Offset: 0x38) HS-mode Clock Waveform Generator */
  RwReg   SRR;         /**< \brief (TWIM Offset: 0x3C) Slew Rate Register */
  RwReg   HSSRR;       /**< \brief (TWIM Offset: 0x40) HS-mode Slew Rate Register */
} Twim;
#endif /* __ASSEMBLY__ */
/* -------- TWIM_CR : (TWIM Offset: 0x00) Control Register -------- */
#define TWIM_CR_MEN                 (0x1u <<  0) /**< \brief (TWIM_CR) Master Enable */
#define TWIM_CR_MDIS                (0x1u <<  1) /**< \brief (TWIM_CR) Master Disable */
#define TWIM_CR_SMEN                (0x1u <<  4) /**< \brief (TWIM_CR) SMBus Enable */
#define TWIM_CR_SMDIS               (0x1u <<  5) /**< \brief (TWIM_CR) SMBus Disable */
#define TWIM_CR_SWRST               (0x1u <<  7) /**< \brief (TWIM_CR) Software Reset */
#define TWIM_CR_STOP                (0x1u <<  8) /**< \brief (TWIM_CR) Stop the current transfer */
/* -------- TWIM_CWGR : (TWIM Offset: 0x04) Clock Waveform Generator Register -------- */
#define TWIM_CWGR_LOW_Pos           0
#define TWIM_CWGR_LOW_Msk           (0xFFu << TWIM_CWGR_LOW_Pos) /**< \brief (TWIM_CWGR) Clock Low Cycles */
#define TWIM_CWGR_LOW(value)        ((TWIM_CWGR_LOW_Msk & ((value) << TWIM_CWGR_LOW_Pos)))
#define TWIM_CWGR_HIGH_Pos          8
#define TWIM_CWGR_HIGH_Msk          (0xFFu << TWIM_CWGR_HIGH_Pos) /**< \brief (TWIM_CWGR) Clock High Cycles */
#define TWIM_CWGR_HIGH(value)       ((TWIM_CWGR_HIGH_Msk & ((value) << TWIM_CWGR_HIGH_Pos)))
#define TWIM_CWGR_STASTO_Pos        16
#define TWIM_CWGR_STASTO_Msk        (0xFFu << TWIM_CWGR_STASTO_Pos) /**< \brief (TWIM_CWGR) START and STOP Cycles */
#define TWIM_CWGR_STASTO(value)     ((TWIM_CWGR_STASTO_Msk & ((value) << TWIM_CWGR_STASTO_Pos)))
#define TWIM_CWGR_DATA_Pos          24
#define TWIM_CWGR_DATA_Msk          (0xFu << TWIM_CWGR_DATA_Pos) /**< \brief (TWIM_CWGR) Data Setup and Hold Cycles */
#define TWIM_CWGR_DATA(value)       ((TWIM_CWGR_DATA_Msk & ((value) << TWIM_CWGR_DATA_Pos)))
#define TWIM_CWGR_EXP_Pos           28
#define TWIM_CWGR_EXP_Msk           (0x7u << TWIM_CWGR_EXP_Pos) /**< \brief (TWIM_CWGR) Clock Prescaler */
#define TWIM_CWGR_EXP(value)        ((TWIM_CWGR_EXP_Msk & ((value) << TWIM_CWGR_EXP_Pos)))
/* -------- TWIM_SMBTR : (TWIM Offset: 0x08) SMBus Timing Register -------- */
#define TWIM_SMBTR_TLOWS_Pos        0
#define TWIM_SMBTR_TLOWS_Msk        (0xFFu << TWIM_SMBTR_TLOWS_Pos) /**< \brief (TWIM_SMBTR) Slave Clock stretch maximum cycles */
#define TWIM_SMBTR_TLOWS(value)     ((TWIM_SMBTR_TLOWS_Msk & ((value) << TWIM_SMBTR_TLOWS_Pos)))
#define TWIM_SMBTR_TLOWM_Pos        8
#define TWIM_SMBTR_TLOWM_Msk        (0xFFu << TWIM_SMBTR_TLOWM_Pos) /**< \brief (TWIM_SMBTR) Master Clock stretch maximum cycles */
#define TWIM_SMBTR_TLOWM(value)     ((TWIM_SMBTR_TLOWM_Msk & ((value) << TWIM_SMBTR_TLOWM_Pos)))
#define TWIM_SMBTR_THMAX_Pos        16
#define TWIM_SMBTR_THMAX_Msk        (0xFFu << TWIM_SMBTR_THMAX_Pos) /**< \brief (TWIM_SMBTR) Clock High maximum cycles */
#define TWIM_SMBTR_THMAX(value)     ((TWIM_SMBTR_THMAX_Msk & ((value) << TWIM_SMBTR_THMAX_Pos)))
#define TWIM_SMBTR_EXP_Pos          28
#define TWIM_SMBTR_EXP_Msk          (0xFu << TWIM_SMBTR_EXP_Pos) /**< \brief (TWIM_SMBTR) SMBus Timeout Clock prescaler */
#define TWIM_SMBTR_EXP(value)       ((TWIM_SMBTR_EXP_Msk & ((value) << TWIM_SMBTR_EXP_Pos)))
/* -------- TWIM_CMDR : (TWIM Offset: 0x0C) Command Register -------- */
#define TWIM_CMDR_READ              (0x1u <<  0) /**< \brief (TWIM_CMDR) Transfer Direction */
#define TWIM_CMDR_SADR_Pos          1
#define TWIM_CMDR_SADR_Msk          (0x3FFu << TWIM_CMDR_SADR_Pos) /**< \brief (TWIM_CMDR) Slave Address */
#define TWIM_CMDR_SADR(value)       ((TWIM_CMDR_SADR_Msk & ((value) << TWIM_CMDR_SADR_Pos)))
#define TWIM_CMDR_TENBIT            (0x1u << 11) /**< \brief (TWIM_CMDR) Ten Bit Addressing Mode */
#define TWIM_CMDR_REPSAME           (0x1u << 12) /**< \brief (TWIM_CMDR) Transfer is to same address as previous address */
#define TWIM_CMDR_START             (0x1u << 13) /**< \brief (TWIM_CMDR) Send START condition */
#define TWIM_CMDR_STOP              (0x1u << 14) /**< \brief (TWIM_CMDR) Send STOP condition */
#define TWIM_CMDR_VALID             (0x1u << 15) /**< \brief (TWIM_CMDR) CMDR Valid */
#define TWIM_CMDR_NBYTES_Pos        16
#define TWIM_CMDR_NBYTES_Msk        (0xFFu << TWIM_CMDR_NBYTES_Pos) /**< \brief (TWIM_CMDR) Number of data bytes in transfer */
#define TWIM_CMDR_NBYTES(value)     ((TWIM_CMDR_NBYTES_Msk & ((value) << TWIM_CMDR_NBYTES_Pos)))
#define TWIM_CMDR_PECEN             (0x1u << 24) /**< \brief (TWIM_CMDR) Packet Error Checking Enable */
#define TWIM_CMDR_ACKLAST           (0x1u << 25) /**< \brief (TWIM_CMDR) ACK Last Master RX Byte */
#define TWIM_CMDR_HS                (0x1u << 26) /**< \brief (TWIM_CMDR) HS-mode */
#define TWIM_CMDR_HSMCODE_Pos       28
#define TWIM_CMDR_HSMCODE_Msk       (0x7u << TWIM_CMDR_HSMCODE_Pos) /**< \brief (TWIM_CMDR) HS-mode Master Code */
#define TWIM_CMDR_HSMCODE(value)    ((TWIM_CMDR_HSMCODE_Msk & ((value) << TWIM_CMDR_HSMCODE_Pos)))
/* -------- TWIM_NCMDR : (TWIM Offset: 0x10) Next Command Register -------- */
#define TWIM_NCMDR_READ             (0x1u <<  0) /**< \brief (TWIM_NCMDR) Transfer Direction */
#define TWIM_NCMDR_SADR_Pos         1
#define TWIM_NCMDR_SADR_Msk         (0x3FFu << TWIM_NCMDR_SADR_Pos) /**< \brief (TWIM_NCMDR) Slave Address */
#define TWIM_NCMDR_SADR(value)      ((TWIM_NCMDR_SADR_Msk & ((value) << TWIM_NCMDR_SADR_Pos)))
#define TWIM_NCMDR_TENBIT           (0x1u << 11) /**< \brief (TWIM_NCMDR) Ten Bit Addressing Mode */
#define TWIM_NCMDR_REPSAME          (0x1u << 12) /**< \brief (TWIM_NCMDR) Transfer is to same address as previous address */
#define TWIM_NCMDR_START            (0x1u << 13) /**< \brief (TWIM_NCMDR) Send START condition */
#define TWIM_NCMDR_STOP             (0x1u << 14) /**< \brief (TWIM_NCMDR) Send STOP condition */
#define TWIM_NCMDR_VALID            (0x1u << 15) /**< \brief (TWIM_NCMDR) CMDR Valid */
#define TWIM_NCMDR_NBYTES_Pos       16
#define TWIM_NCMDR_NBYTES_Msk       (0xFFu << TWIM_NCMDR_NBYTES_Pos) /**< \brief (TWIM_NCMDR) Number of data bytes in transfer */
#define TWIM_NCMDR_NBYTES(value)    ((TWIM_NCMDR_NBYTES_Msk & ((value) << TWIM_NCMDR_NBYTES_Pos)))
#define TWIM_NCMDR_PECEN            (0x1u << 24) /**< \brief (TWIM_NCMDR) Packet Error Checking Enable */
#define TWIM_NCMDR_ACKLAST          (0x1u << 25) /**< \brief (TWIM_NCMDR) ACK Last Master RX Byte */
#define TWIM_NCMDR_HS               (0x1u << 26) /**< \brief (TWIM_NCMDR) HS-mode */
#define TWIM_NCMDR_HSMCODE_Pos      28
#define TWIM_NCMDR_HSMCODE_Msk      (0x7u << TWIM_NCMDR_HSMCODE_Pos) /**< \brief (TWIM_NCMDR) HS-mode Master Code */
#define TWIM_NCMDR_HSMCODE(value)   ((TWIM_NCMDR_HSMCODE_Msk & ((value) << TWIM_NCMDR_HSMCODE_Pos)))
/* -------- TWIM_RHR : (TWIM Offset: 0x14) Receive Holding Register -------- */
#define TWIM_RHR_RXDATA_Pos         0
#define TWIM_RHR_RXDATA_Msk         (0xFFu << TWIM_RHR_RXDATA_Pos) /**< \brief (TWIM_RHR) Received Data */
#define TWIM_RHR_RXDATA(value)      ((TWIM_RHR_RXDATA_Msk & ((value) << TWIM_RHR_RXDATA_Pos)))
/* -------- TWIM_THR : (TWIM Offset: 0x18) Transmit Holding Register -------- */
#define TWIM_THR_TXDATA_Pos         0
#define TWIM_THR_TXDATA_Msk         (0xFFu << TWIM_THR_TXDATA_Pos) /**< \brief (TWIM_THR) Data to Transmit */
#define TWIM_THR_TXDATA(value)      ((TWIM_THR_TXDATA_Msk & ((value) << TWIM_THR_TXDATA_Pos)))
/* -------- TWIM_SR : (TWIM Offset: 0x1C) Status Register -------- */
#define TWIM_SR_RXRDY               (0x1u <<  0) /**< \brief (TWIM_SR) RHR Data Ready */
#define TWIM_SR_TXRDY               (0x1u <<  1) /**< \brief (TWIM_SR) THR Data Ready */
#define TWIM_SR_CRDY                (0x1u <<  2) /**< \brief (TWIM_SR) Ready for More Commands */
#define TWIM_SR_CCOMP               (0x1u <<  3) /**< \brief (TWIM_SR) Command Complete */
#define TWIM_SR_IDLE                (0x1u <<  4) /**< \brief (TWIM_SR) Master Interface is Idle */
#define TWIM_SR_BUSFREE             (0x1u <<  5) /**< \brief (TWIM_SR) Two-wire Bus is Free */
#define TWIM_SR_ANAK                (0x1u <<  8) /**< \brief (TWIM_SR) NAK in Address Phase Received */
#define TWIM_SR_DNAK                (0x1u <<  9) /**< \brief (TWIM_SR) NAK in Data Phase Received */
#define TWIM_SR_ARBLST              (0x1u << 10) /**< \brief (TWIM_SR) Arbitration Lost */
#define TWIM_SR_SMBALERT            (0x1u << 11) /**< \brief (TWIM_SR) SMBus Alert */
#define TWIM_SR_TOUT                (0x1u << 12) /**< \brief (TWIM_SR) Timeout */
#define TWIM_SR_PECERR              (0x1u << 13) /**< \brief (TWIM_SR) PEC Error */
#define TWIM_SR_STOP                (0x1u << 14) /**< \brief (TWIM_SR) Stop Request Accepted */
#define TWIM_SR_MENB                (0x1u << 16) /**< \brief (TWIM_SR) Master Interface Enable */
#define TWIM_SR_HSMCACK             (0x1u << 17) /**< \brief (TWIM_SR) ACK in HS-mode Master Code Phase Received */
/* -------- TWIM_IER : (TWIM Offset: 0x20) Interrupt Enable Register -------- */
#define TWIM_IER_RXRDY              (0x1u <<  0) /**< \brief (TWIM_IER) RHR Data Ready */
#define TWIM_IER_TXRDY              (0x1u <<  1) /**< \brief (TWIM_IER) THR Data Ready */
#define TWIM_IER_CRDY               (0x1u <<  2) /**< \brief (TWIM_IER) Ready for More Commands */
#define TWIM_IER_CCOMP              (0x1u <<  3) /**< \brief (TWIM_IER) Command Complete */
#define TWIM_IER_IDLE               (0x1u <<  4) /**< \brief (TWIM_IER) Master Interface is Idle */
#define TWIM_IER_BUSFREE            (0x1u <<  5) /**< \brief (TWIM_IER) Two-wire Bus is Free */
#define TWIM_IER_ANAK               (0x1u <<  8) /**< \brief (TWIM_IER) NAK in Address Phase Received */
#define TWIM_IER_DNAK               (0x1u <<  9) /**< \brief (TWIM_IER) NAK in Data Phase Received */
#define TWIM_IER_ARBLST             (0x1u << 10) /**< \brief (TWIM_IER) Arbitration Lost */
#define TWIM_IER_SMBALERT           (0x1u << 11) /**< \brief (TWIM_IER) SMBus Alert */
#define TWIM_IER_TOUT               (0x1u << 12) /**< \brief (TWIM_IER) Timeout */
#define TWIM_IER_PECERR             (0x1u << 13) /**< \brief (TWIM_IER) PEC Error */
#define TWIM_IER_STOP               (0x1u << 14) /**< \brief (TWIM_IER) Stop Request Accepted */
#define TWIM_IER_HSMCACK            (0x1u << 17) /**< \brief (TWIM_IER) ACK in HS-mode Master Code Phase Received */
/* -------- TWIM_IDR : (TWIM Offset: 0x24) Interrupt Disable Register -------- */
#define TWIM_IDR_RXRDY              (0x1u <<  0) /**< \brief (TWIM_IDR) RHR Data Ready */
#define TWIM_IDR_TXRDY              (0x1u <<  1) /**< \brief (TWIM_IDR) THR Data Ready */
#define TWIM_IDR_CRDY               (0x1u <<  2) /**< \brief (TWIM_IDR) Ready for More Commands */
#define TWIM_IDR_CCOMP              (0x1u <<  3) /**< \brief (TWIM_IDR) Command Complete */
#define TWIM_IDR_IDLE               (0x1u <<  4) /**< \brief (TWIM_IDR) Master Interface is Idle */
#define TWIM_IDR_BUSFREE            (0x1u <<  5) /**< \brief (TWIM_IDR) Two-wire Bus is Free */
#define TWIM_IDR_ANAK               (0x1u <<  8) /**< \brief (TWIM_IDR) NAK in Address Phase Received */
#define TWIM_IDR_DNAK               (0x1u <<  9) /**< \brief (TWIM_IDR) NAK in Data Phase Received */
#define TWIM_IDR_ARBLST             (0x1u << 10) /**< \brief (TWIM_IDR) Arbitration Lost */
#define TWIM_IDR_SMBALERT           (0x1u << 11) /**< \brief (TWIM_IDR) SMBus Alert */
#define TWIM_IDR_TOUT               (0x1u << 12) /**< \brief (TWIM_IDR) Timeout */
#define TWIM_IDR_PECERR             (0x1u << 13) /**< \brief (TWIM_IDR) PEC Error */
#define TWIM_IDR_STOP               (0x1u << 14) /**< \brief (TWIM_IDR) Stop Request Accepted */
#define TWIM_IDR_HSMCACK            (0x1u << 17) /**< \brief (TWIM_IDR) ACK in HS-mode Master Code Phase Received */
/* -------- TWIM_IMR : (TWIM Offset: 0x28) Interrupt Mask Register -------- */
#define TWIM_IMR_RXRDY              (0x1u <<  0) /**< \brief (TWIM_IMR) RHR Data Ready */
#define TWIM_IMR_TXRDY              (0x1u <<  1) /**< \brief (TWIM_IMR) THR Data Ready */
#define TWIM_IMR_CRDY               (0x1u <<  2) /**< \brief (TWIM_IMR) Ready for More Commands */
#define TWIM_IMR_CCOMP              (0x1u <<  3) /**< \brief (TWIM_IMR) Command Complete */
#define TWIM_IMR_IDLE               (0x1u <<  4) /**< \brief (TWIM_IMR) Master Interface is Idle */
#define TWIM_IMR_BUSFREE            (0x1u <<  5) /**< \brief (TWIM_IMR) Two-wire Bus is Free */
#define TWIM_IMR_ANAK               (0x1u <<  8) /**< \brief (TWIM_IMR) NAK in Address Phase Received */
#define TWIM_IMR_DNAK               (0x1u <<  9) /**< \brief (TWIM_IMR) NAK in Data Phase Received */
#define TWIM_IMR_ARBLST             (0x1u << 10) /**< \brief (TWIM_IMR) Arbitration Lost */
#define TWIM_IMR_SMBALERT           (0x1u << 11) /**< \brief (TWIM_IMR) SMBus Alert */
#define TWIM_IMR_TOUT               (0x1u << 12) /**< \brief (TWIM_IMR) Timeout */
#define TWIM_IMR_PECERR             (0x1u << 13) /**< \brief (TWIM_IMR) PEC Error */
#define TWIM_IMR_STOP               (0x1u << 14) /**< \brief (TWIM_IMR) Stop Request Accepted */
#define TWIM_IMR_HSMCACK            (0x1u << 17) /**< \brief (TWIM_IMR) ACK in HS-mode Master Code Phase Received */
/* -------- TWIM_SCR : (TWIM Offset: 0x2C) Status Clear Register -------- */
#define TWIM_SCR_CCOMP              (0x1u <<  3) /**< \brief (TWIM_SCR) Command Complete */
#define TWIM_SCR_ANAK               (0x1u <<  8) /**< \brief (TWIM_SCR) NAK in Address Phase Received */
#define TWIM_SCR_DNAK               (0x1u <<  9) /**< \brief (TWIM_SCR) NAK in Data Phase Received */
#define TWIM_SCR_ARBLST             (0x1u << 10) /**< \brief (TWIM_SCR) Arbitration Lost */
#define TWIM_SCR_SMBALERT           (0x1u << 11) /**< \brief (TWIM_SCR) SMBus Alert */
#define TWIM_SCR_TOUT               (0x1u << 12) /**< \brief (TWIM_SCR) Timeout */
#define TWIM_SCR_PECERR             (0x1u << 13) /**< \brief (TWIM_SCR) PEC Error */
#define TWIM_SCR_STOP               (0x1u << 14) /**< \brief (TWIM_SCR) Stop Request Accepted */
#define TWIM_SCR_HSMCACK            (0x1u << 17) /**< \brief (TWIM_SCR) ACK in HS-mode Master Code Phase Received */
/* -------- TWIM_PR : (TWIM Offset: 0x30) Parameter Register -------- */
#define TWIM_PR_HS                  (0x1u <<  0) /**< \brief (TWIM_PR) HS-mode */
/* -------- TWIM_VR : (TWIM Offset: 0x34) Version Register -------- */
#define TWIM_VR_VERSION_Pos         0
#define TWIM_VR_VERSION_Msk         (0xFFFu << TWIM_VR_VERSION_Pos) /**< \brief (TWIM_VR) Version number */
#define TWIM_VR_VERSION(value)      ((TWIM_VR_VERSION_Msk & ((value) << TWIM_VR_VERSION_Pos)))
#define TWIM_VR_VARIANT_Pos         16
#define TWIM_VR_VARIANT_Msk         (0xFu << TWIM_VR_VARIANT_Pos) /**< \brief (TWIM_VR) Variant number */
#define TWIM_VR_VARIANT(value)      ((TWIM_VR_VARIANT_Msk & ((value) << TWIM_VR_VARIANT_Pos)))
/* -------- TWIM_HSCWGR : (TWIM Offset: 0x38) HS-mode Clock Waveform Generator -------- */
#define TWIM_HSCWGR_LOW_Pos         0
#define TWIM_HSCWGR_LOW_Msk         (0xFFu << TWIM_HSCWGR_LOW_Pos) /**< \brief (TWIM_HSCWGR) Clock Low Cycles */
#define TWIM_HSCWGR_LOW(value)      ((TWIM_HSCWGR_LOW_Msk & ((value) << TWIM_HSCWGR_LOW_Pos)))
#define TWIM_HSCWGR_HIGH_Pos        8
#define TWIM_HSCWGR_HIGH_Msk        (0xFFu << TWIM_HSCWGR_HIGH_Pos) /**< \brief (TWIM_HSCWGR) Clock High Cycles */
#define TWIM_HSCWGR_HIGH(value)     ((TWIM_HSCWGR_HIGH_Msk & ((value) << TWIM_HSCWGR_HIGH_Pos)))
#define TWIM_HSCWGR_STASTO_Pos      16
#define TWIM_HSCWGR_STASTO_Msk      (0xFFu << TWIM_HSCWGR_STASTO_Pos) /**< \brief (TWIM_HSCWGR) START and STOP Cycles */
#define TWIM_HSCWGR_STASTO(value)   ((TWIM_HSCWGR_STASTO_Msk & ((value) << TWIM_HSCWGR_STASTO_Pos)))
#define TWIM_HSCWGR_DATA_Pos        24
#define TWIM_HSCWGR_DATA_Msk        (0xFu << TWIM_HSCWGR_DATA_Pos) /**< \brief (TWIM_HSCWGR) Data Setup and Hold Cycles */
#define TWIM_HSCWGR_DATA(value)     ((TWIM_HSCWGR_DATA_Msk & ((value) << TWIM_HSCWGR_DATA_Pos)))
#define TWIM_HSCWGR_EXP_Pos         28
#define TWIM_HSCWGR_EXP_Msk         (0x7u << TWIM_HSCWGR_EXP_Pos) /**< \brief (TWIM_HSCWGR) Clock Prescaler */
#define TWIM_HSCWGR_EXP(value)      ((TWIM_HSCWGR_EXP_Msk & ((value) << TWIM_HSCWGR_EXP_Pos)))
/* -------- TWIM_SRR : (TWIM Offset: 0x3C) Slew Rate Register -------- */
#define TWIM_SRR_DADRIVEL_Pos       0
#define TWIM_SRR_DADRIVEL_Msk       (0x7u << TWIM_SRR_DADRIVEL_Pos) /**< \brief (TWIM_SRR) Data Drive Strength LOW */
#define TWIM_SRR_DADRIVEL(value)    ((TWIM_SRR_DADRIVEL_Msk & ((value) << TWIM_SRR_DADRIVEL_Pos)))
#define TWIM_SRR_DASLEW_Pos         8
#define TWIM_SRR_DASLEW_Msk         (0x3u << TWIM_SRR_DASLEW_Pos) /**< \brief (TWIM_SRR) Data Slew Limit */
#define TWIM_SRR_DASLEW(value)      ((TWIM_SRR_DASLEW_Msk & ((value) << TWIM_SRR_DASLEW_Pos)))
#define TWIM_SRR_CLDRIVEL_Pos       16
#define TWIM_SRR_CLDRIVEL_Msk       (0x7u << TWIM_SRR_CLDRIVEL_Pos) /**< \brief (TWIM_SRR) Clock Drive Strength LOW */
#define TWIM_SRR_CLDRIVEL(value)    ((TWIM_SRR_CLDRIVEL_Msk & ((value) << TWIM_SRR_CLDRIVEL_Pos)))
#define TWIM_SRR_CLSLEW_Pos         24
#define TWIM_SRR_CLSLEW_Msk         (0x3u << TWIM_SRR_CLSLEW_Pos) /**< \brief (TWIM_SRR) Clock Slew Limit */
#define TWIM_SRR_CLSLEW(value)      ((TWIM_SRR_CLSLEW_Msk & ((value) << TWIM_SRR_CLSLEW_Pos)))
#define TWIM_SRR_FILTER_Pos         28
#define TWIM_SRR_FILTER_Msk         (0x3u << TWIM_SRR_FILTER_Pos) /**< \brief (TWIM_SRR) Input Spike Filter Control */
#define TWIM_SRR_FILTER(value)      ((TWIM_SRR_FILTER_Msk & ((value) << TWIM_SRR_FILTER_Pos)))
/* -------- TWIM_HSSRR : (TWIM Offset: 0x40) HS-mode Slew Rate Register -------- */
#define TWIM_HSSRR_DADRIVEL_Pos     0
#define TWIM_HSSRR_DADRIVEL_Msk     (0x7u << TWIM_HSSRR_DADRIVEL_Pos) /**< \brief (TWIM_HSSRR) Data Drive Strength LOW */
#define TWIM_HSSRR_DADRIVEL(value)  ((TWIM_HSSRR_DADRIVEL_Msk & ((value) << TWIM_HSSRR_DADRIVEL_Pos)))
#define TWIM_HSSRR_DASLEW_Pos       8
#define TWIM_HSSRR_DASLEW_Msk       (0x3u << TWIM_HSSRR_DASLEW_Pos) /**< \brief (TWIM_HSSRR) Data Slew Limit */
#define TWIM_HSSRR_DASLEW(value)    ((TWIM_HSSRR_DASLEW_Msk & ((value) << TWIM_HSSRR_DASLEW_Pos)))
#define TWIM_HSSRR_CLDRIVEL_Pos     16
#define TWIM_HSSRR_CLDRIVEL_Msk     (0x7u << TWIM_HSSRR_CLDRIVEL_Pos) /**< \brief (TWIM_HSSRR) Clock Drive Strength LOW */
#define TWIM_HSSRR_CLDRIVEL(value)  ((TWIM_HSSRR_CLDRIVEL_Msk & ((value) << TWIM_HSSRR_CLDRIVEL_Pos)))
#define TWIM_HSSRR_CLDRIVEH_Pos     20
#define TWIM_HSSRR_CLDRIVEH_Msk     (0x3u << TWIM_HSSRR_CLDRIVEH_Pos) /**< \brief (TWIM_HSSRR) Clock Drive Strength HIGH */
#define TWIM_HSSRR_CLDRIVEH(value)  ((TWIM_HSSRR_CLDRIVEH_Msk & ((value) << TWIM_HSSRR_CLDRIVEH_Pos)))
#define TWIM_HSSRR_CLSLEW_Pos       24
#define TWIM_HSSRR_CLSLEW_Msk       (0x3u << TWIM_HSSRR_CLSLEW_Pos) /**< \brief (TWIM_HSSRR) Clock Slew Limit */
#define TWIM_HSSRR_CLSLEW(value)    ((TWIM_HSSRR_CLSLEW_Msk & ((value) << TWIM_HSSRR_CLSLEW_Pos)))
#define TWIM_HSSRR_FILTER_Pos       28
#define TWIM_HSSRR_FILTER_Msk       (0x3u << TWIM_HSSRR_FILTER_Pos) /**< \brief (TWIM_HSSRR) Input Spike Filter Control */
#define TWIM_HSSRR_FILTER(value)    ((TWIM_HSSRR_FILTER_Msk & ((value) << TWIM_HSSRR_FILTER_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR TWIS */
/* ============================================================================= */
/** \addtogroup SAM4L4_TWIS Two-wire Slave Interface */
/*@{*/

#define REV_TWIS       0x140

