Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief TWIS hardware registers */
typedef struct {
  RwReg   CR;          /**< \brief (TWIS Offset: 0x00) Control Register */
  RwReg   NBYTES;      /**< \brief (TWIS Offset: 0x04) NBYTES Register */
  RwReg   TR;          /**< \brief (TWIS Offset: 0x08) Timing Register */
  RoReg   RHR;         /**< \brief (TWIS Offset: 0x0C) Receive Holding Register */
  WoReg   THR;         /**< \brief (TWIS Offset: 0x10) Transmit Holding Register */
  RoReg   PECR;        /**< \brief (TWIS Offset: 0x14) Packet Error Check Register */
  RoReg   SR;          /**< \brief (TWIS Offset: 0x18) Status Register */
  WoReg   IER;         /**< \brief (TWIS Offset: 0x1C) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (TWIS Offset: 0x20) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (TWIS Offset: 0x24) Interrupt Mask Register */
  WoReg   SCR;         /**< \brief (TWIS Offset: 0x28) Status Clear Register */
  RoReg   PR;          /**< \brief (TWIS Offset: 0x2C) Parameter Register */
  RoReg   VR;          /**< \brief (TWIS Offset: 0x30) Version Register */
  RwReg   HSTR;        /**< \brief (TWIS Offset: 0x34) HS-mode Timing Register */
  RwReg   SRR;         /**< \brief (TWIS Offset: 0x38) Slew Rate Register */
  RwReg   HSSRR;       /**< \brief (TWIS Offset: 0x3C) HS-mode Slew Rate Register */
} Twis;
#endif /* __ASSEMBLY__ */
/* -------- TWIS_CR : (TWIS Offset: 0x00) Control Register -------- */
#define TWIS_CR_SEN                 (0x1u <<  0) /**< \brief (TWIS_CR) Slave Enable */
#define TWIS_CR_SMEN                (0x1u <<  1) /**< \brief (TWIS_CR) SMBus Mode Enable */
#define TWIS_CR_SMATCH              (0x1u <<  2) /**< \brief (TWIS_CR) Slave Address Match */
#define TWIS_CR_GCMATCH             (0x1u <<  3) /**< \brief (TWIS_CR) General Call Address Match */
#define TWIS_CR_STREN               (0x1u <<  4) /**< \brief (TWIS_CR) Clock Stretch Enable */
#define TWIS_CR_SWRST               (0x1u <<  7) /**< \brief (TWIS_CR) Software Reset */
#define TWIS_CR_SMBALERT            (0x1u <<  8) /**< \brief (TWIS_CR) SMBus Alert */
#define TWIS_CR_SMDA                (0x1u <<  9) /**< \brief (TWIS_CR) SMBus Default Address */
#define TWIS_CR_SMHH                (0x1u << 10) /**< \brief (TWIS_CR) SMBus Host Header */
#define TWIS_CR_PECEN               (0x1u << 11) /**< \brief (TWIS_CR) Packet Error Checking Enable */
#define TWIS_CR_ACK                 (0x1u << 12) /**< \brief (TWIS_CR) Slave Receiver Data Phase ACK Value */
#define TWIS_CR_CUP                 (0x1u << 13) /**< \brief (TWIS_CR) NBYTES Count Up */
#define TWIS_CR_SOAM                (0x1u << 14) /**< \brief (TWIS_CR) Stretch Clock on Address Match */
#define TWIS_CR_SODR                (0x1u << 15) /**< \brief (TWIS_CR) Stretch Clock on Data Byte Reception */
#define TWIS_CR_ADR_Pos             16
#define TWIS_CR_ADR_Msk             (0x3FFu << TWIS_CR_ADR_Pos) /**< \brief (TWIS_CR) Slave Address */
#define TWIS_CR_ADR(value)          ((TWIS_CR_ADR_Msk & ((value) << TWIS_CR_ADR_Pos)))
#define TWIS_CR_TENBIT              (0x1u << 26) /**< \brief (TWIS_CR) Ten Bit Address Match */
#define TWIS_CR_BRIDGE              (0x1u << 27) /**< \brief (TWIS_CR) Bridge Control Enable */
/* -------- TWIS_NBYTES : (TWIS Offset: 0x04) NBYTES Register -------- */
#define TWIS_NBYTES_NBYTES_Pos      0
#define TWIS_NBYTES_NBYTES_Msk      (0xFFu << TWIS_NBYTES_NBYTES_Pos) /**< \brief (TWIS_NBYTES) Number of Bytes to Transfer */
#define TWIS_NBYTES_NBYTES(value)   ((TWIS_NBYTES_NBYTES_Msk & ((value) << TWIS_NBYTES_NBYTES_Pos)))
/* -------- TWIS_TR : (TWIS Offset: 0x08) Timing Register -------- */
#define TWIS_TR_TLOWS_Pos           0
#define TWIS_TR_TLOWS_Msk           (0xFFu << TWIS_TR_TLOWS_Pos) /**< \brief (TWIS_TR) SMBus Tlow:sext Cycles */
#define TWIS_TR_TLOWS(value)        ((TWIS_TR_TLOWS_Msk & ((value) << TWIS_TR_TLOWS_Pos)))
#define TWIS_TR_TTOUT_Pos           8
#define TWIS_TR_TTOUT_Msk           (0xFFu << TWIS_TR_TTOUT_Pos) /**< \brief (TWIS_TR) SMBus Ttimeout Cycles */
#define TWIS_TR_TTOUT(value)        ((TWIS_TR_TTOUT_Msk & ((value) << TWIS_TR_TTOUT_Pos)))
#define TWIS_TR_SUDAT_Pos           16
#define TWIS_TR_SUDAT_Msk           (0xFFu << TWIS_TR_SUDAT_Pos) /**< \brief (TWIS_TR) Data Setup Cycles */
#define TWIS_TR_SUDAT(value)        ((TWIS_TR_SUDAT_Msk & ((value) << TWIS_TR_SUDAT_Pos)))
#define TWIS_TR_EXP_Pos             28
#define TWIS_TR_EXP_Msk             (0xFu << TWIS_TR_EXP_Pos) /**< \brief (TWIS_TR) Clock Prescaler */
#define TWIS_TR_EXP(value)          ((TWIS_TR_EXP_Msk & ((value) << TWIS_TR_EXP_Pos)))
/* -------- TWIS_RHR : (TWIS Offset: 0x0C) Receive Holding Register -------- */
#define TWIS_RHR_RXDATA_Pos         0
#define TWIS_RHR_RXDATA_Msk         (0xFFu << TWIS_RHR_RXDATA_Pos) /**< \brief (TWIS_RHR) Received Data Byte */
#define TWIS_RHR_RXDATA(value)      ((TWIS_RHR_RXDATA_Msk & ((value) << TWIS_RHR_RXDATA_Pos)))
/* -------- TWIS_THR : (TWIS Offset: 0x10) Transmit Holding Register -------- */
#define TWIS_THR_TXDATA_Pos         0
#define TWIS_THR_TXDATA_Msk         (0xFFu << TWIS_THR_TXDATA_Pos) /**< \brief (TWIS_THR) Data Byte to Transmit */
#define TWIS_THR_TXDATA(value)      ((TWIS_THR_TXDATA_Msk & ((value) << TWIS_THR_TXDATA_Pos)))
/* -------- TWIS_PECR : (TWIS Offset: 0x14) Packet Error Check Register -------- */
#define TWIS_PECR_PEC_Pos           0
#define TWIS_PECR_PEC_Msk           (0xFFu << TWIS_PECR_PEC_Pos) /**< \brief (TWIS_PECR) Calculated PEC Value */
#define TWIS_PECR_PEC(value)        ((TWIS_PECR_PEC_Msk & ((value) << TWIS_PECR_PEC_Pos)))
/* -------- TWIS_SR : (TWIS Offset: 0x18) Status Register -------- */
#define TWIS_SR_RXRDY               (0x1u <<  0) /**< \brief (TWIS_SR) RX Buffer Ready */
#define TWIS_SR_TXRDY               (0x1u <<  1) /**< \brief (TWIS_SR) TX Buffer Ready */
#define TWIS_SR_SEN                 (0x1u <<  2) /**< \brief (TWIS_SR) Slave Enabled */
#define TWIS_SR_TCOMP               (0x1u <<  3) /**< \brief (TWIS_SR) Transmission Complete */
#define TWIS_SR_TRA                 (0x1u <<  5) /**< \brief (TWIS_SR) Transmitter Mode */
#define TWIS_SR_URUN                (0x1u <<  6) /**< \brief (TWIS_SR) Underrun */
#define TWIS_SR_ORUN                (0x1u <<  7) /**< \brief (TWIS_SR) Overrun */
#define TWIS_SR_NAK                 (0x1u <<  8) /**< \brief (TWIS_SR) NAK Received */
#define TWIS_SR_SMBTOUT             (0x1u << 12) /**< \brief (TWIS_SR) SMBus Timeout */
#define TWIS_SR_SMBPECERR           (0x1u << 13) /**< \brief (TWIS_SR) SMBus PEC Error */
#define TWIS_SR_BUSERR              (0x1u << 14) /**< \brief (TWIS_SR) Bus Error */
#define TWIS_SR_SAM                 (0x1u << 16) /**< \brief (TWIS_SR) Slave Address Match */
#define TWIS_SR_GCM                 (0x1u << 17) /**< \brief (TWIS_SR) General Call Match */
#define TWIS_SR_SMBALERTM           (0x1u << 18) /**< \brief (TWIS_SR) SMBus Alert Response Address Match */
#define TWIS_SR_SMBHHM              (0x1u << 19) /**< \brief (TWIS_SR) SMBus Host Header Address Match */
#define TWIS_SR_SMBDAM              (0x1u << 20) /**< \brief (TWIS_SR) SMBus Default Address Match */
#define TWIS_SR_STO                 (0x1u << 21) /**< \brief (TWIS_SR) Stop Received */
#define TWIS_SR_REP                 (0x1u << 22) /**< \brief (TWIS_SR) Repeated Start Received */
#define TWIS_SR_BTF                 (0x1u << 23) /**< \brief (TWIS_SR) Byte Transfer Finished */
/* -------- TWIS_IER : (TWIS Offset: 0x1C) Interrupt Enable Register -------- */
#define TWIS_IER_RXRDY              (0x1u <<  0) /**< \brief (TWIS_IER) RX Buffer Ready */
#define TWIS_IER_TXRDY              (0x1u <<  1) /**< \brief (TWIS_IER) TX Buffer Ready */
#define TWIS_IER_TCOMP              (0x1u <<  3) /**< \brief (TWIS_IER) Transmission Complete */
#define TWIS_IER_URUN               (0x1u <<  6) /**< \brief (TWIS_IER) Underrun */
#define TWIS_IER_ORUN               (0x1u <<  7) /**< \brief (TWIS_IER) Overrun */
#define TWIS_IER_NAK                (0x1u <<  8) /**< \brief (TWIS_IER) NAK Received */
#define TWIS_IER_SMBTOUT            (0x1u << 12) /**< \brief (TWIS_IER) SMBus Timeout */
#define TWIS_IER_SMBPECERR          (0x1u << 13) /**< \brief (TWIS_IER) SMBus PEC Error */
#define TWIS_IER_BUSERR             (0x1u << 14) /**< \brief (TWIS_IER) Bus Error */
#define TWIS_IER_SAM                (0x1u << 16) /**< \brief (TWIS_IER) Slave Address Match */
#define TWIS_IER_GCM                (0x1u << 17) /**< \brief (TWIS_IER) General Call Match */
#define TWIS_IER_SMBALERTM          (0x1u << 18) /**< \brief (TWIS_IER) SMBus Alert Response Address Match */
#define TWIS_IER_SMBHHM             (0x1u << 19) /**< \brief (TWIS_IER) SMBus Host Header Address Match */
#define TWIS_IER_SMBDAM             (0x1u << 20) /**< \brief (TWIS_IER) SMBus Default Address Match */
#define TWIS_IER_STO                (0x1u << 21) /**< \brief (TWIS_IER) Stop Received */
#define TWIS_IER_REP                (0x1u << 22) /**< \brief (TWIS_IER) Repeated Start Received */
#define TWIS_IER_BTF                (0x1u << 23) /**< \brief (TWIS_IER) Byte Transfer Finished */
/* -------- TWIS_IDR : (TWIS Offset: 0x20) Interrupt Disable Register -------- */
#define TWIS_IDR_RXRDY              (0x1u <<  0) /**< \brief (TWIS_IDR) RX Buffer Ready */
#define TWIS_IDR_TXRDY              (0x1u <<  1) /**< \brief (TWIS_IDR) TX Buffer Ready */
#define TWIS_IDR_TCOMP              (0x1u <<  3) /**< \brief (TWIS_IDR) Transmission Complete */
#define TWIS_IDR_URUN               (0x1u <<  6) /**< \brief (TWIS_IDR) Underrun */
#define TWIS_IDR_ORUN               (0x1u <<  7) /**< \brief (TWIS_IDR) Overrun */
#define TWIS_IDR_NAK                (0x1u <<  8) /**< \brief (TWIS_IDR) NAK Received */
#define TWIS_IDR_SMBTOUT            (0x1u << 12) /**< \brief (TWIS_IDR) SMBus Timeout */
#define TWIS_IDR_SMBPECERR          (0x1u << 13) /**< \brief (TWIS_IDR) SMBus PEC Error */
#define TWIS_IDR_BUSERR             (0x1u << 14) /**< \brief (TWIS_IDR) Bus Error */
#define TWIS_IDR_SAM                (0x1u << 16) /**< \brief (TWIS_IDR) Slave Address Match */
#define TWIS_IDR_GCM                (0x1u << 17) /**< \brief (TWIS_IDR) General Call Match */
#define TWIS_IDR_SMBALERTM          (0x1u << 18) /**< \brief (TWIS_IDR) SMBus Alert Response Address Match */
#define TWIS_IDR_SMBHHM             (0x1u << 19) /**< \brief (TWIS_IDR) SMBus Host Header Address Match */
#define TWIS_IDR_SMBDAM             (0x1u << 20) /**< \brief (TWIS_IDR) SMBus Default Address Match */
#define TWIS_IDR_STO                (0x1u << 21) /**< \brief (TWIS_IDR) Stop Received */
#define TWIS_IDR_REP                (0x1u << 22) /**< \brief (TWIS_IDR) Repeated Start Received */
#define TWIS_IDR_BTF                (0x1u << 23) /**< \brief (TWIS_IDR) Byte Transfer Finished */
/* -------- TWIS_IMR : (TWIS Offset: 0x24) Interrupt Mask Register -------- */
#define TWIS_IMR_RXRDY              (0x1u <<  0) /**< \brief (TWIS_IMR) RX Buffer Ready */
#define TWIS_IMR_TXRDY              (0x1u <<  1) /**< \brief (TWIS_IMR) TX Buffer Ready */
#define TWIS_IMR_TCOMP              (0x1u <<  3) /**< \brief (TWIS_IMR) Transmission Complete */
#define TWIS_IMR_URUN               (0x1u <<  6) /**< \brief (TWIS_IMR) Underrun */
#define TWIS_IMR_ORUN               (0x1u <<  7) /**< \brief (TWIS_IMR) Overrun */
#define TWIS_IMR_NAK                (0x1u <<  8) /**< \brief (TWIS_IMR) NAK Received */
#define TWIS_IMR_SMBTOUT            (0x1u << 12) /**< \brief (TWIS_IMR) SMBus Timeout */
#define TWIS_IMR_SMBPECERR          (0x1u << 13) /**< \brief (TWIS_IMR) SMBus PEC Error */
#define TWIS_IMR_BUSERR             (0x1u << 14) /**< \brief (TWIS_IMR) Bus Error */
#define TWIS_IMR_SAM                (0x1u << 16) /**< \brief (TWIS_IMR) Slave Address Match */
#define TWIS_IMR_GCM                (0x1u << 17) /**< \brief (TWIS_IMR) General Call Match */
#define TWIS_IMR_SMBALERTM          (0x1u << 18) /**< \brief (TWIS_IMR) SMBus Alert Response Address Match */
#define TWIS_IMR_SMBHHM             (0x1u << 19) /**< \brief (TWIS_IMR) SMBus Host Header Address Match */
#define TWIS_IMR_SMBDAM             (0x1u << 20) /**< \brief (TWIS_IMR) SMBus Default Address Match */
#define TWIS_IMR_STO                (0x1u << 21) /**< \brief (TWIS_IMR) Stop Received */
#define TWIS_IMR_REP                (0x1u << 22) /**< \brief (TWIS_IMR) Repeated Start Received */
#define TWIS_IMR_BTF                (0x1u << 23) /**< \brief (TWIS_IMR) Byte Transfer Finished */
/* -------- TWIS_SCR : (TWIS Offset: 0x28) Status Clear Register -------- */
#define TWIS_SCR_TCOMP              (0x1u <<  3) /**< \brief (TWIS_SCR) Transmission Complete */
#define TWIS_SCR_URUN               (0x1u <<  6) /**< \brief (TWIS_SCR) Underrun */
#define TWIS_SCR_ORUN               (0x1u <<  7) /**< \brief (TWIS_SCR) Overrun */
#define TWIS_SCR_NAK                (0x1u <<  8) /**< \brief (TWIS_SCR) NAK Received */
#define TWIS_SCR_SMBTOUT            (0x1u << 12) /**< \brief (TWIS_SCR) SMBus Timeout */
#define TWIS_SCR_SMBPECERR          (0x1u << 13) /**< \brief (TWIS_SCR) SMBus PEC Error */
#define TWIS_SCR_BUSERR             (0x1u << 14) /**< \brief (TWIS_SCR) Bus Error */
#define TWIS_SCR_SAM                (0x1u << 16) /**< \brief (TWIS_SCR) Slave Address Match */
#define TWIS_SCR_GCM                (0x1u << 17) /**< \brief (TWIS_SCR) General Call Match */
#define TWIS_SCR_SMBALERTM          (0x1u << 18) /**< \brief (TWIS_SCR) SMBus Alert Response Address Match */
#define TWIS_SCR_SMBHHM             (0x1u << 19) /**< \brief (TWIS_SCR) SMBus Host Header Address Match */
#define TWIS_SCR_SMBDAM             (0x1u << 20) /**< \brief (TWIS_SCR) SMBus Default Address Match */
#define TWIS_SCR_STO                (0x1u << 21) /**< \brief (TWIS_SCR) Stop Received */
#define TWIS_SCR_REP                (0x1u << 22) /**< \brief (TWIS_SCR) Repeated Start Received */
#define TWIS_SCR_BTF                (0x1u << 23) /**< \brief (TWIS_SCR) Byte Transfer Finished */
/* -------- TWIS_PR : (TWIS Offset: 0x2C) Parameter Register -------- */
#define TWIS_PR_HS                  (0x1u <<  0) /**< \brief (TWIS_PR) HS-mode */
/* -------- TWIS_VR : (TWIS Offset: 0x30) Version Register -------- */
#define TWIS_VR_VERSION_Pos         0
#define TWIS_VR_VERSION_Msk         (0xFFFu << TWIS_VR_VERSION_Pos) /**< \brief (TWIS_VR) Version Number */
#define TWIS_VR_VERSION(value)      ((TWIS_VR_VERSION_Msk & ((value) << TWIS_VR_VERSION_Pos)))
#define TWIS_VR_VARIANT_Pos         16
#define TWIS_VR_VARIANT_Msk         (0xFu << TWIS_VR_VARIANT_Pos) /**< \brief (TWIS_VR) Variant Number */
#define TWIS_VR_VARIANT(value)      ((TWIS_VR_VARIANT_Msk & ((value) << TWIS_VR_VARIANT_Pos)))
/* -------- TWIS_HSTR : (TWIS Offset: 0x34) HS-mode Timing Register -------- */
#define TWIS_HSTR_HDDAT_Pos         16
#define TWIS_HSTR_HDDAT_Msk         (0xFFu << TWIS_HSTR_HDDAT_Pos) /**< \brief (TWIS_HSTR) Data Hold Cycles */
#define TWIS_HSTR_HDDAT(value)      ((TWIS_HSTR_HDDAT_Msk & ((value) << TWIS_HSTR_HDDAT_Pos)))
/* -------- TWIS_SRR : (TWIS Offset: 0x38) Slew Rate Register -------- */
#define TWIS_SRR_DADRIVEL_Pos       0
#define TWIS_SRR_DADRIVEL_Msk       (0x7u << TWIS_SRR_DADRIVEL_Pos) /**< \brief (TWIS_SRR) Data Drive Strength LOW */
#define TWIS_SRR_DADRIVEL(value)    ((TWIS_SRR_DADRIVEL_Msk & ((value) << TWIS_SRR_DADRIVEL_Pos)))
#define TWIS_SRR_DASLEW_Pos         8
#define TWIS_SRR_DASLEW_Msk         (0x3u << TWIS_SRR_DASLEW_Pos) /**< \brief (TWIS_SRR) Data Slew Limit */
#define TWIS_SRR_DASLEW(value)      ((TWIS_SRR_DASLEW_Msk & ((value) << TWIS_SRR_DASLEW_Pos)))
#define TWIS_SRR_FILTER_Pos         28
#define TWIS_SRR_FILTER_Msk         (0x3u << TWIS_SRR_FILTER_Pos) /**< \brief (TWIS_SRR) Input Spike Filter Control */
#define TWIS_SRR_FILTER(value)      ((TWIS_SRR_FILTER_Msk & ((value) << TWIS_SRR_FILTER_Pos)))
/* -------- TWIS_HSSRR : (TWIS Offset: 0x3C) HS-mode Slew Rate Register -------- */
#define TWIS_HSSRR_DADRIVEL_Pos     0
#define TWIS_HSSRR_DADRIVEL_Msk     (0x7u << TWIS_HSSRR_DADRIVEL_Pos) /**< \brief (TWIS_HSSRR) Data Drive Strength LOW */
#define TWIS_HSSRR_DADRIVEL(value)  ((TWIS_HSSRR_DADRIVEL_Msk & ((value) << TWIS_HSSRR_DADRIVEL_Pos)))
#define TWIS_HSSRR_DASLEW_Pos       8
#define TWIS_HSSRR_DASLEW_Msk       (0x3u << TWIS_HSSRR_DASLEW_Pos) /**< \brief (TWIS_HSSRR) Data Slew Limit */
#define TWIS_HSSRR_DASLEW(value)    ((TWIS_HSSRR_DASLEW_Msk & ((value) << TWIS_HSSRR_DASLEW_Pos)))
#define TWIS_HSSRR_FILTER_Pos       28
#define TWIS_HSSRR_FILTER_Msk       (0x3u << TWIS_HSSRR_FILTER_Pos) /**< \brief (TWIS_HSSRR) Input Spike Filter Control */
#define TWIS_HSSRR_FILTER(value)    ((TWIS_HSSRR_FILTER_Msk & ((value) << TWIS_HSSRR_FILTER_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USART */
/* ============================================================================= */
/** \addtogroup SAM4L4_USART Universal Synchronous Asynchronous Receiver Transmitter */
/*@{*/

#define REV_USART      0x6021

