Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#ifndef __ASSEMBLY__
/** \brief USART hardware registers */
typedef struct {
  WoReg   CR;          /**< \brief (USART Offset: 0x00) Control Register */
  RwReg   MR;          /**< \brief (USART Offset: 0x04) Mode Register */
  WoReg   IER;         /**< \brief (USART Offset: 0x08) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (USART Offset: 0x0C) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (USART Offset: 0x10) Interrupt Mask Register */
  RoReg   CSR;         /**< \brief (USART Offset: 0x14) Channel Status Register */
  RoReg   RHR;         /**< \brief (USART Offset: 0x18) Receiver Holding Register */
  WoReg   THR;         /**< \brief (USART Offset: 0x1C) Transmitter Holding Register */
  RwReg   BRGR;        /**< \brief (USART Offset: 0x20) Baud Rate Generator Register */
  RwReg   RTOR;        /**< \brief (USART Offset: 0x24) Receiver Time-out Register */
  RwReg   TTGR;        /**< \brief (USART Offset: 0x28) Transmitter Timeguard Register */
  RoReg   Reserved1[5];
  RwReg   FIDI;        /**< \brief (USART Offset: 0x40) FI DI Ratio Register */
  RoReg   NER;         /**< \brief (USART Offset: 0x44) Number of Errors Register */
  RoReg   Reserved2[1];
  RwReg   IFR;         /**< \brief (USART Offset: 0x4C) IrDA Filter Register */
  RwReg   MAN;         /**< \brief (USART Offset: 0x50) Manchester Configuration Register */
  RwReg   LINMR;       /**< \brief (USART Offset: 0x54) LIN Mode Register */
  RwReg   LINIR;       /**< \brief (USART Offset: 0x58) LIN Identifier Register */
  RoReg   LINBRR;      /**< \brief (USART Offset: 0x5C) LIN Baud Rate Register */
  RoReg   Reserved3[33];
  RwReg   WPMR;        /**< \brief (USART Offset: 0xE4) Write Protect Mode Register */
  RoReg   WPSR;        /**< \brief (USART Offset: 0xE8) Write Protect Status Register */
  RoReg   Reserved4[4];
  RoReg   VERSION;     /**< \brief (USART Offset: 0xFC) Version Register */
} Usart;
#endif /* __ASSEMBLY__ */
/* -------- US_LIN_CR : (USART Offset: 0x00) Control Register -------- */
#define US_LIN_CR_RSTRX             (0x1u <<  2) /**< \brief (US_LIN_CR) Reset Receiver */
#define   US_LIN_CR_RSTRX_0         (0x0u <<  2) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RSTRX_1         (0x1u <<  2) /**< \brief (US_LIN_CR) Resets the receiver */
#define US_LIN_CR_RSTTX             (0x1u <<  3) /**< \brief (US_LIN_CR) Reset Transmitter */
#define   US_LIN_CR_RSTTX_0         (0x0u <<  3) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RSTTX_1         (0x1u <<  3) /**< \brief (US_LIN_CR) Resets the transmitter */
#define US_LIN_CR_RXEN              (0x1u <<  4) /**< \brief (US_LIN_CR) Receiver Enable */
#define   US_LIN_CR_RXEN_0          (0x0u <<  4) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RXEN_1          (0x1u <<  4) /**< \brief (US_LIN_CR) Enables the receiver, if RXDIS is 0 */
#define US_LIN_CR_RXDIS             (0x1u <<  5) /**< \brief (US_LIN_CR) Receiver Disable */
#define   US_LIN_CR_RXDIS_0         (0x0u <<  5) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RXDIS_1         (0x1u <<  5) /**< \brief (US_LIN_CR) Disables the receiver */
#define US_LIN_CR_TXEN              (0x1u <<  6) /**< \brief (US_LIN_CR) Transmitter Enable */
#define   US_LIN_CR_TXEN_0          (0x0u <<  6) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_TXEN_1          (0x1u <<  6) /**< \brief (US_LIN_CR) Enables the transmitter if TXDIS is 0 */
#define US_LIN_CR_TXDIS             (0x1u <<  7) /**< \brief (US_LIN_CR) Transmitter Disable */
#define   US_LIN_CR_TXDIS_0         (0x0u <<  7) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_TXDIS_1         (0x1u <<  7) /**< \brief (US_LIN_CR) Disables the transmitter */
#define US_LIN_CR_RSTSTA            (0x1u <<  8) /**< \brief (US_LIN_CR) Reset Status Bits */
#define   US_LIN_CR_RSTSTA_0        (0x0u <<  8) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RSTSTA_1        (0x1u <<  8) /**< \brief (US_LIN_CR) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_LIN_CR_STTBRK            (0x1u <<  9) /**< \brief (US_LIN_CR) Start Break */
#define   US_LIN_CR_STTBRK_0        (0x0u <<  9) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_STTBRK_1        (0x1u <<  9) /**< \brief (US_LIN_CR) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_LIN_CR_STPBRK            (0x1u << 10) /**< \brief (US_LIN_CR) Stop Break */
#define   US_LIN_CR_STPBRK_0        (0x0u << 10) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_STPBRK_1        (0x1u << 10) /**< \brief (US_LIN_CR) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_LIN_CR_STTTO             (0x1u << 11) /**< \brief (US_LIN_CR) Start Time-out */
#define   US_LIN_CR_STTTO_0         (0x0u << 11) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_STTTO_1         (0x1u << 11) /**< \brief (US_LIN_CR) Starts waiting for a character before clocking the time-out counter */
#define US_LIN_CR_SENDA             (0x1u << 12) /**< \brief (US_LIN_CR) Send Address */
#define   US_LIN_CR_SENDA_0         (0x0u << 12) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_SENDA_1         (0x1u << 12) /**< \brief (US_LIN_CR) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_LIN_CR_RSTIT             (0x1u << 13) /**< \brief (US_LIN_CR) Reset Iterations */
#define   US_LIN_CR_RSTIT_0         (0x0u << 13) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RSTIT_1         (0x1u << 13) /**< \brief (US_LIN_CR) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_LIN_CR_RSTNACK           (0x1u << 14) /**< \brief (US_LIN_CR) Reset Non Acknowledge */
#define   US_LIN_CR_RSTNACK_0       (0x0u << 14) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RSTNACK_1       (0x1u << 14) /**< \brief (US_LIN_CR) Resets NACK in CSR */
#define US_LIN_CR_RETTO             (0x1u << 15) /**< \brief (US_LIN_CR) Rearm Time-out */
#define   US_LIN_CR_RETTO_0         (0x0u << 15) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RETTO_1         (0x1u << 15) /**< \brief (US_LIN_CR) Restart Time-out */
#define US_LIN_CR_DTREN             (0x1u << 16) /**< \brief (US_LIN_CR) Data Terminal Ready Enable */
#define   US_LIN_CR_DTREN_0         (0x0u << 16) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_DTREN_1         (0x1u << 16) /**< \brief (US_LIN_CR) Drives the pin DTR at 0 */
#define US_LIN_CR_DTRDIS            (0x1u << 17) /**< \brief (US_LIN_CR) Data Terminal Ready Disable */
#define   US_LIN_CR_DTRDIS_0        (0x0u << 17) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_DTRDIS_1        (0x1u << 17) /**< \brief (US_LIN_CR) Drives the pin DTR to 1 */
#define US_LIN_CR_RTSEN             (0x1u << 18) /**< \brief (US_LIN_CR) Request to Send Enable */
#define   US_LIN_CR_RTSEN_0         (0x0u << 18) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RTSEN_1         (0x1u << 18) /**< \brief (US_LIN_CR) Drives the pin RTS to 0 */
#define US_LIN_CR_RTSDIS            (0x1u << 19) /**< \brief (US_LIN_CR) Request to Send Disable */
#define   US_LIN_CR_RTSDIS_0        (0x0u << 19) /**< \brief (US_LIN_CR) No effect */
#define   US_LIN_CR_RTSDIS_1        (0x1u << 19) /**< \brief (US_LIN_CR) Drives the pin RTS to 1 */
#define US_LIN_CR_LINABT            (0x1u << 20) /**< \brief (US_LIN_CR) Abort the current LIN transmission */
#define US_LIN_CR_LINWKUP           (0x1u << 21) /**< \brief (US_LIN_CR) Sends a wakeup signal on the LIN bus */
/* -------- US_SPI_MASTER_CR : (USART Offset: 0x00) Control Register -------- */
#define US_SPI_MASTER_CR_RSTRX      (0x1u <<  2) /**< \brief (US_SPI_MASTER_CR) Reset Receiver */
#define   US_SPI_MASTER_CR_RSTRX_0  (0x0u <<  2) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RSTRX_1  (0x1u <<  2) /**< \brief (US_SPI_MASTER_CR) Resets the receiver */
#define US_SPI_MASTER_CR_RSTTX      (0x1u <<  3) /**< \brief (US_SPI_MASTER_CR) Reset Transmitter */
#define   US_SPI_MASTER_CR_RSTTX_0  (0x0u <<  3) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RSTTX_1  (0x1u <<  3) /**< \brief (US_SPI_MASTER_CR) Resets the transmitter */
#define US_SPI_MASTER_CR_RXEN       (0x1u <<  4) /**< \brief (US_SPI_MASTER_CR) Receiver Enable */
#define   US_SPI_MASTER_CR_RXEN_0   (0x0u <<  4) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RXEN_1   (0x1u <<  4) /**< \brief (US_SPI_MASTER_CR) Enables the receiver, if RXDIS is 0 */
#define US_SPI_MASTER_CR_RXDIS      (0x1u <<  5) /**< \brief (US_SPI_MASTER_CR) Receiver Disable */
#define   US_SPI_MASTER_CR_RXDIS_0  (0x0u <<  5) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RXDIS_1  (0x1u <<  5) /**< \brief (US_SPI_MASTER_CR) Disables the receiver */
#define US_SPI_MASTER_CR_TXEN       (0x1u <<  6) /**< \brief (US_SPI_MASTER_CR) Transmitter Enable */
#define   US_SPI_MASTER_CR_TXEN_0   (0x0u <<  6) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_TXEN_1   (0x1u <<  6) /**< \brief (US_SPI_MASTER_CR) Enables the transmitter if TXDIS is 0 */
#define US_SPI_MASTER_CR_TXDIS      (0x1u <<  7) /**< \brief (US_SPI_MASTER_CR) Transmitter Disable */
#define   US_SPI_MASTER_CR_TXDIS_0  (0x0u <<  7) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_TXDIS_1  (0x1u <<  7) /**< \brief (US_SPI_MASTER_CR) Disables the transmitter */
#define US_SPI_MASTER_CR_RSTSTA     (0x1u <<  8) /**< \brief (US_SPI_MASTER_CR) Reset Status Bits */
#define   US_SPI_MASTER_CR_RSTSTA_0 (0x0u <<  8) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RSTSTA_1 (0x1u <<  8) /**< \brief (US_SPI_MASTER_CR) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_SPI_MASTER_CR_STTBRK     (0x1u <<  9) /**< \brief (US_SPI_MASTER_CR) Start Break */
#define   US_SPI_MASTER_CR_STTBRK_0 (0x0u <<  9) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_STTBRK_1 (0x1u <<  9) /**< \brief (US_SPI_MASTER_CR) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_SPI_MASTER_CR_STPBRK     (0x1u << 10) /**< \brief (US_SPI_MASTER_CR) Stop Break */
#define   US_SPI_MASTER_CR_STPBRK_0 (0x0u << 10) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_STPBRK_1 (0x1u << 10) /**< \brief (US_SPI_MASTER_CR) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_SPI_MASTER_CR_STTTO      (0x1u << 11) /**< \brief (US_SPI_MASTER_CR) Start Time-out */
#define   US_SPI_MASTER_CR_STTTO_0  (0x0u << 11) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_STTTO_1  (0x1u << 11) /**< \brief (US_SPI_MASTER_CR) Starts waiting for a character before clocking the time-out counter */
#define US_SPI_MASTER_CR_SENDA      (0x1u << 12) /**< \brief (US_SPI_MASTER_CR) Send Address */
#define   US_SPI_MASTER_CR_SENDA_0  (0x0u << 12) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_SENDA_1  (0x1u << 12) /**< \brief (US_SPI_MASTER_CR) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_SPI_MASTER_CR_RSTIT      (0x1u << 13) /**< \brief (US_SPI_MASTER_CR) Reset Iterations */
#define   US_SPI_MASTER_CR_RSTIT_0  (0x0u << 13) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RSTIT_1  (0x1u << 13) /**< \brief (US_SPI_MASTER_CR) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_SPI_MASTER_CR_RSTNACK    (0x1u << 14) /**< \brief (US_SPI_MASTER_CR) Reset Non Acknowledge */
#define   US_SPI_MASTER_CR_RSTNACK_0 (0x0u << 14) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RSTNACK_1 (0x1u << 14) /**< \brief (US_SPI_MASTER_CR) Resets NACK in CSR */
#define US_SPI_MASTER_CR_RETTO      (0x1u << 15) /**< \brief (US_SPI_MASTER_CR) Rearm Time-out */
#define   US_SPI_MASTER_CR_RETTO_0  (0x0u << 15) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RETTO_1  (0x1u << 15) /**< \brief (US_SPI_MASTER_CR) Restart Time-out */
#define US_SPI_MASTER_CR_DTREN      (0x1u << 16) /**< \brief (US_SPI_MASTER_CR) Data Terminal Ready Enable */
#define   US_SPI_MASTER_CR_DTREN_0  (0x0u << 16) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_DTREN_1  (0x1u << 16) /**< \brief (US_SPI_MASTER_CR) Drives the pin DTR at 0 */
#define US_SPI_MASTER_CR_DTRDIS     (0x1u << 17) /**< \brief (US_SPI_MASTER_CR) Data Terminal Ready Disable */
#define   US_SPI_MASTER_CR_DTRDIS_0 (0x0u << 17) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_DTRDIS_1 (0x1u << 17) /**< \brief (US_SPI_MASTER_CR) Drives the pin DTR to 1 */
#define US_SPI_MASTER_CR_FCS        (0x1u << 18) /**< \brief (US_SPI_MASTER_CR) Force SPI Chip Select */
#define   US_SPI_MASTER_CR_FCS_0    (0x0u << 18) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_FCS_1    (0x1u << 18) /**< \brief (US_SPI_MASTER_CR) Forces the Slave Select Line NSS (RTS pin) to 0, even if USART is no transmitting, in order to address SPI slave devices supporting the CSAAT Mode (Chip Select Active After Transfer) */
#define US_SPI_MASTER_CR_RCS        (0x1u << 19) /**< \brief (US_SPI_MASTER_CR) Release SPI Chip Select */
#define   US_SPI_MASTER_CR_RCS_0    (0x0u << 19) /**< \brief (US_SPI_MASTER_CR) No effect */
#define   US_SPI_MASTER_CR_RCS_1    (0x1u << 19) /**< \brief (US_SPI_MASTER_CR) Releases the Slave Select Line NSS (RTS pin) */
/* -------- US_USART_CR : (USART Offset: 0x00) Control Register -------- */
#define US_USART_CR_RSTRX           (0x1u <<  2) /**< \brief (US_USART_CR) Reset Receiver */
#define   US_USART_CR_RSTRX_0       (0x0u <<  2) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RSTRX_1       (0x1u <<  2) /**< \brief (US_USART_CR) Resets the receiver */
#define US_USART_CR_RSTTX           (0x1u <<  3) /**< \brief (US_USART_CR) Reset Transmitter */
#define   US_USART_CR_RSTTX_0       (0x0u <<  3) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RSTTX_1       (0x1u <<  3) /**< \brief (US_USART_CR) Resets the transmitter */
#define US_USART_CR_RXEN            (0x1u <<  4) /**< \brief (US_USART_CR) Receiver Enable */
#define   US_USART_CR_RXEN_0        (0x0u <<  4) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RXEN_1        (0x1u <<  4) /**< \brief (US_USART_CR) Enables the receiver, if RXDIS is 0 */
#define US_USART_CR_RXDIS           (0x1u <<  5) /**< \brief (US_USART_CR) Receiver Disable */
#define   US_USART_CR_RXDIS_0       (0x0u <<  5) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RXDIS_1       (0x1u <<  5) /**< \brief (US_USART_CR) Disables the receiver */
#define US_USART_CR_TXEN            (0x1u <<  6) /**< \brief (US_USART_CR) Transmitter Enable */
#define   US_USART_CR_TXEN_0        (0x0u <<  6) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_TXEN_1        (0x1u <<  6) /**< \brief (US_USART_CR) Enables the transmitter if TXDIS is 0 */
#define US_USART_CR_TXDIS           (0x1u <<  7) /**< \brief (US_USART_CR) Transmitter Disable */
#define   US_USART_CR_TXDIS_0       (0x0u <<  7) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_TXDIS_1       (0x1u <<  7) /**< \brief (US_USART_CR) Disables the transmitter */
#define US_USART_CR_RSTSTA          (0x1u <<  8) /**< \brief (US_USART_CR) Reset Status Bits */
#define   US_USART_CR_RSTSTA_0      (0x0u <<  8) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RSTSTA_1      (0x1u <<  8) /**< \brief (US_USART_CR) Resets the status bits PARE, FRAME, OVRE and RXBRK in the CSR */
#define US_USART_CR_STTBRK          (0x1u <<  9) /**< \brief (US_USART_CR) Start Break */
#define   US_USART_CR_STTBRK_0      (0x0u <<  9) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_STTBRK_1      (0x1u <<  9) /**< \brief (US_USART_CR) Starts transmission of a break after the characters present in THR and the Transmit Shift Register have been transmitted. No effect if a break is already being transmitted */
#define US_USART_CR_STPBRK          (0x1u << 10) /**< \brief (US_USART_CR) Stop Break */
#define   US_USART_CR_STPBRK_0      (0x0u << 10) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_STPBRK_1      (0x1u << 10) /**< \brief (US_USART_CR) Stops transmission of the break after a minimum of one character length and transmits a high level during 12-bit periods.No effect if no break is being transmitted */
#define US_USART_CR_STTTO           (0x1u << 11) /**< \brief (US_USART_CR) Start Time-out */
#define   US_USART_CR_STTTO_0       (0x0u << 11) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_STTTO_1       (0x1u << 11) /**< \brief (US_USART_CR) Starts waiting for a character before clocking the time-out counter */
#define US_USART_CR_SENDA           (0x1u << 12) /**< \brief (US_USART_CR) Send Address */
#define   US_USART_CR_SENDA_0       (0x0u << 12) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_SENDA_1       (0x1u << 12) /**< \brief (US_USART_CR) In Multi-drop Mode only, the next character written to the THR is sent with the address bit set */
#define US_USART_CR_RSTIT           (0x1u << 13) /**< \brief (US_USART_CR) Reset Iterations */
#define   US_USART_CR_RSTIT_0       (0x0u << 13) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RSTIT_1       (0x1u << 13) /**< \brief (US_USART_CR) Resets ITERATION in CSR. No effect if the ISO7816 is not enabled */
#define US_USART_CR_RSTNACK         (0x1u << 14) /**< \brief (US_USART_CR) Reset Non Acknowledge */
#define   US_USART_CR_RSTNACK_0     (0x0u << 14) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RSTNACK_1     (0x1u << 14) /**< \brief (US_USART_CR) Resets NACK in CSR */
#define US_USART_CR_RETTO           (0x1u << 15) /**< \brief (US_USART_CR) Rearm Time-out */
#define   US_USART_CR_RETTO_0       (0x0u << 15) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RETTO_1       (0x1u << 15) /**< \brief (US_USART_CR) Restart Time-out */
#define US_USART_CR_DTREN           (0x1u << 16) /**< \brief (US_USART_CR) Data Terminal Ready Enable */
#define   US_USART_CR_DTREN_0       (0x0u << 16) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_DTREN_1       (0x1u << 16) /**< \brief (US_USART_CR) Drives the pin DTR at 0 */
#define US_USART_CR_DTRDIS          (0x1u << 17) /**< \brief (US_USART_CR) Data Terminal Ready Disable */
#define   US_USART_CR_DTRDIS_0      (0x0u << 17) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_DTRDIS_1      (0x1u << 17) /**< \brief (US_USART_CR) Drives the pin DTR to 1 */
#define US_USART_CR_RTSEN           (0x1u << 18) /**< \brief (US_USART_CR) Request to Send Enable */
#define   US_USART_CR_RTSEN_0       (0x0u << 18) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RTSEN_1       (0x1u << 18) /**< \brief (US_USART_CR) Drives the pin RTS to 0 */
#define US_USART_CR_RTSDIS          (0x1u << 19) /**< \brief (US_USART_CR) Request to Send Disable */
#define   US_USART_CR_RTSDIS_0      (0x0u << 19) /**< \brief (US_USART_CR) No effect */
#define   US_USART_CR_RTSDIS_1      (0x1u << 19) /**< \brief (US_USART_CR) Drives the pin RTS to 1 */
/* -------- US_SPI_MR : (USART Offset: 0x04) Mode Register -------- */
#define US_SPI_MR_MODE_Pos          0
#define US_SPI_MR_MODE_Msk          (0xFu << US_SPI_MR_MODE_Pos) /**< \brief (US_SPI_MR) Usart Mode */
#define US_SPI_MR_MODE(value)       ((US_SPI_MR_MODE_Msk & ((value) << US_SPI_MR_MODE_Pos)))
#define   US_SPI_MR_MODE_NORMAL     (0x0u <<  0) /**< \brief (US_SPI_MR) Normal */
#define   US_SPI_MR_MODE_RS485      (0x1u <<  0) /**< \brief (US_SPI_MR) RS485 */
#define   US_SPI_MR_MODE_HARDWARE   (0x2u <<  0) /**< \brief (US_SPI_MR) Hardware Handshaking */
#define   US_SPI_MR_MODE_MODEM      (0x3u <<  0) /**< \brief (US_SPI_MR) Modem */
#define   US_SPI_MR_MODE_ISO7816_T0 (0x4u <<  0) /**< \brief (US_SPI_MR) IS07816 Protocol: T = 0 */
#define   US_SPI_MR_MODE_ISO7816_T1 (0x6u <<  0) /**< \brief (US_SPI_MR) IS07816 Protocol: T = 1 */
#define   US_SPI_MR_MODE_IRDA       (0x8u <<  0) /**< \brief (US_SPI_MR) IrDA */
#define   US_SPI_MR_MODE_LIN_MASTER (0xAu <<  0) /**< \brief (US_SPI_MR) LIN Master */
#define   US_SPI_MR_MODE_LIN_SLAVE  (0xBu <<  0) /**< \brief (US_SPI_MR) LIN Slave */
#define   US_SPI_MR_MODE_SPI_MASTER (0xEu <<  0) /**< \brief (US_SPI_MR) SPI Master */
#define   US_SPI_MR_MODE_SPI_SLAVE  (0xFu <<  0) /**< \brief (US_SPI_MR) SPI Slave */
#define US_SPI_MR_USCLKS_Pos        4
#define US_SPI_MR_USCLKS_Msk        (0x3u << US_SPI_MR_USCLKS_Pos) /**< \brief (US_SPI_MR) Clock Selection */
#define US_SPI_MR_USCLKS(value)     ((US_SPI_MR_USCLKS_Msk & ((value) << US_SPI_MR_USCLKS_Pos)))
#define   US_SPI_MR_USCLKS_MCK      (0x0u <<  4) /**< \brief (US_SPI_MR) MCK */
#define   US_SPI_MR_USCLKS_MCK_DIV  (0x1u <<  4) /**< \brief (US_SPI_MR) MCK / DIV */
#define   US_SPI_MR_USCLKS_2        (0x2u <<  4) /**< \brief (US_SPI_MR) Reserved */
#define   US_SPI_MR_USCLKS_SCK      (0x3u <<  4) /**< \brief (US_SPI_MR) SCK */
#define US_SPI_MR_CHRL_Pos          6
#define US_SPI_MR_CHRL_Msk          (0x3u << US_SPI_MR_CHRL_Pos) /**< \brief (US_SPI_MR) Character Length. */
#define US_SPI_MR_CHRL(value)       ((US_SPI_MR_CHRL_Msk & ((value) << US_SPI_MR_CHRL_Pos)))
#define   US_SPI_MR_CHRL_5          (0x0u <<  6) /**< \brief (US_SPI_MR) 5 bits */
#define   US_SPI_MR_CHRL_6          (0x1u <<  6) /**< \brief (US_SPI_MR) 6 bits */
#define   US_SPI_MR_CHRL_7          (0x2u <<  6) /**< \brief (US_SPI_MR) 7 bits */
#define   US_SPI_MR_CHRL_8          (0x3u <<  6) /**< \brief (US_SPI_MR) 8 bits */
#define US_SPI_MR_CPHA              (0x1u <<  8) /**< \brief (US_SPI_MR) SPI CLock Phase */
#define   US_SPI_MR_CPHA_0          (0x0u <<  8) /**< \brief (US_SPI_MR) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK */
#define   US_SPI_MR_CPHA_1          (0x1u <<  8) /**< \brief (US_SPI_MR) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK */
#define US_SPI_MR_PAR_Pos           9
#define US_SPI_MR_PAR_Msk           (0x7u << US_SPI_MR_PAR_Pos) /**< \brief (US_SPI_MR) Parity Type */
#define US_SPI_MR_PAR(value)        ((US_SPI_MR_PAR_Msk & ((value) << US_SPI_MR_PAR_Pos)))
#define   US_SPI_MR_PAR_EVEN        (0x0u <<  9) /**< \brief (US_SPI_MR) Even parity */
#define   US_SPI_MR_PAR_ODD         (0x1u <<  9) /**< \brief (US_SPI_MR) Odd parity */
#define   US_SPI_MR_PAR_SPACE       (0x2u <<  9) /**< \brief (US_SPI_MR) Parity forced to 0 (Space) */
#define   US_SPI_MR_PAR_MARK        (0x3u <<  9) /**< \brief (US_SPI_MR) Parity forced to 1 (Mark) */
#define   US_SPI_MR_PAR_NONE        (0x4u <<  9) /**< \brief (US_SPI_MR) No Parity */
#define   US_SPI_MR_PAR_5           (0x5u <<  9) /**< \brief (US_SPI_MR) No Parity */
#define   US_SPI_MR_PAR_MULTI       (0x6u <<  9) /**< \brief (US_SPI_MR) Multi-drop mode */
#define   US_SPI_MR_PAR_7           (0x7u <<  9) /**< \brief (US_SPI_MR) Multi-drop mode */
#define US_SPI_MR_NBSTOP_Pos        12
#define US_SPI_MR_NBSTOP_Msk        (0x3u << US_SPI_MR_NBSTOP_Pos) /**< \brief (US_SPI_MR) Number of Stop Bits */
