Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define US_SPI_MR_NBSTOP(value)     ((US_SPI_MR_NBSTOP_Msk & ((value) << US_SPI_MR_NBSTOP_Pos)))
#define   US_SPI_MR_NBSTOP_1        (0x0u << 12) /**< \brief (US_SPI_MR) 1 stop bit */
#define   US_SPI_MR_NBSTOP_1_5      (0x1u << 12) /**< \brief (US_SPI_MR) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_SPI_MR_NBSTOP_2        (0x2u << 12) /**< \brief (US_SPI_MR) 2 stop bits */
#define   US_SPI_MR_NBSTOP_3        (0x3u << 12) /**< \brief (US_SPI_MR) Reserved */
#define US_SPI_MR_CHMODE_Pos        14
#define US_SPI_MR_CHMODE_Msk        (0x3u << US_SPI_MR_CHMODE_Pos) /**< \brief (US_SPI_MR) Channel Mode */
#define US_SPI_MR_CHMODE(value)     ((US_SPI_MR_CHMODE_Msk & ((value) << US_SPI_MR_CHMODE_Pos)))
#define   US_SPI_MR_CHMODE_NORMAL   (0x0u << 14) /**< \brief (US_SPI_MR) Normal Mode */
#define   US_SPI_MR_CHMODE_ECHO     (0x1u << 14) /**< \brief (US_SPI_MR) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_SPI_MR_CHMODE_LOCAL_LOOP (0x2u << 14) /**< \brief (US_SPI_MR) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_SPI_MR_CHMODE_REMOTE_LOOP (0x3u << 14) /**< \brief (US_SPI_MR) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_SPI_MR_CPOL              (0x1u << 16) /**< \brief (US_SPI_MR) SPI Clock Polarity */
#define   US_SPI_MR_CPOL_ZERO       (0x0u << 16) /**< \brief (US_SPI_MR) The inactive state value of SPCK is logic level zero */
#define   US_SPI_MR_CPOL_ONE        (0x1u << 16) /**< \brief (US_SPI_MR) The inactive state value of SPCK is logic level one */
#define US_SPI_MR_MODE9             (0x1u << 17) /**< \brief (US_SPI_MR) 9-bit Character Length */
#define   US_SPI_MR_MODE9_0         (0x0u << 17) /**< \brief (US_SPI_MR) CHRL defines character length */
#define   US_SPI_MR_MODE9_1         (0x1u << 17) /**< \brief (US_SPI_MR) 9-bit character length */
#define US_SPI_MR_CLKO              (0x1u << 18) /**< \brief (US_SPI_MR) Clock Output Select */
#define   US_SPI_MR_CLKO_0          (0x0u << 18) /**< \brief (US_SPI_MR) The USART does not drive the SCK pin */
#define   US_SPI_MR_CLKO_1          (0x1u << 18) /**< \brief (US_SPI_MR) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_SPI_MR_OVER              (0x1u << 19) /**< \brief (US_SPI_MR) Oversampling Mode */
#define   US_SPI_MR_OVER_X16        (0x0u << 19) /**< \brief (US_SPI_MR) 16x Oversampling */
#define   US_SPI_MR_OVER_X8         (0x1u << 19) /**< \brief (US_SPI_MR) 8x Oversampling */
#define US_SPI_MR_INACK             (0x1u << 20) /**< \brief (US_SPI_MR) Inhibit Non Acknowledge */
#define   US_SPI_MR_INACK_0         (0x0u << 20) /**< \brief (US_SPI_MR) The NACK is generated */
#define   US_SPI_MR_INACK_1         (0x1u << 20) /**< \brief (US_SPI_MR) The NACK is not generated */
#define US_SPI_MR_DSNACK            (0x1u << 21) /**< \brief (US_SPI_MR) Disable Successive NACK */
#define   US_SPI_MR_DSNACK_0        (0x0u << 21) /**< \brief (US_SPI_MR) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_SPI_MR_DSNACK_1        (0x1u << 21) /**< \brief (US_SPI_MR) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_SPI_MR_INVDATA           (0x1u << 23) /**< \brief (US_SPI_MR) Inverted data */
#define US_SPI_MR_MAX_ITERATION_Pos    24
#define US_SPI_MR_MAX_ITERATION_Msk    (0x7u << US_SPI_MR_MAX_ITERATION_Pos) /**< \brief (US_SPI_MR) Max interation */
#define US_SPI_MR_MAX_ITERATION(value) ((US_SPI_MR_MAX_ITERATION_Msk & ((value) << US_SPI_MR_MAX_ITERATION_Pos)))
#define US_SPI_MR_FILTER            (0x1u << 28) /**< \brief (US_SPI_MR) Infrared Receive Line Filter */
#define   US_SPI_MR_FILTER_0        (0x0u << 28) /**< \brief (US_SPI_MR) The USART does not filter the receive line */
#define   US_SPI_MR_FILTER_1        (0x1u << 28) /**< \brief (US_SPI_MR) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
/* -------- US_USART_MR : (USART Offset: 0x04) Mode Register -------- */
#define US_USART_MR_MODE_Pos        0
#define US_USART_MR_MODE_Msk        (0xFu << US_USART_MR_MODE_Pos) /**< \brief (US_USART_MR) Usart Mode */
#define US_USART_MR_MODE(value)     ((US_USART_MR_MODE_Msk & ((value) << US_USART_MR_MODE_Pos)))
#define   US_USART_MR_MODE_NORMAL   (0x0u <<  0) /**< \brief (US_USART_MR) Normal */
#define   US_USART_MR_MODE_RS485    (0x1u <<  0) /**< \brief (US_USART_MR) RS485 */
#define   US_USART_MR_MODE_HARDWARE (0x2u <<  0) /**< \brief (US_USART_MR) Hardware Handshaking */
#define   US_USART_MR_MODE_MODEM    (0x3u <<  0) /**< \brief (US_USART_MR) Modem */
#define   US_USART_MR_MODE_ISO7816_T0 (0x4u <<  0) /**< \brief (US_USART_MR) IS07816 Protocol: T = 0 */
#define   US_USART_MR_MODE_ISO7816_T1 (0x6u <<  0) /**< \brief (US_USART_MR) IS07816 Protocol: T = 1 */
#define   US_USART_MR_MODE_IRDA     (0x8u <<  0) /**< \brief (US_USART_MR) IrDA */
#define   US_USART_MR_MODE_LIN_MASTER (0xAu <<  0) /**< \brief (US_USART_MR) LIN Master */
#define   US_USART_MR_MODE_LIN_SLAVE (0xBu <<  0) /**< \brief (US_USART_MR) LIN Slave */
#define   US_USART_MR_MODE_SPI_MASTER (0xEu <<  0) /**< \brief (US_USART_MR) SPI Master */
#define   US_USART_MR_MODE_SPI_SLAVE (0xFu <<  0) /**< \brief (US_USART_MR) SPI Slave */
#define US_USART_MR_USCLKS_Pos      4
#define US_USART_MR_USCLKS_Msk      (0x3u << US_USART_MR_USCLKS_Pos) /**< \brief (US_USART_MR) Clock Selection */
#define US_USART_MR_USCLKS(value)   ((US_USART_MR_USCLKS_Msk & ((value) << US_USART_MR_USCLKS_Pos)))
#define   US_USART_MR_USCLKS_MCK    (0x0u <<  4) /**< \brief (US_USART_MR) MCK */
#define   US_USART_MR_USCLKS_MCK_DIV (0x1u <<  4) /**< \brief (US_USART_MR) MCK / DIV */
#define   US_USART_MR_USCLKS_2      (0x2u <<  4) /**< \brief (US_USART_MR) Reserved */
#define   US_USART_MR_USCLKS_SCK    (0x3u <<  4) /**< \brief (US_USART_MR) SCK */
#define US_USART_MR_CHRL_Pos        6
#define US_USART_MR_CHRL_Msk        (0x3u << US_USART_MR_CHRL_Pos) /**< \brief (US_USART_MR) Character Length. */
#define US_USART_MR_CHRL(value)     ((US_USART_MR_CHRL_Msk & ((value) << US_USART_MR_CHRL_Pos)))
#define   US_USART_MR_CHRL_5        (0x0u <<  6) /**< \brief (US_USART_MR) 5 bits */
#define   US_USART_MR_CHRL_6        (0x1u <<  6) /**< \brief (US_USART_MR) 6 bits */
#define   US_USART_MR_CHRL_7        (0x2u <<  6) /**< \brief (US_USART_MR) 7 bits */
#define   US_USART_MR_CHRL_8        (0x3u <<  6) /**< \brief (US_USART_MR) 8 bits */
#define US_USART_MR_SYNC            (0x1u <<  8) /**< \brief (US_USART_MR) Synchronous Mode Select */
#define   US_USART_MR_SYNC_0        (0x0u <<  8) /**< \brief (US_USART_MR) USART operates in Synchronous Mode */
#define   US_USART_MR_SYNC_1        (0x1u <<  8) /**< \brief (US_USART_MR) USART operates in Asynchronous Mode */
#define US_USART_MR_PAR_Pos         9
#define US_USART_MR_PAR_Msk         (0x7u << US_USART_MR_PAR_Pos) /**< \brief (US_USART_MR) Parity Type */
#define US_USART_MR_PAR(value)      ((US_USART_MR_PAR_Msk & ((value) << US_USART_MR_PAR_Pos)))
#define   US_USART_MR_PAR_EVEN      (0x0u <<  9) /**< \brief (US_USART_MR) Even parity */
#define   US_USART_MR_PAR_ODD       (0x1u <<  9) /**< \brief (US_USART_MR) Odd parity */
#define   US_USART_MR_PAR_SPACE     (0x2u <<  9) /**< \brief (US_USART_MR) Parity forced to 0 (Space) */
#define   US_USART_MR_PAR_MARK      (0x3u <<  9) /**< \brief (US_USART_MR) Parity forced to 1 (Mark) */
#define   US_USART_MR_PAR_NONE      (0x4u <<  9) /**< \brief (US_USART_MR) No Parity */
#define   US_USART_MR_PAR_5         (0x5u <<  9) /**< \brief (US_USART_MR) No Parity */
#define   US_USART_MR_PAR_MULTI     (0x6u <<  9) /**< \brief (US_USART_MR) Multi-drop mode */
#define   US_USART_MR_PAR_7         (0x7u <<  9) /**< \brief (US_USART_MR) Multi-drop mode */
#define US_USART_MR_NBSTOP_Pos      12
#define US_USART_MR_NBSTOP_Msk      (0x3u << US_USART_MR_NBSTOP_Pos) /**< \brief (US_USART_MR) Number of Stop Bits */
#define US_USART_MR_NBSTOP(value)   ((US_USART_MR_NBSTOP_Msk & ((value) << US_USART_MR_NBSTOP_Pos)))
#define   US_USART_MR_NBSTOP_1      (0x0u << 12) /**< \brief (US_USART_MR) 1 stop bit */
#define   US_USART_MR_NBSTOP_1_5    (0x1u << 12) /**< \brief (US_USART_MR) 1.5 stop bits (Only valid if SYNC=0) */
#define   US_USART_MR_NBSTOP_2      (0x2u << 12) /**< \brief (US_USART_MR) 2 stop bits */
#define   US_USART_MR_NBSTOP_3      (0x3u << 12) /**< \brief (US_USART_MR) Reserved */
#define US_USART_MR_CHMODE_Pos      14
#define US_USART_MR_CHMODE_Msk      (0x3u << US_USART_MR_CHMODE_Pos) /**< \brief (US_USART_MR) Channel Mode */
#define US_USART_MR_CHMODE(value)   ((US_USART_MR_CHMODE_Msk & ((value) << US_USART_MR_CHMODE_Pos)))
#define   US_USART_MR_CHMODE_NORMAL (0x0u << 14) /**< \brief (US_USART_MR) Normal Mode */
#define   US_USART_MR_CHMODE_ECHO   (0x1u << 14) /**< \brief (US_USART_MR) Automatic Echo. Receiver input is connected to the TXD pin */
#define   US_USART_MR_CHMODE_LOCAL_LOOP (0x2u << 14) /**< \brief (US_USART_MR) Local Loopback. Transmitter output is connected to the Receiver Input */
#define   US_USART_MR_CHMODE_REMOTE_LOOP (0x3u << 14) /**< \brief (US_USART_MR) Remote Loopback. RXD pin is internally connected to the TXD pin */
#define US_USART_MR_MSBF            (0x1u << 16) /**< \brief (US_USART_MR) Bit Order */
#define   US_USART_MR_MSBF_LSBF     (0x0u << 16) /**< \brief (US_USART_MR) Least Significant Bit first */
#define   US_USART_MR_MSBF_MSBF     (0x1u << 16) /**< \brief (US_USART_MR) Most Significant Bit first */
#define US_USART_MR_MODE9           (0x1u << 17) /**< \brief (US_USART_MR) 9-bit Character Length */
#define   US_USART_MR_MODE9_0       (0x0u << 17) /**< \brief (US_USART_MR) CHRL defines character length */
#define   US_USART_MR_MODE9_1       (0x1u << 17) /**< \brief (US_USART_MR) 9-bit character length */
#define US_USART_MR_CLKO            (0x1u << 18) /**< \brief (US_USART_MR) Clock Output Select */
#define   US_USART_MR_CLKO_0        (0x0u << 18) /**< \brief (US_USART_MR) The USART does not drive the SCK pin */
#define   US_USART_MR_CLKO_1        (0x1u << 18) /**< \brief (US_USART_MR) The USART drives the SCK pin if USCLKS does not select the external clock SCK */
#define US_USART_MR_OVER            (0x1u << 19) /**< \brief (US_USART_MR) Oversampling Mode */
#define   US_USART_MR_OVER_X16      (0x0u << 19) /**< \brief (US_USART_MR) 16x Oversampling */
#define   US_USART_MR_OVER_X8       (0x1u << 19) /**< \brief (US_USART_MR) 8x Oversampling */
#define US_USART_MR_INACK           (0x1u << 20) /**< \brief (US_USART_MR) Inhibit Non Acknowledge */
#define   US_USART_MR_INACK_0       (0x0u << 20) /**< \brief (US_USART_MR) The NACK is generated */
#define   US_USART_MR_INACK_1       (0x1u << 20) /**< \brief (US_USART_MR) The NACK is not generated */
#define US_USART_MR_DSNACK          (0x1u << 21) /**< \brief (US_USART_MR) Disable Successive NACK */
#define   US_USART_MR_DSNACK_0      (0x0u << 21) /**< \brief (US_USART_MR) NACK is sent on the ISO line as soon as a parity error occurs in the received character (unless INACK is set) */
#define   US_USART_MR_DSNACK_1      (0x1u << 21) /**< \brief (US_USART_MR) Successive parity errors are counted up to the value specified in the MAX_ITERATION field. These parity errors generatea NACK on the ISO line. As soon as this value is reached, no additional NACK is sent on the ISO line. The flag ITERATION is asserted */
#define US_USART_MR_VAR_SYNC        (0x1u << 22) /**< \brief (US_USART_MR) Variable synchronization of command/data sync Start Frame Delimiter */
#define   US_USART_MR_VAR_SYNC_0    (0x0u << 22) /**< \brief (US_USART_MR) User defined configuration of command or data sync field depending on SYNC value */
#define   US_USART_MR_VAR_SYNC_1    (0x1u << 22) /**< \brief (US_USART_MR) The sync field is updated when a character is written into THR register */
#define US_USART_MR_INVDATA         (0x1u << 23) /**< \brief (US_USART_MR) Inverted data */
#define US_USART_MR_MAX_ITERATION_Pos    24
#define US_USART_MR_MAX_ITERATION_Msk    (0x7u << US_USART_MR_MAX_ITERATION_Pos) /**< \brief (US_USART_MR) Max interation */
#define US_USART_MR_MAX_ITERATION(value) ((US_USART_MR_MAX_ITERATION_Msk & ((value) << US_USART_MR_MAX_ITERATION_Pos)))
#define US_USART_MR_FILTER          (0x1u << 28) /**< \brief (US_USART_MR) Infrared Receive Line Filter */
#define   US_USART_MR_FILTER_0      (0x0u << 28) /**< \brief (US_USART_MR) The USART does not filter the receive line */
#define   US_USART_MR_FILTER_1      (0x1u << 28) /**< \brief (US_USART_MR) The USART filters the receive line using a three-sample filter (1/16-bit clock) (2 over 3 majority) */
#define US_USART_MR_MAN             (0x1u << 29) /**< \brief (US_USART_MR) Manchester Encoder/Decoder Enable */
#define   US_USART_MR_MAN_0         (0x0u << 29) /**< \brief (US_USART_MR) Manchester Encoder/Decoder is disabled */
#define   US_USART_MR_MAN_1         (0x1u << 29) /**< \brief (US_USART_MR) Manchester Encoder/Decoder is enabled */
#define US_USART_MR_MODSYNC         (0x1u << 30) /**< \brief (US_USART_MR) Manchester Synchronization Mode */
#define   US_USART_MR_MODSYNC_0     (0x0u << 30) /**< \brief (US_USART_MR) The Manchester Start bit is a 0 to 1 transition */
#define   US_USART_MR_MODSYNC_1     (0x1u << 30) /**< \brief (US_USART_MR) The Manchester Start bit is a 1 to 0 transition */
#define US_USART_MR_ONEBIT          (0x1u << 31) /**< \brief (US_USART_MR) Start Frame Delimiter selector */
#define   US_USART_MR_ONEBIT_0      (0x0u << 31) /**< \brief (US_USART_MR) Start Frame delimiter is COMMAND or DATA SYNC */
#define   US_USART_MR_ONEBIT_1      (0x1u << 31) /**< \brief (US_USART_MR) Start Frame delimiter is One Bit */
/* -------- US_LIN_IER : (USART Offset: 0x08) Interrupt Enable Register -------- */
#define US_LIN_IER_RXRDY            (0x1u <<  0) /**< \brief (US_LIN_IER) Receiver Ready Interrupt Enable */
#define   US_LIN_IER_RXRDY_0        (0x0u <<  0) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_RXRDY_1        (0x1u <<  0) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_TXRDY            (0x1u <<  1) /**< \brief (US_LIN_IER) Transmitter Ready Interrupt Enable */
#define   US_LIN_IER_TXRDY_0        (0x0u <<  1) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_TXRDY_1        (0x1u <<  1) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_RXBRK            (0x1u <<  2) /**< \brief (US_LIN_IER) Receiver Break Interrupt Enable */
#define   US_LIN_IER_RXBRK_0        (0x0u <<  2) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_RXBRK_1        (0x1u <<  2) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_ENDRX            (0x1u <<  3) /**< \brief (US_LIN_IER) End of Receive Transfer Interrupt Enable */
#define   US_LIN_IER_ENDRX_0        (0x0u <<  3) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_ENDRX_1        (0x1u <<  3) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_ENDTX            (0x1u <<  4) /**< \brief (US_LIN_IER) End of Transmit Interrupt Enable */
#define   US_LIN_IER_ENDTX_0        (0x0u <<  4) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_ENDTX_1        (0x1u <<  4) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_OVRE             (0x1u <<  5) /**< \brief (US_LIN_IER) Overrun Error Interrupt Enable */
#define   US_LIN_IER_OVRE_0         (0x0u <<  5) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_OVRE_1         (0x1u <<  5) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_FRAME            (0x1u <<  6) /**< \brief (US_LIN_IER) Framing Error Interrupt Enable */
#define   US_LIN_IER_FRAME_0        (0x0u <<  6) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_FRAME_1        (0x1u <<  6) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_PARE             (0x1u <<  7) /**< \brief (US_LIN_IER) Parity Error Interrupt Enable */
#define   US_LIN_IER_PARE_0         (0x0u <<  7) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_PARE_1         (0x1u <<  7) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_TIMEOUT          (0x1u <<  8) /**< \brief (US_LIN_IER) Time-out Interrupt Enable */
#define   US_LIN_IER_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_TXEMPTY          (0x1u <<  9) /**< \brief (US_LIN_IER) Transmitter Empty Interrupt Enable */
#define   US_LIN_IER_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_ITER             (0x1u << 10) /**< \brief (US_LIN_IER) Iteration Interrupt Enable */
#define   US_LIN_IER_ITER_0         (0x0u << 10) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_ITER_1         (0x1u << 10) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_TXBUFE           (0x1u << 11) /**< \brief (US_LIN_IER) Buffer Empty Interrupt Enable */
#define   US_LIN_IER_TXBUFE_0       (0x0u << 11) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_TXBUFE_1       (0x1u << 11) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_RXBUFF           (0x1u << 12) /**< \brief (US_LIN_IER) Buffer Full Interrupt Enable */
#define   US_LIN_IER_RXBUFF_0       (0x0u << 12) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_RXBUFF_1       (0x1u << 12) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_NACK             (0x1u << 13) /**< \brief (US_LIN_IER) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Enable */
#define   US_LIN_IER_NACK_0         (0x0u << 13) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_NACK_1         (0x1u << 13) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_LINID            (0x1u << 14) /**< \brief (US_LIN_IER) LIN Identifier Sent or LIN Identifier Received Interrupt Enable */
#define US_LIN_IER_LINTC            (0x1u << 15) /**< \brief (US_LIN_IER) LIN Transfer Conpleted Interrupt Enable */
#define US_LIN_IER_RIIC             (0x1u << 16) /**< \brief (US_LIN_IER) Ring Indicator Input Change Enable */
#define   US_LIN_IER_RIIC_0         (0x0u << 16) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_RIIC_1         (0x1u << 16) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_DSRIC            (0x1u << 17) /**< \brief (US_LIN_IER) Data Set Ready Input Change Enable */
#define   US_LIN_IER_DSRIC_0        (0x0u << 17) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_DSRIC_1        (0x1u << 17) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_DCDIC            (0x1u << 18) /**< \brief (US_LIN_IER) Data Carrier Detect Input Change Interrupt Enable */
#define   US_LIN_IER_DCDIC_0        (0x0u << 18) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_DCDIC_1        (0x1u << 18) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_CTSIC            (0x1u << 19) /**< \brief (US_LIN_IER) Clear to Send Input Change Interrupt Enable */
#define   US_LIN_IER_CTSIC_0        (0x0u << 19) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_CTSIC_1        (0x1u << 19) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_LINBE            (0x1u << 25) /**< \brief (US_LIN_IER) LIN Bus Error Interrupt Enable */
#define US_LIN_IER_LINISFE          (0x1u << 26) /**< \brief (US_LIN_IER) LIN Inconsistent Synch Field Error Interrupt Enable */
#define US_LIN_IER_LINIPE           (0x1u << 27) /**< \brief (US_LIN_IER) LIN Identifier Parity Interrupt Enable */
#define US_LIN_IER_LINCE            (0x1u << 28) /**< \brief (US_LIN_IER) LIN Checksum Error Interrupt Enable */
#define US_LIN_IER_LINSNRE          (0x1u << 29) /**< \brief (US_LIN_IER) LIN Slave Not Responding Error Interrupt Enable */
#define US_LIN_IER_LINSTE           (0x1u << 30) /**< \brief (US_LIN_IER) LIN Synch Tolerance Error Interrupt Enable */
#define   US_LIN_IER_LINSTE_0       (0x0u << 30) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_LINSTE_1       (0x1u << 30) /**< \brief (US_LIN_IER) Enables the interrupt */
#define US_LIN_IER_LINHTE           (0x1u << 31) /**< \brief (US_LIN_IER) LIN Header Timeout Error Interrupt Enable */
#define   US_LIN_IER_LINHTE_0       (0x0u << 31) /**< \brief (US_LIN_IER) No Effect */
#define   US_LIN_IER_LINHTE_1       (0x1u << 31) /**< \brief (US_LIN_IER) Enables the interrupt */
/* -------- US_SPI_SLAVE_IER : (USART Offset: 0x08) Interrupt Enable Register -------- */
#define US_SPI_SLAVE_IER_RXRDY      (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IER) Receiver Ready Interrupt Enable */
#define   US_SPI_SLAVE_IER_RXRDY_0  (0x0u <<  0) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_RXRDY_1  (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_TXRDY      (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IER) Transmitter Ready Interrupt Enable */
#define   US_SPI_SLAVE_IER_TXRDY_0  (0x0u <<  1) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_TXRDY_1  (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_RXBRK      (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IER) Receiver Break Interrupt Enable */
#define   US_SPI_SLAVE_IER_RXBRK_0  (0x0u <<  2) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_RXBRK_1  (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_ENDRX      (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IER) End of Receive Transfer Interrupt Enable */
#define   US_SPI_SLAVE_IER_ENDRX_0  (0x0u <<  3) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_ENDRX_1  (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_ENDTX      (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IER) End of Transmit Interrupt Enable */
#define   US_SPI_SLAVE_IER_ENDTX_0  (0x0u <<  4) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_ENDTX_1  (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_OVRE       (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IER) Overrun Error Interrupt Enable */
#define   US_SPI_SLAVE_IER_OVRE_0   (0x0u <<  5) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_OVRE_1   (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_FRAME      (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IER) Framing Error Interrupt Enable */
#define   US_SPI_SLAVE_IER_FRAME_0  (0x0u <<  6) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_FRAME_1  (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_PARE       (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IER) Parity Error Interrupt Enable */
#define   US_SPI_SLAVE_IER_PARE_0   (0x0u <<  7) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_PARE_1   (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_TIMEOUT    (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IER) Time-out Interrupt Enable */
#define   US_SPI_SLAVE_IER_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
