Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define US_SPI_SLAVE_IER_TXEMPTY    (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IER) Transmitter Empty Interrupt Enable */
#define   US_SPI_SLAVE_IER_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_UNRE       (0x1u << 10) /**< \brief (US_SPI_SLAVE_IER) SPI Underrun Error Interrupt Enable */
#define   US_SPI_SLAVE_IER_UNRE_0   (0x0u << 10) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_UNRE_1   (0x1u << 10) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_TXBUFE     (0x1u << 11) /**< \brief (US_SPI_SLAVE_IER) Buffer Empty Interrupt Enable */
#define   US_SPI_SLAVE_IER_TXBUFE_0 (0x0u << 11) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_TXBUFE_1 (0x1u << 11) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_RXBUFF     (0x1u << 12) /**< \brief (US_SPI_SLAVE_IER) Buffer Full Interrupt Enable */
#define   US_SPI_SLAVE_IER_RXBUFF_0 (0x0u << 12) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_RXBUFF_1 (0x1u << 12) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_NACK       (0x1u << 13) /**< \brief (US_SPI_SLAVE_IER) Non Acknowledge Interrupt Enable */
#define   US_SPI_SLAVE_IER_NACK_0   (0x0u << 13) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_NACK_1   (0x1u << 13) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_RIIC       (0x1u << 16) /**< \brief (US_SPI_SLAVE_IER) Ring Indicator Input Change Enable */
#define   US_SPI_SLAVE_IER_RIIC_0   (0x0u << 16) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_RIIC_1   (0x1u << 16) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_DSRIC      (0x1u << 17) /**< \brief (US_SPI_SLAVE_IER) Data Set Ready Input Change Enable */
#define   US_SPI_SLAVE_IER_DSRIC_0  (0x0u << 17) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_DSRIC_1  (0x1u << 17) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_DCDIC      (0x1u << 18) /**< \brief (US_SPI_SLAVE_IER) Data Carrier Detect Input Change Interrupt Enable */
#define   US_SPI_SLAVE_IER_DCDIC_0  (0x0u << 18) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_DCDIC_1  (0x1u << 18) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
#define US_SPI_SLAVE_IER_CTSIC      (0x1u << 19) /**< \brief (US_SPI_SLAVE_IER) Clear to Send Input Change Interrupt Enable */
#define   US_SPI_SLAVE_IER_CTSIC_0  (0x0u << 19) /**< \brief (US_SPI_SLAVE_IER) No Effect */
#define   US_SPI_SLAVE_IER_CTSIC_1  (0x1u << 19) /**< \brief (US_SPI_SLAVE_IER) Enables the interrupt */
/* -------- US_USART_IER : (USART Offset: 0x08) Interrupt Enable Register -------- */
#define US_USART_IER_RXRDY          (0x1u <<  0) /**< \brief (US_USART_IER) Receiver Ready Interrupt Enable */
#define   US_USART_IER_RXRDY_0      (0x0u <<  0) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_RXRDY_1      (0x1u <<  0) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_TXRDY          (0x1u <<  1) /**< \brief (US_USART_IER) Transmitter Ready Interrupt Enable */
#define   US_USART_IER_TXRDY_0      (0x0u <<  1) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_TXRDY_1      (0x1u <<  1) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_RXBRK          (0x1u <<  2) /**< \brief (US_USART_IER) Receiver Break Interrupt Enable */
#define   US_USART_IER_RXBRK_0      (0x0u <<  2) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_RXBRK_1      (0x1u <<  2) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_ENDRX          (0x1u <<  3) /**< \brief (US_USART_IER) End of Receive Transfer Interrupt Enable */
#define   US_USART_IER_ENDRX_0      (0x0u <<  3) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_ENDRX_1      (0x1u <<  3) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_ENDTX          (0x1u <<  4) /**< \brief (US_USART_IER) End of Transmit Interrupt Enable */
#define   US_USART_IER_ENDTX_0      (0x0u <<  4) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_ENDTX_1      (0x1u <<  4) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_OVRE           (0x1u <<  5) /**< \brief (US_USART_IER) Overrun Error Interrupt Enable */
#define   US_USART_IER_OVRE_0       (0x0u <<  5) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_OVRE_1       (0x1u <<  5) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_FRAME          (0x1u <<  6) /**< \brief (US_USART_IER) Framing Error Interrupt Enable */
#define   US_USART_IER_FRAME_0      (0x0u <<  6) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_FRAME_1      (0x1u <<  6) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_PARE           (0x1u <<  7) /**< \brief (US_USART_IER) Parity Error Interrupt Enable */
#define   US_USART_IER_PARE_0       (0x0u <<  7) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_PARE_1       (0x1u <<  7) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_TIMEOUT        (0x1u <<  8) /**< \brief (US_USART_IER) Time-out Interrupt Enable */
#define   US_USART_IER_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_TXEMPTY        (0x1u <<  9) /**< \brief (US_USART_IER) Transmitter Empty Interrupt Enable */
#define   US_USART_IER_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_ITER           (0x1u << 10) /**< \brief (US_USART_IER) Iteration Interrupt Enable */
#define   US_USART_IER_ITER_0       (0x0u << 10) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_ITER_1       (0x1u << 10) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_TXBUFE         (0x1u << 11) /**< \brief (US_USART_IER) Buffer Empty Interrupt Enable */
#define   US_USART_IER_TXBUFE_0     (0x0u << 11) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_TXBUFE_1     (0x1u << 11) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_RXBUFF         (0x1u << 12) /**< \brief (US_USART_IER) Buffer Full Interrupt Enable */
#define   US_USART_IER_RXBUFF_0     (0x0u << 12) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_RXBUFF_1     (0x1u << 12) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_NACK           (0x1u << 13) /**< \brief (US_USART_IER) Non Acknowledge Interrupt Enable */
#define   US_USART_IER_NACK_0       (0x0u << 13) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_NACK_1       (0x1u << 13) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_RIIC           (0x1u << 16) /**< \brief (US_USART_IER) Ring Indicator Input Change Enable */
#define   US_USART_IER_RIIC_0       (0x0u << 16) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_RIIC_1       (0x1u << 16) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_DSRIC          (0x1u << 17) /**< \brief (US_USART_IER) Data Set Ready Input Change Enable */
#define   US_USART_IER_DSRIC_0      (0x0u << 17) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_DSRIC_1      (0x1u << 17) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_DCDIC          (0x1u << 18) /**< \brief (US_USART_IER) Data Carrier Detect Input Change Interrupt Enable */
#define   US_USART_IER_DCDIC_0      (0x0u << 18) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_DCDIC_1      (0x1u << 18) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_CTSIC          (0x1u << 19) /**< \brief (US_USART_IER) Clear to Send Input Change Interrupt Enable */
#define   US_USART_IER_CTSIC_0      (0x0u << 19) /**< \brief (US_USART_IER) No Effect */
#define   US_USART_IER_CTSIC_1      (0x1u << 19) /**< \brief (US_USART_IER) Enables the interrupt */
#define US_USART_IER_MANE           (0x1u << 20) /**< \brief (US_USART_IER) Manchester Error Interrupt Enable */
#define US_USART_IER_MANEA          (0x1u << 24) /**< \brief (US_USART_IER) Manchester Error Interrupt Enable */
#define   US_USART_IER_MANEA_0      (0x0u << 24) /**< \brief (US_USART_IER) No effect */
#define   US_USART_IER_MANEA_1      (0x1u << 24) /**< \brief (US_USART_IER) Enables the interrupt */
/* -------- US_LIN_IDR : (USART Offset: 0x0C) Interrupt Disable Register -------- */
#define US_LIN_IDR_RXRDY            (0x1u <<  0) /**< \brief (US_LIN_IDR) Receiver Ready Interrupt Disable */
#define   US_LIN_IDR_RXRDY_0        (0x0u <<  0) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_RXRDY_1        (0x1u <<  0) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_TXRDY            (0x1u <<  1) /**< \brief (US_LIN_IDR) Transmitter Ready Interrupt Disable */
#define   US_LIN_IDR_TXRDY_0        (0x0u <<  1) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_TXRDY_1        (0x1u <<  1) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_RXBRK            (0x1u <<  2) /**< \brief (US_LIN_IDR) Receiver Break Interrupt Disable */
#define   US_LIN_IDR_RXBRK_0        (0x0u <<  2) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_RXBRK_1        (0x1u <<  2) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_ENDRX            (0x1u <<  3) /**< \brief (US_LIN_IDR) End of Receive Transfer Interrupt Disable */
#define   US_LIN_IDR_ENDRX_0        (0x0u <<  3) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_ENDRX_1        (0x1u <<  3) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_ENDTX            (0x1u <<  4) /**< \brief (US_LIN_IDR) End of Transmit Interrupt Disable */
#define   US_LIN_IDR_ENDTX_0        (0x0u <<  4) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_ENDTX_1        (0x1u <<  4) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_OVRE             (0x1u <<  5) /**< \brief (US_LIN_IDR) Overrun Error Interrupt Disable */
#define   US_LIN_IDR_OVRE_0         (0x0u <<  5) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_OVRE_1         (0x1u <<  5) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_FRAME            (0x1u <<  6) /**< \brief (US_LIN_IDR) Framing Error Interrupt Disable */
#define   US_LIN_IDR_FRAME_0        (0x0u <<  6) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_FRAME_1        (0x1u <<  6) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_PARE             (0x1u <<  7) /**< \brief (US_LIN_IDR) Parity Error Interrupt Disable */
#define   US_LIN_IDR_PARE_0         (0x0u <<  7) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_PARE_1         (0x1u <<  7) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_TIMEOUT          (0x1u <<  8) /**< \brief (US_LIN_IDR) Time-out Interrupt Disable */
#define   US_LIN_IDR_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_TXEMPTY          (0x1u <<  9) /**< \brief (US_LIN_IDR) Transmitter Empty Interrupt Disable */
#define   US_LIN_IDR_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_ITER             (0x1u << 10) /**< \brief (US_LIN_IDR) Iteration Interrupt Disable */
#define   US_LIN_IDR_ITER_0         (0x0u << 10) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_ITER_1         (0x1u << 10) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_TXBUFE           (0x1u << 11) /**< \brief (US_LIN_IDR) Buffer Empty Interrupt Disable */
#define   US_LIN_IDR_TXBUFE_0       (0x0u << 11) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_TXBUFE_1       (0x1u << 11) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_RXBUFF           (0x1u << 12) /**< \brief (US_LIN_IDR) Buffer Full Interrupt Disable */
#define   US_LIN_IDR_RXBUFF_0       (0x0u << 12) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_RXBUFF_1       (0x1u << 12) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_NACK             (0x1u << 13) /**< \brief (US_LIN_IDR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Disable */
#define   US_LIN_IDR_NACK_0         (0x0u << 13) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_NACK_1         (0x1u << 13) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_LINID            (0x1u << 14) /**< \brief (US_LIN_IDR) LIN Identifier Sent or LIN Identifier Received Interrupt Disable */
#define US_LIN_IDR_LINTC            (0x1u << 15) /**< \brief (US_LIN_IDR) LIN Transfer Conpleted Interrupt Disable */
#define US_LIN_IDR_RIIC             (0x1u << 16) /**< \brief (US_LIN_IDR) Ring Indicator Input Change Disable */
#define   US_LIN_IDR_RIIC_0         (0x0u << 16) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_RIIC_1         (0x1u << 16) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_DSRIC            (0x1u << 17) /**< \brief (US_LIN_IDR) Data Set Ready Input Change Disable */
#define   US_LIN_IDR_DSRIC_0        (0x0u << 17) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_DSRIC_1        (0x1u << 17) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_DCDIC            (0x1u << 18) /**< \brief (US_LIN_IDR) Data Carrier Detect Input Change Interrupt Disable */
#define   US_LIN_IDR_DCDIC_0        (0x0u << 18) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_DCDIC_1        (0x1u << 18) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_CTSIC            (0x1u << 19) /**< \brief (US_LIN_IDR) Clear to Send Input Change Interrupt Disable */
#define   US_LIN_IDR_CTSIC_0        (0x0u << 19) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_CTSIC_1        (0x1u << 19) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_LINBE            (0x1u << 25) /**< \brief (US_LIN_IDR) LIN Bus Error Interrupt Disable */
#define US_LIN_IDR_LINISFE          (0x1u << 26) /**< \brief (US_LIN_IDR) LIN Inconsistent Synch Field Error Interrupt Disable */
#define US_LIN_IDR_LINIPE           (0x1u << 27) /**< \brief (US_LIN_IDR) LIN Identifier Parity Interrupt Disable */
#define US_LIN_IDR_LINCE            (0x1u << 28) /**< \brief (US_LIN_IDR) LIN Checksum Error Interrupt Disable */
#define US_LIN_IDR_LINSNRE          (0x1u << 29) /**< \brief (US_LIN_IDR) LIN Slave Not Responding Error Interrupt Disable */
#define US_LIN_IDR_LINSTE           (0x1u << 30) /**< \brief (US_LIN_IDR) LIN Synch Tolerance Error Interrupt Disable */
#define   US_LIN_IDR_LINSTE_0       (0x0u << 30) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_LINSTE_1       (0x1u << 30) /**< \brief (US_LIN_IDR) Disables the interrupt */
#define US_LIN_IDR_LINHTE           (0x1u << 31) /**< \brief (US_LIN_IDR) LIN Header Timeout Error Interrupt Disable */
#define   US_LIN_IDR_LINHTE_0       (0x0u << 31) /**< \brief (US_LIN_IDR) No Effect */
#define   US_LIN_IDR_LINHTE_1       (0x1u << 31) /**< \brief (US_LIN_IDR) Disables the interrupt */
/* -------- US_SPI_SLAVE_IDR : (USART Offset: 0x0C) Interrupt Disable Register -------- */
#define US_SPI_SLAVE_IDR_RXRDY      (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IDR) Receiver Ready Interrupt Disable */
#define   US_SPI_SLAVE_IDR_RXRDY_0  (0x0u <<  0) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_RXRDY_1  (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_TXRDY      (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IDR) Transmitter Ready Interrupt Disable */
#define   US_SPI_SLAVE_IDR_TXRDY_0  (0x0u <<  1) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_TXRDY_1  (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_RXBRK      (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IDR) Receiver Break Interrupt Disable */
#define   US_SPI_SLAVE_IDR_RXBRK_0  (0x0u <<  2) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_RXBRK_1  (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_ENDRX      (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IDR) End of Receive Transfer Interrupt Disable */
#define   US_SPI_SLAVE_IDR_ENDRX_0  (0x0u <<  3) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_ENDRX_1  (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_ENDTX      (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IDR) End of Transmit Interrupt Disable */
#define   US_SPI_SLAVE_IDR_ENDTX_0  (0x0u <<  4) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_ENDTX_1  (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_OVRE       (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IDR) Overrun Error Interrupt Disable */
#define   US_SPI_SLAVE_IDR_OVRE_0   (0x0u <<  5) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_OVRE_1   (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_FRAME      (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IDR) Framing Error Interrupt Disable */
#define   US_SPI_SLAVE_IDR_FRAME_0  (0x0u <<  6) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_FRAME_1  (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_PARE       (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IDR) Parity Error Interrupt Disable */
#define   US_SPI_SLAVE_IDR_PARE_0   (0x0u <<  7) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_PARE_1   (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_TIMEOUT    (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IDR) Time-out Interrupt Disable */
#define   US_SPI_SLAVE_IDR_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_TXEMPTY    (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IDR) Transmitter Empty Interrupt Disable */
#define   US_SPI_SLAVE_IDR_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_UNRE       (0x1u << 10) /**< \brief (US_SPI_SLAVE_IDR) SPI Underrun Error Interrupt Disable */
#define   US_SPI_SLAVE_IDR_UNRE_0   (0x0u << 10) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_UNRE_1   (0x1u << 10) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_TXBUFE     (0x1u << 11) /**< \brief (US_SPI_SLAVE_IDR) Buffer Empty Interrupt Disable */
#define   US_SPI_SLAVE_IDR_TXBUFE_0 (0x0u << 11) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_TXBUFE_1 (0x1u << 11) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_RXBUFF     (0x1u << 12) /**< \brief (US_SPI_SLAVE_IDR) Buffer Full Interrupt Disable */
#define   US_SPI_SLAVE_IDR_RXBUFF_0 (0x0u << 12) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_RXBUFF_1 (0x1u << 12) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_NACK       (0x1u << 13) /**< \brief (US_SPI_SLAVE_IDR) Non Acknowledge Interrupt Disable */
#define   US_SPI_SLAVE_IDR_NACK_0   (0x0u << 13) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_NACK_1   (0x1u << 13) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_RIIC       (0x1u << 16) /**< \brief (US_SPI_SLAVE_IDR) Ring Indicator Input Change Disable */
#define   US_SPI_SLAVE_IDR_RIIC_0   (0x0u << 16) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_RIIC_1   (0x1u << 16) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_DSRIC      (0x1u << 17) /**< \brief (US_SPI_SLAVE_IDR) Data Set Ready Input Change Disable */
#define   US_SPI_SLAVE_IDR_DSRIC_0  (0x0u << 17) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_DSRIC_1  (0x1u << 17) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_DCDIC      (0x1u << 18) /**< \brief (US_SPI_SLAVE_IDR) Data Carrier Detect Input Change Interrupt Disable */
#define   US_SPI_SLAVE_IDR_DCDIC_0  (0x0u << 18) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_DCDIC_1  (0x1u << 18) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
#define US_SPI_SLAVE_IDR_CTSIC      (0x1u << 19) /**< \brief (US_SPI_SLAVE_IDR) Clear to Send Input Change Interrupt Disable */
#define   US_SPI_SLAVE_IDR_CTSIC_0  (0x0u << 19) /**< \brief (US_SPI_SLAVE_IDR) No Effect */
#define   US_SPI_SLAVE_IDR_CTSIC_1  (0x1u << 19) /**< \brief (US_SPI_SLAVE_IDR) Disables the interrupt */
/* -------- US_USART_IDR : (USART Offset: 0x0C) Interrupt Disable Register -------- */
#define US_USART_IDR_RXRDY          (0x1u <<  0) /**< \brief (US_USART_IDR) Receiver Ready Interrupt Disable */
#define   US_USART_IDR_RXRDY_0      (0x0u <<  0) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_RXRDY_1      (0x1u <<  0) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_TXRDY          (0x1u <<  1) /**< \brief (US_USART_IDR) Transmitter Ready Interrupt Disable */
#define   US_USART_IDR_TXRDY_0      (0x0u <<  1) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_TXRDY_1      (0x1u <<  1) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_RXBRK          (0x1u <<  2) /**< \brief (US_USART_IDR) Receiver Break Interrupt Disable */
#define   US_USART_IDR_RXBRK_0      (0x0u <<  2) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_RXBRK_1      (0x1u <<  2) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_ENDRX          (0x1u <<  3) /**< \brief (US_USART_IDR) End of Receive Transfer Interrupt Disable */
#define   US_USART_IDR_ENDRX_0      (0x0u <<  3) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_ENDRX_1      (0x1u <<  3) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_ENDTX          (0x1u <<  4) /**< \brief (US_USART_IDR) End of Transmit Interrupt Disable */
#define   US_USART_IDR_ENDTX_0      (0x0u <<  4) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_ENDTX_1      (0x1u <<  4) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_OVRE           (0x1u <<  5) /**< \brief (US_USART_IDR) Overrun Error Interrupt Disable */
#define   US_USART_IDR_OVRE_0       (0x0u <<  5) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_OVRE_1       (0x1u <<  5) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_FRAME          (0x1u <<  6) /**< \brief (US_USART_IDR) Framing Error Interrupt Disable */
#define   US_USART_IDR_FRAME_0      (0x0u <<  6) /**< \brief (US_USART_IDR) No Effect */
