Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define   US_USART_IDR_FRAME_1      (0x1u <<  6) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_PARE           (0x1u <<  7) /**< \brief (US_USART_IDR) Parity Error Interrupt Disable */
#define   US_USART_IDR_PARE_0       (0x0u <<  7) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_PARE_1       (0x1u <<  7) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_TIMEOUT        (0x1u <<  8) /**< \brief (US_USART_IDR) Time-out Interrupt Disable */
#define   US_USART_IDR_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_TXEMPTY        (0x1u <<  9) /**< \brief (US_USART_IDR) Transmitter Empty Interrupt Disable */
#define   US_USART_IDR_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_ITER           (0x1u << 10) /**< \brief (US_USART_IDR) Iteration Interrupt Disable */
#define   US_USART_IDR_ITER_0       (0x0u << 10) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_ITER_1       (0x1u << 10) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_TXBUFE         (0x1u << 11) /**< \brief (US_USART_IDR) Buffer Empty Interrupt Disable */
#define   US_USART_IDR_TXBUFE_0     (0x0u << 11) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_TXBUFE_1     (0x1u << 11) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_RXBUFF         (0x1u << 12) /**< \brief (US_USART_IDR) Buffer Full Interrupt Disable */
#define   US_USART_IDR_RXBUFF_0     (0x0u << 12) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_RXBUFF_1     (0x1u << 12) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_NACK           (0x1u << 13) /**< \brief (US_USART_IDR) Non Acknowledge Interrupt Disable */
#define   US_USART_IDR_NACK_0       (0x0u << 13) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_NACK_1       (0x1u << 13) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_RIIC           (0x1u << 16) /**< \brief (US_USART_IDR) Ring Indicator Input Change Disable */
#define   US_USART_IDR_RIIC_0       (0x0u << 16) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_RIIC_1       (0x1u << 16) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_DSRIC          (0x1u << 17) /**< \brief (US_USART_IDR) Data Set Ready Input Change Disable */
#define   US_USART_IDR_DSRIC_0      (0x0u << 17) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_DSRIC_1      (0x1u << 17) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_DCDIC          (0x1u << 18) /**< \brief (US_USART_IDR) Data Carrier Detect Input Change Interrupt Disable */
#define   US_USART_IDR_DCDIC_0      (0x0u << 18) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_DCDIC_1      (0x1u << 18) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_CTSIC          (0x1u << 19) /**< \brief (US_USART_IDR) Clear to Send Input Change Interrupt Disable */
#define   US_USART_IDR_CTSIC_0      (0x0u << 19) /**< \brief (US_USART_IDR) No Effect */
#define   US_USART_IDR_CTSIC_1      (0x1u << 19) /**< \brief (US_USART_IDR) Disables the interrupt */
#define US_USART_IDR_MANE           (0x1u << 20) /**< \brief (US_USART_IDR) Manchester Error Interrupt Disable */
#define US_USART_IDR_MANEA          (0x1u << 24) /**< \brief (US_USART_IDR) Manchester Error Interrupt Disable */
#define   US_USART_IDR_MANEA_0      (0x0u << 24) /**< \brief (US_USART_IDR) No effect */
#define   US_USART_IDR_MANEA_1      (0x1u << 24) /**< \brief (US_USART_IDR) Disables the corresponding interrupt */
/* -------- US_LIN_IMR : (USART Offset: 0x10) Interrupt Mask Register -------- */
#define US_LIN_IMR_RXRDY            (0x1u <<  0) /**< \brief (US_LIN_IMR) RXRDY Interrupt Mask */
#define   US_LIN_IMR_RXRDY_0        (0x0u <<  0) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_RXRDY_1        (0x1u <<  0) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_TXRDY            (0x1u <<  1) /**< \brief (US_LIN_IMR) TXRDY Interrupt Mask */
#define   US_LIN_IMR_TXRDY_0        (0x0u <<  1) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_TXRDY_1        (0x1u <<  1) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_RXBRK            (0x1u <<  2) /**< \brief (US_LIN_IMR) Receiver Break Interrupt Mask */
#define   US_LIN_IMR_RXBRK_0        (0x0u <<  2) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_RXBRK_1        (0x1u <<  2) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_ENDRX            (0x1u <<  3) /**< \brief (US_LIN_IMR) End of Receive Transfer Interrupt Mask */
#define   US_LIN_IMR_ENDRX_0        (0x0u <<  3) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_ENDRX_1        (0x1u <<  3) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_ENDTX            (0x1u <<  4) /**< \brief (US_LIN_IMR) End of Transmit Interrupt Mask */
#define   US_LIN_IMR_ENDTX_0        (0x0u <<  4) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_ENDTX_1        (0x1u <<  4) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_OVRE             (0x1u <<  5) /**< \brief (US_LIN_IMR) Overrun Error Interrupt Mask */
#define   US_LIN_IMR_OVRE_0         (0x0u <<  5) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_OVRE_1         (0x1u <<  5) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_FRAME            (0x1u <<  6) /**< \brief (US_LIN_IMR) Framing Error Interrupt Mask */
#define   US_LIN_IMR_FRAME_0        (0x0u <<  6) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_FRAME_1        (0x1u <<  6) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_PARE             (0x1u <<  7) /**< \brief (US_LIN_IMR) Parity Error Interrupt Mask */
#define   US_LIN_IMR_PARE_0         (0x0u <<  7) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_PARE_1         (0x1u <<  7) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_TIMEOUT          (0x1u <<  8) /**< \brief (US_LIN_IMR) Time-out Interrupt Mask */
#define   US_LIN_IMR_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_TXEMPTY          (0x1u <<  9) /**< \brief (US_LIN_IMR) TXEMPTY Interrupt Mask */
#define   US_LIN_IMR_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_ITER             (0x1u << 10) /**< \brief (US_LIN_IMR) Iteration Interrupt Mask */
#define   US_LIN_IMR_ITER_0         (0x0u << 10) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_ITER_1         (0x1u << 10) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_TXBUFE           (0x1u << 11) /**< \brief (US_LIN_IMR) Buffer Empty Interrupt Mask */
#define   US_LIN_IMR_TXBUFE_0       (0x0u << 11) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_TXBUFE_1       (0x1u << 11) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_RXBUFF           (0x1u << 12) /**< \brief (US_LIN_IMR) Buffer Full Interrupt Mask */
#define   US_LIN_IMR_RXBUFF_0       (0x0u << 12) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_RXBUFF_1       (0x1u << 12) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_NACK             (0x1u << 13) /**< \brief (US_LIN_IMR) Non Acknowledge  or LIN Break Sent or LIN Break Received Interrupt Mask */
#define   US_LIN_IMR_NACK_0         (0x0u << 13) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_NACK_1         (0x1u << 13) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_LINID            (0x1u << 14) /**< \brief (US_LIN_IMR) LIN Identifier Sent or LIN Received Interrupt Mask */
#define US_LIN_IMR_LINTC            (0x1u << 15) /**< \brief (US_LIN_IMR) LIN Transfer Conpleted Interrupt Mask */
#define US_LIN_IMR_RIIC             (0x1u << 16) /**< \brief (US_LIN_IMR) Ring Indicator Input Change Mask */
#define   US_LIN_IMR_RIIC_0         (0x0u << 16) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_RIIC_1         (0x1u << 16) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_DSRIC            (0x1u << 17) /**< \brief (US_LIN_IMR) Data Set Ready Input Change Mask */
#define   US_LIN_IMR_DSRIC_0        (0x0u << 17) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_DSRIC_1        (0x1u << 17) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_DCDIC            (0x1u << 18) /**< \brief (US_LIN_IMR) Data Carrier Detect Input Change Interrupt Mask */
#define   US_LIN_IMR_DCDIC_0        (0x0u << 18) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_DCDIC_1        (0x1u << 18) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_CTSIC            (0x1u << 19) /**< \brief (US_LIN_IMR) Clear to Send Input Change Interrupt Mask */
#define   US_LIN_IMR_CTSIC_0        (0x0u << 19) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_CTSIC_1        (0x1u << 19) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_LINBE            (0x1u << 25) /**< \brief (US_LIN_IMR) LIN Bus Error Interrupt Mask */
#define US_LIN_IMR_LINISFE          (0x1u << 26) /**< \brief (US_LIN_IMR) LIN Inconsistent Synch Field Error Interrupt Mask */
#define US_LIN_IMR_LINIPE           (0x1u << 27) /**< \brief (US_LIN_IMR) LIN Identifier Parity Interrupt Mask */
#define US_LIN_IMR_LINCE            (0x1u << 28) /**< \brief (US_LIN_IMR) LIN Checksum Error Interrupt Mask */
#define US_LIN_IMR_LINSNRE          (0x1u << 29) /**< \brief (US_LIN_IMR) LIN Slave Not Responding Error Interrupt Mask */
#define US_LIN_IMR_LINSTE           (0x1u << 30) /**< \brief (US_LIN_IMR) LIN Synch Tolerance Error Interrupt Mask */
#define   US_LIN_IMR_LINSTE_0       (0x0u << 30) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_LINSTE_1       (0x1u << 30) /**< \brief (US_LIN_IMR) The interrupt is enabled */
#define US_LIN_IMR_LINHTE           (0x1u << 31) /**< \brief (US_LIN_IMR) LIN Header Timeout Error Interrupt Mask */
#define   US_LIN_IMR_LINHTE_0       (0x0u << 31) /**< \brief (US_LIN_IMR) The interrupt is disabled */
#define   US_LIN_IMR_LINHTE_1       (0x1u << 31) /**< \brief (US_LIN_IMR) The interrupt is enabled */
/* -------- US_SPI_SLAVE_IMR : (USART Offset: 0x10) Interrupt Mask Register -------- */
#define US_SPI_SLAVE_IMR_RXRDY      (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IMR) RXRDY Interrupt Mask */
#define   US_SPI_SLAVE_IMR_RXRDY_0  (0x0u <<  0) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_RXRDY_1  (0x1u <<  0) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_TXRDY      (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IMR) TXRDY Interrupt Mask */
#define   US_SPI_SLAVE_IMR_TXRDY_0  (0x0u <<  1) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_TXRDY_1  (0x1u <<  1) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_RXBRK      (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IMR) Receiver Break Interrupt Mask */
#define   US_SPI_SLAVE_IMR_RXBRK_0  (0x0u <<  2) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_RXBRK_1  (0x1u <<  2) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_ENDRX      (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IMR) End of Receive Transfer Interrupt Mask */
#define   US_SPI_SLAVE_IMR_ENDRX_0  (0x0u <<  3) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_ENDRX_1  (0x1u <<  3) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_ENDTX      (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IMR) End of Transmit Interrupt Mask */
#define   US_SPI_SLAVE_IMR_ENDTX_0  (0x0u <<  4) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_ENDTX_1  (0x1u <<  4) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_OVRE       (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IMR) Overrun Error Interrupt Mask */
#define   US_SPI_SLAVE_IMR_OVRE_0   (0x0u <<  5) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_OVRE_1   (0x1u <<  5) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_FRAME      (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IMR) Framing Error Interrupt Mask */
#define   US_SPI_SLAVE_IMR_FRAME_0  (0x0u <<  6) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_FRAME_1  (0x1u <<  6) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_PARE       (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IMR) Parity Error Interrupt Mask */
#define   US_SPI_SLAVE_IMR_PARE_0   (0x0u <<  7) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_PARE_1   (0x1u <<  7) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_TIMEOUT    (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IMR) Time-out Interrupt Mask */
#define   US_SPI_SLAVE_IMR_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_TXEMPTY    (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IMR) TXEMPTY Interrupt Mask */
#define   US_SPI_SLAVE_IMR_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_UNRE       (0x1u << 10) /**< \brief (US_SPI_SLAVE_IMR) SPI Underrun Error Interrupt Mask */
#define   US_SPI_SLAVE_IMR_UNRE_0   (0x0u << 10) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_UNRE_1   (0x1u << 10) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_TXBUFE     (0x1u << 11) /**< \brief (US_SPI_SLAVE_IMR) Buffer Empty Interrupt Mask */
#define   US_SPI_SLAVE_IMR_TXBUFE_0 (0x0u << 11) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_TXBUFE_1 (0x1u << 11) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_RXBUFF     (0x1u << 12) /**< \brief (US_SPI_SLAVE_IMR) Buffer Full Interrupt Mask */
#define   US_SPI_SLAVE_IMR_RXBUFF_0 (0x0u << 12) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_RXBUFF_1 (0x1u << 12) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_NACK       (0x1u << 13) /**< \brief (US_SPI_SLAVE_IMR) Non Acknowledge Interrupt Mask */
#define   US_SPI_SLAVE_IMR_NACK_0   (0x0u << 13) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_NACK_1   (0x1u << 13) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_RIIC       (0x1u << 16) /**< \brief (US_SPI_SLAVE_IMR) Ring Indicator Input Change Mask */
#define   US_SPI_SLAVE_IMR_RIIC_0   (0x0u << 16) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_RIIC_1   (0x1u << 16) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_DSRIC      (0x1u << 17) /**< \brief (US_SPI_SLAVE_IMR) Data Set Ready Input Change Mask */
#define   US_SPI_SLAVE_IMR_DSRIC_0  (0x0u << 17) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_DSRIC_1  (0x1u << 17) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_DCDIC      (0x1u << 18) /**< \brief (US_SPI_SLAVE_IMR) Data Carrier Detect Input Change Interrupt Mask */
#define   US_SPI_SLAVE_IMR_DCDIC_0  (0x0u << 18) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_DCDIC_1  (0x1u << 18) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
#define US_SPI_SLAVE_IMR_CTSIC      (0x1u << 19) /**< \brief (US_SPI_SLAVE_IMR) Clear to Send Input Change Interrupt Mask */
#define   US_SPI_SLAVE_IMR_CTSIC_0  (0x0u << 19) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is disabled */
#define   US_SPI_SLAVE_IMR_CTSIC_1  (0x1u << 19) /**< \brief (US_SPI_SLAVE_IMR) The interrupt is enabled */
/* -------- US_USART_IMR : (USART Offset: 0x10) Interrupt Mask Register -------- */
#define US_USART_IMR_RXRDY          (0x1u <<  0) /**< \brief (US_USART_IMR) RXRDY Interrupt Mask */
#define   US_USART_IMR_RXRDY_0      (0x0u <<  0) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_RXRDY_1      (0x1u <<  0) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_TXRDY          (0x1u <<  1) /**< \brief (US_USART_IMR) TXRDY Interrupt Mask */
#define   US_USART_IMR_TXRDY_0      (0x0u <<  1) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_TXRDY_1      (0x1u <<  1) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_RXBRK          (0x1u <<  2) /**< \brief (US_USART_IMR) Receiver Break Interrupt Mask */
#define   US_USART_IMR_RXBRK_0      (0x0u <<  2) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_RXBRK_1      (0x1u <<  2) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_ENDRX          (0x1u <<  3) /**< \brief (US_USART_IMR) End of Receive Transfer Interrupt Mask */
#define   US_USART_IMR_ENDRX_0      (0x0u <<  3) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_ENDRX_1      (0x1u <<  3) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_ENDTX          (0x1u <<  4) /**< \brief (US_USART_IMR) End of Transmit Interrupt Mask */
#define   US_USART_IMR_ENDTX_0      (0x0u <<  4) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_ENDTX_1      (0x1u <<  4) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_OVRE           (0x1u <<  5) /**< \brief (US_USART_IMR) Overrun Error Interrupt Mask */
#define   US_USART_IMR_OVRE_0       (0x0u <<  5) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_OVRE_1       (0x1u <<  5) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_FRAME          (0x1u <<  6) /**< \brief (US_USART_IMR) Framing Error Interrupt Mask */
#define   US_USART_IMR_FRAME_0      (0x0u <<  6) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_FRAME_1      (0x1u <<  6) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_PARE           (0x1u <<  7) /**< \brief (US_USART_IMR) Parity Error Interrupt Mask */
#define   US_USART_IMR_PARE_0       (0x0u <<  7) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_PARE_1       (0x1u <<  7) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_TIMEOUT        (0x1u <<  8) /**< \brief (US_USART_IMR) Time-out Interrupt Mask */
#define   US_USART_IMR_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_TXEMPTY        (0x1u <<  9) /**< \brief (US_USART_IMR) TXEMPTY Interrupt Mask */
#define   US_USART_IMR_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_ITER           (0x1u << 10) /**< \brief (US_USART_IMR) Iteration Interrupt Mask */
#define   US_USART_IMR_ITER_0       (0x0u << 10) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_ITER_1       (0x1u << 10) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_TXBUFE         (0x1u << 11) /**< \brief (US_USART_IMR) Buffer Empty Interrupt Mask */
#define   US_USART_IMR_TXBUFE_0     (0x0u << 11) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_TXBUFE_1     (0x1u << 11) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_RXBUFF         (0x1u << 12) /**< \brief (US_USART_IMR) Buffer Full Interrupt Mask */
#define   US_USART_IMR_RXBUFF_0     (0x0u << 12) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_RXBUFF_1     (0x1u << 12) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_NACK           (0x1u << 13) /**< \brief (US_USART_IMR) Non Acknowledge Interrupt Mask */
#define   US_USART_IMR_NACK_0       (0x0u << 13) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_NACK_1       (0x1u << 13) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_RIIC           (0x1u << 16) /**< \brief (US_USART_IMR) Ring Indicator Input Change Mask */
#define   US_USART_IMR_RIIC_0       (0x0u << 16) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_RIIC_1       (0x1u << 16) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_DSRIC          (0x1u << 17) /**< \brief (US_USART_IMR) Data Set Ready Input Change Mask */
#define   US_USART_IMR_DSRIC_0      (0x0u << 17) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_DSRIC_1      (0x1u << 17) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_DCDIC          (0x1u << 18) /**< \brief (US_USART_IMR) Data Carrier Detect Input Change Interrupt Mask */
#define   US_USART_IMR_DCDIC_0      (0x0u << 18) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_DCDIC_1      (0x1u << 18) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_CTSIC          (0x1u << 19) /**< \brief (US_USART_IMR) Clear to Send Input Change Interrupt Mask */
#define   US_USART_IMR_CTSIC_0      (0x0u << 19) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_CTSIC_1      (0x1u << 19) /**< \brief (US_USART_IMR) The interrupt is enabled */
#define US_USART_IMR_MANE           (0x1u << 20) /**< \brief (US_USART_IMR)  */
#define US_USART_IMR_MANEA          (0x1u << 24) /**< \brief (US_USART_IMR) Manchester Error Interrupt Mask */
#define   US_USART_IMR_MANEA_0      (0x0u << 24) /**< \brief (US_USART_IMR) The interrupt is disabled */
#define   US_USART_IMR_MANEA_1      (0x1u << 24) /**< \brief (US_USART_IMR) The interrupt is enabled */
/* -------- US_LIN_CSR : (USART Offset: 0x14) Channel Status Register -------- */
#define US_LIN_CSR_RXRDY            (0x1u <<  0) /**< \brief (US_LIN_CSR) Receiver Ready */
