Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define   US_LIN_CSR_RXRDY_0        (0x0u <<  0) /**< \brief (US_LIN_CSR) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_LIN_CSR_RXRDY_1        (0x1u <<  0) /**< \brief (US_LIN_CSR) At least one complete character has been received and RHR has not yet been read */
#define US_LIN_CSR_TXRDY            (0x1u <<  1) /**< \brief (US_LIN_CSR) Transmitter Ready */
#define   US_LIN_CSR_TXRDY_0        (0x0u <<  1) /**< \brief (US_LIN_CSR) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_LIN_CSR_TXRDY_1        (0x1u <<  1) /**< \brief (US_LIN_CSR) There is no character in the THR */
#define US_LIN_CSR_RXBRK            (0x1u <<  2) /**< \brief (US_LIN_CSR) Break Received/End of Break */
#define   US_LIN_CSR_RXBRK_0        (0x0u <<  2) /**< \brief (US_LIN_CSR) No Break received or End of Break detected since the last RSTSTA */
#define   US_LIN_CSR_RXBRK_1        (0x1u <<  2) /**< \brief (US_LIN_CSR) Break Received or End of Break detected since the last RSTSTA */
#define US_LIN_CSR_ENDRX            (0x1u <<  3) /**< \brief (US_LIN_CSR) End of Receiver Transfer */
#define   US_LIN_CSR_ENDRX_0        (0x0u <<  3) /**< \brief (US_LIN_CSR) The End of Transfer signal from the Receive PDC channel is inactive */
#define   US_LIN_CSR_ENDRX_1        (0x1u <<  3) /**< \brief (US_LIN_CSR) The End of Transfer signal from the Receive PDC channel is active */
#define US_LIN_CSR_ENDTX            (0x1u <<  4) /**< \brief (US_LIN_CSR) End of Transmitter Transfer */
#define   US_LIN_CSR_ENDTX_0        (0x0u <<  4) /**< \brief (US_LIN_CSR) The End of Transfer signal from the Transmit PDC channel is inactive */
#define   US_LIN_CSR_ENDTX_1        (0x1u <<  4) /**< \brief (US_LIN_CSR) The End of Transfer signal from the Transmit PDC channel is active */
#define US_LIN_CSR_OVRE             (0x1u <<  5) /**< \brief (US_LIN_CSR) Overrun Error */
#define   US_LIN_CSR_OVRE_0         (0x0u <<  5) /**< \brief (US_LIN_CSR) No overrun error has occurred since since the last RSTSTA */
#define   US_LIN_CSR_OVRE_1         (0x1u <<  5) /**< \brief (US_LIN_CSR) At least one overrun error has occurred since the last RSTSTA */
#define US_LIN_CSR_FRAME            (0x1u <<  6) /**< \brief (US_LIN_CSR) Framing Error */
#define   US_LIN_CSR_FRAME_0        (0x0u <<  6) /**< \brief (US_LIN_CSR) No stop bit has been detected low since the last RSTSTA */
#define   US_LIN_CSR_FRAME_1        (0x1u <<  6) /**< \brief (US_LIN_CSR) At least one stop bit has been detected low since the last RSTSTA */
#define US_LIN_CSR_PARE             (0x1u <<  7) /**< \brief (US_LIN_CSR) Parity Error */
#define   US_LIN_CSR_PARE_0         (0x0u <<  7) /**< \brief (US_LIN_CSR) No parity error has been detected since the last RSTSTA */
#define   US_LIN_CSR_PARE_1         (0x1u <<  7) /**< \brief (US_LIN_CSR) At least one parity error has been detected since the last RSTSTA */
#define US_LIN_CSR_TIMEOUT          (0x1u <<  8) /**< \brief (US_LIN_CSR) Receiver Time-out */
#define   US_LIN_CSR_TIMEOUT_0      (0x0u <<  8) /**< \brief (US_LIN_CSR) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_LIN_CSR_TIMEOUT_1      (0x1u <<  8) /**< \brief (US_LIN_CSR) There has been a time-out since the last Start Time-out command */
#define US_LIN_CSR_TXEMPTY          (0x1u <<  9) /**< \brief (US_LIN_CSR) Transmitter Empty */
#define   US_LIN_CSR_TXEMPTY_0      (0x0u <<  9) /**< \brief (US_LIN_CSR) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_LIN_CSR_TXEMPTY_1      (0x1u <<  9) /**< \brief (US_LIN_CSR) There is at least one character in either THR or the Transmit Shift Register */
#define US_LIN_CSR_ITER             (0x1u << 10) /**< \brief (US_LIN_CSR) Max number of Repetitions Reached */
#define   US_LIN_CSR_ITER_0         (0x0u << 10) /**< \brief (US_LIN_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_LIN_CSR_ITER_1         (0x1u << 10) /**< \brief (US_LIN_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_LIN_CSR_TXBUFE           (0x1u << 11) /**< \brief (US_LIN_CSR) Transmission Buffer Empty */
#define   US_LIN_CSR_TXBUFE_0       (0x0u << 11) /**< \brief (US_LIN_CSR) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_LIN_CSR_TXBUFE_1       (0x1u << 11) /**< \brief (US_LIN_CSR) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_LIN_CSR_RXBUFF           (0x1u << 12) /**< \brief (US_LIN_CSR) Reception Buffer Full */
#define   US_LIN_CSR_RXBUFF_0       (0x0u << 12) /**< \brief (US_LIN_CSR) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_LIN_CSR_RXBUFF_1       (0x1u << 12) /**< \brief (US_LIN_CSR) The signal Buffer Full from the Receive PDC channel is active */
#define US_LIN_CSR_NACK             (0x1u << 13) /**< \brief (US_LIN_CSR) Non Acknowledge or LIN Break Sent or LIN Break Received */
#define   US_LIN_CSR_NACK_0         (0x0u << 13) /**< \brief (US_LIN_CSR) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_LIN_CSR_NACK_1         (0x1u << 13) /**< \brief (US_LIN_CSR) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_LIN_CSR_LINID            (0x1u << 14) /**< \brief (US_LIN_CSR) LIN Identifier Sent or LIN Identifier Received */
#define US_LIN_CSR_LINTC            (0x1u << 15) /**< \brief (US_LIN_CSR) LIN Transfer Conpleted */
#define US_LIN_CSR_RIIC             (0x1u << 16) /**< \brief (US_LIN_CSR) Ring Indicator Input Change Flag */
#define   US_LIN_CSR_RIIC_0         (0x0u << 16) /**< \brief (US_LIN_CSR) No input change has been detected on the RI pin since the last read of CSR */
#define   US_LIN_CSR_RIIC_1         (0x1u << 16) /**< \brief (US_LIN_CSR) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_LIN_CSR_DSRIC            (0x1u << 17) /**< \brief (US_LIN_CSR) Data Set Ready Input Change Flag */
#define   US_LIN_CSR_DSRIC_0        (0x0u << 17) /**< \brief (US_LIN_CSR) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_LIN_CSR_DSRIC_1        (0x1u << 17) /**< \brief (US_LIN_CSR) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_LIN_CSR_DCDIC            (0x1u << 18) /**< \brief (US_LIN_CSR) Data Carrier Detect Input Change Flag */
#define   US_LIN_CSR_DCDIC_0        (0x0u << 18) /**< \brief (US_LIN_CSR) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_LIN_CSR_DCDIC_1        (0x1u << 18) /**< \brief (US_LIN_CSR) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_LIN_CSR_CTSIC            (0x1u << 19) /**< \brief (US_LIN_CSR) Clear to Send Input Change Flag */
#define   US_LIN_CSR_CTSIC_0        (0x0u << 19) /**< \brief (US_LIN_CSR) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_LIN_CSR_CTSIC_1        (0x1u << 19) /**< \brief (US_LIN_CSR) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_LIN_CSR_RI               (0x1u << 20) /**< \brief (US_LIN_CSR) Image of RI Input */
#define   US_LIN_CSR_RI_0           (0x0u << 20) /**< \brief (US_LIN_CSR) RI is at 0 */
#define   US_LIN_CSR_RI_1           (0x1u << 20) /**< \brief (US_LIN_CSR) RI is at 1 */
#define US_LIN_CSR_DSR              (0x1u << 21) /**< \brief (US_LIN_CSR) Image of DSR Input */
#define   US_LIN_CSR_DSR_0          (0x0u << 21) /**< \brief (US_LIN_CSR) DSR is at 0 */
#define   US_LIN_CSR_DSR_1          (0x1u << 21) /**< \brief (US_LIN_CSR) DSR is at 1 */
#define US_LIN_CSR_DCD              (0x1u << 22) /**< \brief (US_LIN_CSR) Image of DCD Input */
#define   US_LIN_CSR_DCD_0          (0x0u << 22) /**< \brief (US_LIN_CSR) DCD is at 0 */
#define   US_LIN_CSR_DCD_1          (0x1u << 22) /**< \brief (US_LIN_CSR) DCD is at 1 */
#define US_LIN_CSR_LINBLS           (0x1u << 23) /**< \brief (US_LIN_CSR) LIN Bus Line Status */
#define   US_LIN_CSR_LINBLS_0       (0x0u << 23) /**< \brief (US_LIN_CSR) CTS is at 0 */
#define   US_LIN_CSR_LINBLS_1       (0x1u << 23) /**< \brief (US_LIN_CSR) CTS is at 1 */
#define US_LIN_CSR_LINBE            (0x1u << 25) /**< \brief (US_LIN_CSR) LIN Bit Error */
#define US_LIN_CSR_LINISFE          (0x1u << 26) /**< \brief (US_LIN_CSR) LIN Inconsistent Synch Field Error */
#define US_LIN_CSR_LINIPE           (0x1u << 27) /**< \brief (US_LIN_CSR) LIN Identifier Parity Error */
#define US_LIN_CSR_LINCE            (0x1u << 28) /**< \brief (US_LIN_CSR) LIN Checksum Error */
#define US_LIN_CSR_LINSNRE          (0x1u << 29) /**< \brief (US_LIN_CSR) LIN Slave Not Responding Error */
#define US_LIN_CSR_LINSTE           (0x1u << 30) /**< \brief (US_LIN_CSR) LIN Synch Tolerance Error */
#define   US_LIN_CSR_LINSTE_0       (0x0u << 30) /**< \brief (US_LIN_CSR) COMM_TX is at 0 */
#define   US_LIN_CSR_LINSTE_1       (0x1u << 30) /**< \brief (US_LIN_CSR) COMM_TX is at 1 */
#define US_LIN_CSR_LINHTE           (0x1u << 31) /**< \brief (US_LIN_CSR) LIN Header Timeout Error */
#define   US_LIN_CSR_LINHTE_0       (0x0u << 31) /**< \brief (US_LIN_CSR) COMM_RX is at 0 */
#define   US_LIN_CSR_LINHTE_1       (0x1u << 31) /**< \brief (US_LIN_CSR) COMM_RX is at 1 */
/* -------- US_SPI_SLAVE_CSR : (USART Offset: 0x14) Channel Status Register -------- */
#define US_SPI_SLAVE_CSR_RXRDY      (0x1u <<  0) /**< \brief (US_SPI_SLAVE_CSR) Receiver Ready */
#define   US_SPI_SLAVE_CSR_RXRDY_0  (0x0u <<  0) /**< \brief (US_SPI_SLAVE_CSR) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_SPI_SLAVE_CSR_RXRDY_1  (0x1u <<  0) /**< \brief (US_SPI_SLAVE_CSR) At least one complete character has been received and RHR has not yet been read */
#define US_SPI_SLAVE_CSR_TXRDY      (0x1u <<  1) /**< \brief (US_SPI_SLAVE_CSR) Transmitter Ready */
#define   US_SPI_SLAVE_CSR_TXRDY_0  (0x0u <<  1) /**< \brief (US_SPI_SLAVE_CSR) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_SPI_SLAVE_CSR_TXRDY_1  (0x1u <<  1) /**< \brief (US_SPI_SLAVE_CSR) There is no character in the THR */
#define US_SPI_SLAVE_CSR_RXBRK      (0x1u <<  2) /**< \brief (US_SPI_SLAVE_CSR) Break Received/End of Break */
#define   US_SPI_SLAVE_CSR_RXBRK_0  (0x0u <<  2) /**< \brief (US_SPI_SLAVE_CSR) No Break received or End of Break detected since the last RSTSTA */
#define   US_SPI_SLAVE_CSR_RXBRK_1  (0x1u <<  2) /**< \brief (US_SPI_SLAVE_CSR) Break Received or End of Break detected since the last RSTSTA */
#define US_SPI_SLAVE_CSR_ENDRX      (0x1u <<  3) /**< \brief (US_SPI_SLAVE_CSR) End of Receiver Transfer */
#define   US_SPI_SLAVE_CSR_ENDRX_0  (0x0u <<  3) /**< \brief (US_SPI_SLAVE_CSR) The End of Transfer signal from the Receive PDC channel is inactive */
#define   US_SPI_SLAVE_CSR_ENDRX_1  (0x1u <<  3) /**< \brief (US_SPI_SLAVE_CSR) The End of Transfer signal from the Receive PDC channel is active */
#define US_SPI_SLAVE_CSR_ENDTX      (0x1u <<  4) /**< \brief (US_SPI_SLAVE_CSR) End of Transmitter Transfer */
#define   US_SPI_SLAVE_CSR_ENDTX_0  (0x0u <<  4) /**< \brief (US_SPI_SLAVE_CSR) The End of Transfer signal from the Transmit PDC channel is inactive */
#define   US_SPI_SLAVE_CSR_ENDTX_1  (0x1u <<  4) /**< \brief (US_SPI_SLAVE_CSR) The End of Transfer signal from the Transmit PDC channel is active */
#define US_SPI_SLAVE_CSR_OVRE       (0x1u <<  5) /**< \brief (US_SPI_SLAVE_CSR) Overrun Error */
#define   US_SPI_SLAVE_CSR_OVRE_0   (0x0u <<  5) /**< \brief (US_SPI_SLAVE_CSR) No overrun error has occurred since since the last RSTSTA */
#define   US_SPI_SLAVE_CSR_OVRE_1   (0x1u <<  5) /**< \brief (US_SPI_SLAVE_CSR) At least one overrun error has occurred since the last RSTSTA */
#define US_SPI_SLAVE_CSR_FRAME      (0x1u <<  6) /**< \brief (US_SPI_SLAVE_CSR) Framing Error */
#define   US_SPI_SLAVE_CSR_FRAME_0  (0x0u <<  6) /**< \brief (US_SPI_SLAVE_CSR) No stop bit has been detected low since the last RSTSTA */
#define   US_SPI_SLAVE_CSR_FRAME_1  (0x1u <<  6) /**< \brief (US_SPI_SLAVE_CSR) At least one stop bit has been detected low since the last RSTSTA */
#define US_SPI_SLAVE_CSR_PARE       (0x1u <<  7) /**< \brief (US_SPI_SLAVE_CSR) Parity Error */
#define   US_SPI_SLAVE_CSR_PARE_0   (0x0u <<  7) /**< \brief (US_SPI_SLAVE_CSR) No parity error has been detected since the last RSTSTA */
#define   US_SPI_SLAVE_CSR_PARE_1   (0x1u <<  7) /**< \brief (US_SPI_SLAVE_CSR) At least one parity error has been detected since the last RSTSTA */
#define US_SPI_SLAVE_CSR_TIMEOUT    (0x1u <<  8) /**< \brief (US_SPI_SLAVE_CSR) Receiver Time-out */
#define   US_SPI_SLAVE_CSR_TIMEOUT_0 (0x0u <<  8) /**< \brief (US_SPI_SLAVE_CSR) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_SPI_SLAVE_CSR_TIMEOUT_1 (0x1u <<  8) /**< \brief (US_SPI_SLAVE_CSR) There has been a time-out since the last Start Time-out command */
#define US_SPI_SLAVE_CSR_TXEMPTY    (0x1u <<  9) /**< \brief (US_SPI_SLAVE_CSR) Transmitter Empty */
#define   US_SPI_SLAVE_CSR_TXEMPTY_0 (0x0u <<  9) /**< \brief (US_SPI_SLAVE_CSR) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_SPI_SLAVE_CSR_TXEMPTY_1 (0x1u <<  9) /**< \brief (US_SPI_SLAVE_CSR) There is at least one character in either THR or the Transmit Shift Register */
#define US_SPI_SLAVE_CSR_UNRE       (0x1u << 10) /**< \brief (US_SPI_SLAVE_CSR) SPI Underrun Error */
#define   US_SPI_SLAVE_CSR_UNRE_0   (0x0u << 10) /**< \brief (US_SPI_SLAVE_CSR) No SPI underrun error has occurred since the last RSTSTA */
#define   US_SPI_SLAVE_CSR_UNRE_1   (0x1u << 10) /**< \brief (US_SPI_SLAVE_CSR) At least one SPI underrun error has occurred since the last RSTSTA */
#define US_SPI_SLAVE_CSR_TXBUFE     (0x1u << 11) /**< \brief (US_SPI_SLAVE_CSR) Transmission Buffer Empty */
#define   US_SPI_SLAVE_CSR_TXBUFE_0 (0x0u << 11) /**< \brief (US_SPI_SLAVE_CSR) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_SPI_SLAVE_CSR_TXBUFE_1 (0x1u << 11) /**< \brief (US_SPI_SLAVE_CSR) The signal Buffer Empty from the Transmit PDC channel is active */
#define US_SPI_SLAVE_CSR_RXBUFF     (0x1u << 12) /**< \brief (US_SPI_SLAVE_CSR) Reception Buffer Full */
#define   US_SPI_SLAVE_CSR_RXBUFF_0 (0x0u << 12) /**< \brief (US_SPI_SLAVE_CSR) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_SPI_SLAVE_CSR_RXBUFF_1 (0x1u << 12) /**< \brief (US_SPI_SLAVE_CSR) The signal Buffer Full from the Receive PDC channel is active */
#define US_SPI_SLAVE_CSR_NACK       (0x1u << 13) /**< \brief (US_SPI_SLAVE_CSR) Non Acknowledge */
#define   US_SPI_SLAVE_CSR_NACK_0   (0x0u << 13) /**< \brief (US_SPI_SLAVE_CSR) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_SPI_SLAVE_CSR_NACK_1   (0x1u << 13) /**< \brief (US_SPI_SLAVE_CSR) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_SPI_SLAVE_CSR_RIIC       (0x1u << 16) /**< \brief (US_SPI_SLAVE_CSR) Ring Indicator Input Change Flag */
#define   US_SPI_SLAVE_CSR_RIIC_0   (0x0u << 16) /**< \brief (US_SPI_SLAVE_CSR) No input change has been detected on the RI pin since the last read of CSR */
#define   US_SPI_SLAVE_CSR_RIIC_1   (0x1u << 16) /**< \brief (US_SPI_SLAVE_CSR) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_SPI_SLAVE_CSR_DSRIC      (0x1u << 17) /**< \brief (US_SPI_SLAVE_CSR) Data Set Ready Input Change Flag */
#define   US_SPI_SLAVE_CSR_DSRIC_0  (0x0u << 17) /**< \brief (US_SPI_SLAVE_CSR) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_SPI_SLAVE_CSR_DSRIC_1  (0x1u << 17) /**< \brief (US_SPI_SLAVE_CSR) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_SPI_SLAVE_CSR_DCDIC      (0x1u << 18) /**< \brief (US_SPI_SLAVE_CSR) Data Carrier Detect Input Change Flag */
#define   US_SPI_SLAVE_CSR_DCDIC_0  (0x0u << 18) /**< \brief (US_SPI_SLAVE_CSR) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_SPI_SLAVE_CSR_DCDIC_1  (0x1u << 18) /**< \brief (US_SPI_SLAVE_CSR) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_SPI_SLAVE_CSR_CTSIC      (0x1u << 19) /**< \brief (US_SPI_SLAVE_CSR) Clear to Send Input Change Flag */
#define   US_SPI_SLAVE_CSR_CTSIC_0  (0x0u << 19) /**< \brief (US_SPI_SLAVE_CSR) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_SPI_SLAVE_CSR_CTSIC_1  (0x1u << 19) /**< \brief (US_SPI_SLAVE_CSR) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_SPI_SLAVE_CSR_RI         (0x1u << 20) /**< \brief (US_SPI_SLAVE_CSR) Image of RI Input */
#define   US_SPI_SLAVE_CSR_RI_0     (0x0u << 20) /**< \brief (US_SPI_SLAVE_CSR) RI is at 0 */
#define   US_SPI_SLAVE_CSR_RI_1     (0x1u << 20) /**< \brief (US_SPI_SLAVE_CSR) RI is at 1 */
#define US_SPI_SLAVE_CSR_DSR        (0x1u << 21) /**< \brief (US_SPI_SLAVE_CSR) Image of DSR Input */
#define   US_SPI_SLAVE_CSR_DSR_0    (0x0u << 21) /**< \brief (US_SPI_SLAVE_CSR) DSR is at 0 */
#define   US_SPI_SLAVE_CSR_DSR_1    (0x1u << 21) /**< \brief (US_SPI_SLAVE_CSR) DSR is at 1 */
#define US_SPI_SLAVE_CSR_DCD        (0x1u << 22) /**< \brief (US_SPI_SLAVE_CSR) Image of DCD Input */
#define   US_SPI_SLAVE_CSR_DCD_0    (0x0u << 22) /**< \brief (US_SPI_SLAVE_CSR) DCD is at 0 */
#define   US_SPI_SLAVE_CSR_DCD_1    (0x1u << 22) /**< \brief (US_SPI_SLAVE_CSR) DCD is at 1 */
#define US_SPI_SLAVE_CSR_CTS        (0x1u << 23) /**< \brief (US_SPI_SLAVE_CSR) Image of CTS Input */
#define   US_SPI_SLAVE_CSR_CTS_0    (0x0u << 23) /**< \brief (US_SPI_SLAVE_CSR) CTS is at 0 */
#define   US_SPI_SLAVE_CSR_CTS_1    (0x1u << 23) /**< \brief (US_SPI_SLAVE_CSR) CTS is at 1 */
/* -------- US_USART_CSR : (USART Offset: 0x14) Channel Status Register -------- */
#define US_USART_CSR_RXRDY          (0x1u <<  0) /**< \brief (US_USART_CSR) Receiver Ready */
#define   US_USART_CSR_RXRDY_0      (0x0u <<  0) /**< \brief (US_USART_CSR) No complete character has been received since the last read of RHR or the receiver is disabled. If characters werebeing received when the receiver was disabled, RXRDY changes to 1 when the receiver is enabled */
#define   US_USART_CSR_RXRDY_1      (0x1u <<  0) /**< \brief (US_USART_CSR) At least one complete character has been received and RHR has not yet been read */
#define US_USART_CSR_TXRDY          (0x1u <<  1) /**< \brief (US_USART_CSR) Transmitter Ready */
#define   US_USART_CSR_TXRDY_0      (0x0u <<  1) /**< \brief (US_USART_CSR) A character is in the THR waiting to be transferred to the Transmit Shift Register, or an STTBRK command has been requested, or the transmitter is disabled. As soon as the transmitter is enabled, TXRDY becomes 1 */
#define   US_USART_CSR_TXRDY_1      (0x1u <<  1) /**< \brief (US_USART_CSR) There is no character in the THR */
#define US_USART_CSR_RXBRK          (0x1u <<  2) /**< \brief (US_USART_CSR) Break Received/End of Break */
#define   US_USART_CSR_RXBRK_0      (0x0u <<  2) /**< \brief (US_USART_CSR) No Break received or End of Break detected since the last RSTSTA */
#define   US_USART_CSR_RXBRK_1      (0x1u <<  2) /**< \brief (US_USART_CSR) Break Received or End of Break detected since the last RSTSTA */
#define US_USART_CSR_ENDRX          (0x1u <<  3) /**< \brief (US_USART_CSR) End of Receiver Transfer */
#define   US_USART_CSR_ENDRX_0      (0x0u <<  3) /**< \brief (US_USART_CSR) The End of Transfer signal from the Receive PDC channel is inactive */
#define   US_USART_CSR_ENDRX_1      (0x1u <<  3) /**< \brief (US_USART_CSR) The End of Transfer signal from the Receive PDC channel is active */
#define US_USART_CSR_ENDTX          (0x1u <<  4) /**< \brief (US_USART_CSR) End of Transmitter Transfer */
#define   US_USART_CSR_ENDTX_0      (0x0u <<  4) /**< \brief (US_USART_CSR) The End of Transfer signal from the Transmit PDC channel is inactive */
#define   US_USART_CSR_ENDTX_1      (0x1u <<  4) /**< \brief (US_USART_CSR) The End of Transfer signal from the Transmit PDC channel is active */
#define US_USART_CSR_OVRE           (0x1u <<  5) /**< \brief (US_USART_CSR) Overrun Error */
#define   US_USART_CSR_OVRE_0       (0x0u <<  5) /**< \brief (US_USART_CSR) No overrun error has occurred since since the last RSTSTA */
#define   US_USART_CSR_OVRE_1       (0x1u <<  5) /**< \brief (US_USART_CSR) At least one overrun error has occurred since the last RSTSTA */
#define US_USART_CSR_FRAME          (0x1u <<  6) /**< \brief (US_USART_CSR) Framing Error */
#define   US_USART_CSR_FRAME_0      (0x0u <<  6) /**< \brief (US_USART_CSR) No stop bit has been detected low since the last RSTSTA */
#define   US_USART_CSR_FRAME_1      (0x1u <<  6) /**< \brief (US_USART_CSR) At least one stop bit has been detected low since the last RSTSTA */
#define US_USART_CSR_PARE           (0x1u <<  7) /**< \brief (US_USART_CSR) Parity Error */
#define   US_USART_CSR_PARE_0       (0x0u <<  7) /**< \brief (US_USART_CSR) No parity error has been detected since the last RSTSTA */
#define   US_USART_CSR_PARE_1       (0x1u <<  7) /**< \brief (US_USART_CSR) At least one parity error has been detected since the last RSTSTA */
#define US_USART_CSR_TIMEOUT        (0x1u <<  8) /**< \brief (US_USART_CSR) Receiver Time-out */
#define   US_USART_CSR_TIMEOUT_0    (0x0u <<  8) /**< \brief (US_USART_CSR) There has not been a time-out since the last Start Time-out command or the Time-out Register is 0 */
#define   US_USART_CSR_TIMEOUT_1    (0x1u <<  8) /**< \brief (US_USART_CSR) There has been a time-out since the last Start Time-out command */
#define US_USART_CSR_TXEMPTY        (0x1u <<  9) /**< \brief (US_USART_CSR) Transmitter Empty */
#define   US_USART_CSR_TXEMPTY_0    (0x0u <<  9) /**< \brief (US_USART_CSR) There are characters in either THR or the Transmit Shift Register, or the transmitter is disabled */
#define   US_USART_CSR_TXEMPTY_1    (0x1u <<  9) /**< \brief (US_USART_CSR) There is at least one character in either THR or the Transmit Shift Register */
#define US_USART_CSR_ITER           (0x1u << 10) /**< \brief (US_USART_CSR) Max number of Repetitions Reached */
#define   US_USART_CSR_ITER_0       (0x0u << 10) /**< \brief (US_USART_CSR) Maximum number of repetitions has not been reached since the last RSIT */
#define   US_USART_CSR_ITER_1       (0x1u << 10) /**< \brief (US_USART_CSR) Maximum number of repetitions has been reached since the last RSIT */
#define US_USART_CSR_TXBUFE         (0x1u << 11) /**< \brief (US_USART_CSR) Transmission Buffer Empty */
#define   US_USART_CSR_TXBUFE_0     (0x0u << 11) /**< \brief (US_USART_CSR) The signal Buffer Empty from the Transmit PDC channel is inactive */
#define   US_USART_CSR_TXBUFE_1     (0x1u << 11) /**< \brief (US_USART_CSR) The signal Buffer Empty from the Transmit PDC channel is active */
