Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define US_USART_CSR_RXBUFF         (0x1u << 12) /**< \brief (US_USART_CSR) Reception Buffer Full */
#define   US_USART_CSR_RXBUFF_0     (0x0u << 12) /**< \brief (US_USART_CSR) The signal Buffer Full from the Receive PDC channel is inactive */
#define   US_USART_CSR_RXBUFF_1     (0x1u << 12) /**< \brief (US_USART_CSR) The signal Buffer Full from the Receive PDC channel is active */
#define US_USART_CSR_NACK           (0x1u << 13) /**< \brief (US_USART_CSR) Non Acknowledge */
#define   US_USART_CSR_NACK_0       (0x0u << 13) /**< \brief (US_USART_CSR) No Non Acknowledge has not been detected since the last RSTNACK */
#define   US_USART_CSR_NACK_1       (0x1u << 13) /**< \brief (US_USART_CSR) At least one Non Acknowledge has been detected since the last RSTNACK */
#define US_USART_CSR_RIIC           (0x1u << 16) /**< \brief (US_USART_CSR) Ring Indicator Input Change Flag */
#define   US_USART_CSR_RIIC_0       (0x0u << 16) /**< \brief (US_USART_CSR) No input change has been detected on the RI pin since the last read of CSR */
#define   US_USART_CSR_RIIC_1       (0x1u << 16) /**< \brief (US_USART_CSR) At least one input change has been detected on the RI pin since the last read of CSR */
#define US_USART_CSR_DSRIC          (0x1u << 17) /**< \brief (US_USART_CSR) Data Set Ready Input Change Flag */
#define   US_USART_CSR_DSRIC_0      (0x0u << 17) /**< \brief (US_USART_CSR) No input change has been detected on the DSR pin since the last read of CSR */
#define   US_USART_CSR_DSRIC_1      (0x1u << 17) /**< \brief (US_USART_CSR) At least one input change has been detected on the DSR pin since the last read of CSR */
#define US_USART_CSR_DCDIC          (0x1u << 18) /**< \brief (US_USART_CSR) Data Carrier Detect Input Change Flag */
#define   US_USART_CSR_DCDIC_0      (0x0u << 18) /**< \brief (US_USART_CSR) No input change has been detected on the DCD pin since the last read of CSR */
#define   US_USART_CSR_DCDIC_1      (0x1u << 18) /**< \brief (US_USART_CSR) At least one input change has been detected on the DCD pin since the last read of CSR */
#define US_USART_CSR_CTSIC          (0x1u << 19) /**< \brief (US_USART_CSR) Clear to Send Input Change Flag */
#define   US_USART_CSR_CTSIC_0      (0x0u << 19) /**< \brief (US_USART_CSR) No input change has been detected on the CTS pin since the last read of CSR */
#define   US_USART_CSR_CTSIC_1      (0x1u << 19) /**< \brief (US_USART_CSR) At least one input change has been detected on the CTS pin since the last read of CSR */
#define US_USART_CSR_RI             (0x1u << 20) /**< \brief (US_USART_CSR) Image of RI Input */
#define   US_USART_CSR_RI_0         (0x0u << 20) /**< \brief (US_USART_CSR) RI is at 0 */
#define   US_USART_CSR_RI_1         (0x1u << 20) /**< \brief (US_USART_CSR) RI is at 1 */
#define US_USART_CSR_DSR            (0x1u << 21) /**< \brief (US_USART_CSR) Image of DSR Input */
#define   US_USART_CSR_DSR_0        (0x0u << 21) /**< \brief (US_USART_CSR) DSR is at 0 */
#define   US_USART_CSR_DSR_1        (0x1u << 21) /**< \brief (US_USART_CSR) DSR is at 1 */
#define US_USART_CSR_DCD            (0x1u << 22) /**< \brief (US_USART_CSR) Image of DCD Input */
#define   US_USART_CSR_DCD_0        (0x0u << 22) /**< \brief (US_USART_CSR) DCD is at 0 */
#define   US_USART_CSR_DCD_1        (0x1u << 22) /**< \brief (US_USART_CSR) DCD is at 1 */
#define US_USART_CSR_CTS            (0x1u << 23) /**< \brief (US_USART_CSR) Image of CTS Input */
#define   US_USART_CSR_CTS_0        (0x0u << 23) /**< \brief (US_USART_CSR) CTS is at 0 */
#define   US_USART_CSR_CTS_1        (0x1u << 23) /**< \brief (US_USART_CSR) CTS is at 1 */
#define US_USART_CSR_MANERR         (0x1u << 24) /**< \brief (US_USART_CSR) Manchester Error */
#define   US_USART_CSR_MANERR_0     (0x0u << 24) /**< \brief (US_USART_CSR) No Manchester error has been detected since the last RSTSTA */
#define   US_USART_CSR_MANERR_1     (0x1u << 24) /**< \brief (US_USART_CSR) At least one Manchester error has been detected since the last RSTSTA */
/* -------- US_RHR : (USART Offset: 0x18) Receiver Holding Register -------- */
#define US_RHR_RXCHR_Pos            0
#define US_RHR_RXCHR_Msk            (0x1FFu << US_RHR_RXCHR_Pos) /**< \brief (US_RHR) Received Character */
#define US_RHR_RXCHR(value)         ((US_RHR_RXCHR_Msk & ((value) << US_RHR_RXCHR_Pos)))
#define US_RHR_RXSYNH               (0x1u << 15) /**< \brief (US_RHR) Received Sync */
#define   US_RHR_RXSYNH_0           (0x0u << 15) /**< \brief (US_RHR) Last character received is a Data */
#define   US_RHR_RXSYNH_1           (0x1u << 15) /**< \brief (US_RHR) Last character received is a Command */
/* -------- US_THR : (USART Offset: 0x1C) Transmitter Holding Register -------- */
#define US_THR_TXCHR_Pos            0
#define US_THR_TXCHR_Msk            (0x1FFu << US_THR_TXCHR_Pos) /**< \brief (US_THR) Character to be Transmitted */
#define US_THR_TXCHR(value)         ((US_THR_TXCHR_Msk & ((value) << US_THR_TXCHR_Pos)))
#define US_THR_TXSYNH               (0x1u << 15) /**< \brief (US_THR) Sync Field to be transmitted */
#define   US_THR_TXSYNH_0           (0x0u << 15) /**< \brief (US_THR) The next character sent is encoded as a data. Start Frame Delimiter is DATA SYNC */
#define   US_THR_TXSYNH_1           (0x1u << 15) /**< \brief (US_THR) The next character sent is encoded as a command. Start Frame Delimiter is COMMAND SYNC */
/* -------- US_BRGR : (USART Offset: 0x20) Baud Rate Generator Register -------- */
#define US_BRGR_CD_Pos              0
#define US_BRGR_CD_Msk              (0xFFFFu << US_BRGR_CD_Pos) /**< \brief (US_BRGR) Clock Divisor */
#define US_BRGR_CD(value)           ((US_BRGR_CD_Msk & ((value) << US_BRGR_CD_Pos)))
#define   US_BRGR_CD_DISABLE        (0x0u <<  0) /**< \brief (US_BRGR) Disables the clock */
#define   US_BRGR_CD_BYPASS         (0x1u <<  0) /**< \brief (US_BRGR) Clock Divisor Bypass */
#define   US_BRGR_CD_2              (0x2u <<  0) /**< \brief (US_BRGR) Baud Rate (Asynchronous Mode) = Selected Clock/(16 x CD) or (8 x CD); Baud Rate (Synchronous Mode) = Selected Clock/CD; */
#define US_BRGR_FP_Pos              16
#define US_BRGR_FP_Msk              (0x7u << US_BRGR_FP_Pos) /**< \brief (US_BRGR) Fractional Part */
#define US_BRGR_FP(value)           ((US_BRGR_FP_Msk & ((value) << US_BRGR_FP_Pos)))
#define   US_BRGR_FP_0              (0x0u << 16) /**< \brief (US_BRGR) Fractional divider is disabled */
/* -------- US_RTOR : (USART Offset: 0x24) Receiver Time-out Register -------- */
#define US_RTOR_TO_Pos              0
#define US_RTOR_TO_Msk              (0x1FFFFu << US_RTOR_TO_Pos) /**< \brief (US_RTOR) Time-out Value */
#define US_RTOR_TO(value)           ((US_RTOR_TO_Msk & ((value) << US_RTOR_TO_Pos)))
#define   US_RTOR_TO_DISABLE        (0x0u <<  0) /**< \brief (US_RTOR) Disables the RX Time-out function */
/* -------- US_TTGR : (USART Offset: 0x28) Transmitter Timeguard Register -------- */
#define US_TTGR_TG_Pos              0
#define US_TTGR_TG_Msk              (0xFFu << US_TTGR_TG_Pos) /**< \brief (US_TTGR) Timeguard Value */
#define US_TTGR_TG(value)           ((US_TTGR_TG_Msk & ((value) << US_TTGR_TG_Pos)))
#define   US_TTGR_TG_DISABLE        (0x0u <<  0) /**< \brief (US_TTGR) Disables the TX Timeguard function. */
/* -------- US_FIDI : (USART Offset: 0x40) FI DI Ratio Register -------- */
#define US_FIDI_FI_DI_RATIO_Pos     0
#define US_FIDI_FI_DI_RATIO_Msk     (0x7FFu << US_FIDI_FI_DI_RATIO_Pos) /**< \brief (US_FIDI) FI Over DI Ratio Value */
#define US_FIDI_FI_DI_RATIO(value)  ((US_FIDI_FI_DI_RATIO_Msk & ((value) << US_FIDI_FI_DI_RATIO_Pos)))
#define   US_FIDI_FI_DI_RATIO_DISABLE (0x0u <<  0) /**< \brief (US_FIDI) Baud Rate = 0 */
/* -------- US_NER : (USART Offset: 0x44) Number of Errors Register -------- */
#define US_NER_NB_ERRORS_Pos        0
#define US_NER_NB_ERRORS_Msk        (0xFFu << US_NER_NB_ERRORS_Pos) /**< \brief (US_NER) Error number during ISO7816 transfers */
#define US_NER_NB_ERRORS(value)     ((US_NER_NB_ERRORS_Msk & ((value) << US_NER_NB_ERRORS_Pos)))
/* -------- US_IFR : (USART Offset: 0x4C) IrDA Filter Register -------- */
#define US_IFR_IRDA_FILTER_Pos      0
#define US_IFR_IRDA_FILTER_Msk      (0xFFu << US_IFR_IRDA_FILTER_Pos) /**< \brief (US_IFR) Irda filter */
#define US_IFR_IRDA_FILTER(value)   ((US_IFR_IRDA_FILTER_Msk & ((value) << US_IFR_IRDA_FILTER_Pos)))
/* -------- US_MAN : (USART Offset: 0x50) Manchester Configuration Register -------- */
#define US_MAN_TX_PL_Pos            0
#define US_MAN_TX_PL_Msk            (0xFu << US_MAN_TX_PL_Pos) /**< \brief (US_MAN) Transmitter Preamble Length */
#define US_MAN_TX_PL(value)         ((US_MAN_TX_PL_Msk & ((value) << US_MAN_TX_PL_Pos)))
#define   US_MAN_TX_PL_0            (0x0u <<  0) /**< \brief (US_MAN) The Transmitter Preamble pattern generation is disabled */
#define US_MAN_TX_PP_Pos            8
#define US_MAN_TX_PP_Msk            (0x3u << US_MAN_TX_PP_Pos) /**< \brief (US_MAN) Transmitter Preamble Pattern */
#define US_MAN_TX_PP(value)         ((US_MAN_TX_PP_Msk & ((value) << US_MAN_TX_PP_Pos)))
#define   US_MAN_TX_PP_0            (0x0u <<  8) /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_TX_PP_1            (0x1u <<  8) /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_TX_PP_2            (0x2u <<  8) /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_TX_PP_3            (0x3u <<  8) /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_TX_MPOL              (0x1u << 12) /**< \brief (US_MAN) Transmitter Manchester Polarity */
#define   US_MAN_TX_MPOL_0          (0x0u << 12) /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_TX_MPOL_1          (0x1u << 12) /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_RX_PL_Pos            16
#define US_MAN_RX_PL_Msk            (0xFu << US_MAN_RX_PL_Pos) /**< \brief (US_MAN) Receiver Preamble Length */
#define US_MAN_RX_PL(value)         ((US_MAN_RX_PL_Msk & ((value) << US_MAN_RX_PL_Pos)))
#define   US_MAN_RX_PL_0            (0x0u << 16) /**< \brief (US_MAN) The receiver preamble pattern detection is disabled */
#define US_MAN_RX_PP_Pos            24
#define US_MAN_RX_PP_Msk            (0x3u << US_MAN_RX_PP_Pos) /**< \brief (US_MAN) Receiver Preamble Pattern detected */
#define US_MAN_RX_PP(value)         ((US_MAN_RX_PP_Msk & ((value) << US_MAN_RX_PP_Pos)))
#define   US_MAN_RX_PP_0            (0x0u << 24) /**< \brief (US_MAN) ALL_ONE */
#define   US_MAN_RX_PP_1            (0x1u << 24) /**< \brief (US_MAN) ALL_ZERO */
#define   US_MAN_RX_PP_2            (0x2u << 24) /**< \brief (US_MAN) ZERO_ONE */
#define   US_MAN_RX_PP_3            (0x3u << 24) /**< \brief (US_MAN) ONE_ZERO */
#define US_MAN_RX_MPOL              (0x1u << 28) /**< \brief (US_MAN) Receiver Manchester Polarity */
#define   US_MAN_RX_MPOL_0          (0x0u << 28) /**< \brief (US_MAN) Logic Zero is coded as a zero-to-one transition, Logic One is coded as a one-to-zero transition */
#define   US_MAN_RX_MPOL_1          (0x1u << 28) /**< \brief (US_MAN) Logic Zero is coded as a one-to-zero transition, Logic One is coded as a zero-to-one transition */
#define US_MAN_DRIFT                (0x1u << 30) /**< \brief (US_MAN) Drift compensation */
#define   US_MAN_DRIFT_0            (0x0u << 30) /**< \brief (US_MAN) The USART can not recover from an important clock drift */
#define   US_MAN_DRIFT_1            (0x1u << 30) /**< \brief (US_MAN) The USART can recover from clock drift. The 16X clock mode must be enabled */
/* -------- US_LINMR : (USART Offset: 0x54) LIN Mode Register -------- */
#define US_LINMR_NACT_Pos           0
#define US_LINMR_NACT_Msk           (0x3u << US_LINMR_NACT_Pos) /**< \brief (US_LINMR) LIN Node Action */
#define US_LINMR_NACT(value)        ((US_LINMR_NACT_Msk & ((value) << US_LINMR_NACT_Pos)))
#define   US_LINMR_NACT_PUBLISH     (0x0u <<  0) /**< \brief (US_LINMR) The LIN Controller transmits the response */
#define   US_LINMR_NACT_SUBSCRIBE   (0x1u <<  0) /**< \brief (US_LINMR) The LIN Controller receives the response */
#define   US_LINMR_NACT_IGNORE      (0x2u <<  0) /**< \brief (US_LINMR) The LIN Controller doesn't transmit and doesn't receive the response */
#define US_LINMR_PARDIS             (0x1u <<  2) /**< \brief (US_LINMR) Parity Disable */
#define US_LINMR_CHKDIS             (0x1u <<  3) /**< \brief (US_LINMR) Checksum Disable */
#define US_LINMR_CHKTYP             (0x1u <<  4) /**< \brief (US_LINMR) Checksum Type */
#define US_LINMR_DLM                (0x1u <<  5) /**< \brief (US_LINMR) Data Length Mode */
#define US_LINMR_FSDIS              (0x1u <<  6) /**< \brief (US_LINMR) Frame Slot Mode Disable */
#define US_LINMR_WKUPTYP            (0x1u <<  7) /**< \brief (US_LINMR) Wakeup Signal Type */
#define US_LINMR_DLC_Pos            8
#define US_LINMR_DLC_Msk            (0xFFu << US_LINMR_DLC_Pos) /**< \brief (US_LINMR) Data Length Control */
#define US_LINMR_DLC(value)         ((US_LINMR_DLC_Msk & ((value) << US_LINMR_DLC_Pos)))
#define US_LINMR_PDCM               (0x1u << 16) /**< \brief (US_LINMR) PDC Mode */
#define US_LINMR_SYNCDIS            (0x1u << 17) /**< \brief (US_LINMR) Synchronization Disable */
/* -------- US_LINIR : (USART Offset: 0x58) LIN Identifier Register -------- */
#define US_LINIR_IDCHR_Pos          0
#define US_LINIR_IDCHR_Msk          (0xFFu << US_LINIR_IDCHR_Pos) /**< \brief (US_LINIR) Identifier Character */
#define US_LINIR_IDCHR(value)       ((US_LINIR_IDCHR_Msk & ((value) << US_LINIR_IDCHR_Pos)))
/* -------- US_LINBRR : (USART Offset: 0x5C) LIN Baud Rate Register -------- */
#define US_LINBRR_LINCD_Pos         0
#define US_LINBRR_LINCD_Msk         (0xFFFFu << US_LINBRR_LINCD_Pos) /**< \brief (US_LINBRR) Clock Divider after Synchronization */
#define US_LINBRR_LINCD(value)      ((US_LINBRR_LINCD_Msk & ((value) << US_LINBRR_LINCD_Pos)))
#define US_LINBRR_LINFP_Pos         16
#define US_LINBRR_LINFP_Msk         (0x7u << US_LINBRR_LINFP_Pos) /**< \brief (US_LINBRR) Fractional Part after Synchronization */
#define US_LINBRR_LINFP(value)      ((US_LINBRR_LINFP_Msk & ((value) << US_LINBRR_LINFP_Pos)))
/* -------- US_WPMR : (USART Offset: 0xE4) Write Protect Mode Register -------- */
#define US_WPMR_WPEN                (0x1u <<  0) /**< \brief (US_WPMR) Write Protect Enable */
#define   US_WPMR_WPEN_0            (0x0u <<  0) /**< \brief (US_WPMR) Disables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define   US_WPMR_WPEN_1            (0x1u <<  0) /**< \brief (US_WPMR) Enables the Write Protect if WPKEY corresponds to 0x858365 ("USA" in ACII) */
#define US_WPMR_WPKEY_Pos           8
#define US_WPMR_WPKEY_Msk           (0xFFFFFFu << US_WPMR_WPKEY_Pos) /**< \brief (US_WPMR) Write Protect Key */
#define US_WPMR_WPKEY(value)        ((US_WPMR_WPKEY_Msk & ((value) << US_WPMR_WPKEY_Pos)))
/* -------- US_WPSR : (USART Offset: 0xE8) Write Protect Status Register -------- */
#define US_WPSR_WPV                 (0x1u <<  0) /**< \brief (US_WPSR) Write Protect Violation Status */
#define   US_WPSR_WPV_0             (0x0u <<  0) /**< \brief (US_WPSR) No Write Protect Violation has occurred since the last read of the WPSR register */
#define   US_WPSR_WPV_1             (0x1u <<  0) /**< \brief (US_WPSR) A Write Protect Violation has occurred since the last read of the WPSR register. If this violation is an unauthorized attempt to write a protected register, the associated violation is reported into field WPVSRC */
#define US_WPSR_WPVSRC_Pos          8
#define US_WPSR_WPVSRC_Msk          (0xFFFFu << US_WPSR_WPVSRC_Pos) /**< \brief (US_WPSR) Write Protect Violation Source */
#define US_WPSR_WPVSRC(value)       ((US_WPSR_WPVSRC_Msk & ((value) << US_WPSR_WPVSRC_Pos)))
/* -------- US_VERSION : (USART Offset: 0xFC) Version Register -------- */
#define US_VERSION_VERSION_Pos      0
#define US_VERSION_VERSION_Msk      (0xFFFu << US_VERSION_VERSION_Pos) /**< \brief (US_VERSION)  */
#define US_VERSION_VERSION(value)   ((US_VERSION_VERSION_Msk & ((value) << US_VERSION_VERSION_Pos)))
#define US_VERSION_MFN_Pos          16
#define US_VERSION_MFN_Msk          (0xFu << US_VERSION_MFN_Pos) /**< \brief (US_VERSION)  */
#define US_VERSION_MFN(value)       ((US_VERSION_MFN_Msk & ((value) << US_VERSION_MFN_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR USBC */
/* ============================================================================= */
/** \addtogroup SAM4L4_USBC USB 2.0 Interface */
/*@{*/

