Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REV_USBC       0x310

#ifndef __ASSEMBLY__
/** \brief USBC hardware registers */
typedef struct {
  RwReg   UDCON;       /**< \brief (USBC Offset: 0x000) Device General Control Register */
  RoReg   UDINT;       /**< \brief (USBC Offset: 0x004) Device Global Interupt Register */
  WoReg   UDINTCLR;    /**< \brief (USBC Offset: 0x008) Device Global Interrupt Clear Register */
  WoReg   UDINTSET;    /**< \brief (USBC Offset: 0x00C) Device Global Interrupt Set Regsiter */
  RoReg   UDINTE;      /**< \brief (USBC Offset: 0x010) Device Global Interrupt Enable Register */
  WoReg   UDINTECLR;   /**< \brief (USBC Offset: 0x014) Device Global Interrupt Enable Clear Register */
  WoReg   UDINTESET;   /**< \brief (USBC Offset: 0x018) Device Global Interrupt Enable Set Register */
  RwReg   UERST;       /**< \brief (USBC Offset: 0x01C) Endpoint Enable/Reset Register */
  RoReg   UDFNUM;      /**< \brief (USBC Offset: 0x020) Device Frame Number Register */
  RoReg   Reserved1[55];
  RwReg   UECFG0;      /**< \brief (USBC Offset: 0x100) Endpoint Configuration Register */
  RwReg   UECFG1;      /**< \brief (USBC Offset: 0x104) Endpoint Configuration Register */
  RwReg   UECFG2;      /**< \brief (USBC Offset: 0x108) Endpoint Configuration Register */
  RwReg   UECFG3;      /**< \brief (USBC Offset: 0x10C) Endpoint Configuration Register */
  RwReg   UECFG4;      /**< \brief (USBC Offset: 0x110) Endpoint Configuration Register */
  RwReg   UECFG5;      /**< \brief (USBC Offset: 0x114) Endpoint Configuration Register */
  RwReg   UECFG6;      /**< \brief (USBC Offset: 0x118) Endpoint Configuration Register */
  RwReg   UECFG7;      /**< \brief (USBC Offset: 0x11C) Endpoint Configuration Register */
  RoReg   Reserved2[4];
  RoReg   UESTA0;      /**< \brief (USBC Offset: 0x130) Endpoint Status Register */
  RoReg   UESTA1;      /**< \brief (USBC Offset: 0x134) Endpoint Status Register */
  RoReg   UESTA2;      /**< \brief (USBC Offset: 0x138) Endpoint Status Register */
  RoReg   UESTA3;      /**< \brief (USBC Offset: 0x13C) Endpoint Status Register */
  RoReg   UESTA4;      /**< \brief (USBC Offset: 0x140) Endpoint Status Register */
  RoReg   UESTA5;      /**< \brief (USBC Offset: 0x144) Endpoint Status Register */
  RoReg   UESTA6;      /**< \brief (USBC Offset: 0x148) Endpoint Status Register */
  RoReg   UESTA7;      /**< \brief (USBC Offset: 0x14C) Endpoint Status Register */
  RoReg   Reserved3[4];
  WoReg   UESTA0CLR;   /**< \brief (USBC Offset: 0x160) Endpoint Status Clear Register */
  WoReg   UESTA1CLR;   /**< \brief (USBC Offset: 0x164) Endpoint Status Clear Register */
  WoReg   UESTA2CLR;   /**< \brief (USBC Offset: 0x168) Endpoint Status Clear Register */
  WoReg   UESTA3CLR;   /**< \brief (USBC Offset: 0x16C) Endpoint Status Clear Register */
  WoReg   UESTA4CLR;   /**< \brief (USBC Offset: 0x170) Endpoint Status Clear Register */
  WoReg   UESTA5CLR;   /**< \brief (USBC Offset: 0x174) Endpoint Status Clear Register */
  WoReg   UESTA6CLR;   /**< \brief (USBC Offset: 0x178) Endpoint Status Clear Register */
  WoReg   UESTA7CLR;   /**< \brief (USBC Offset: 0x17C) Endpoint Status Clear Register */
  RoReg   Reserved4[4];
  WoReg   UESTA0SET;   /**< \brief (USBC Offset: 0x190) Endpoint Status Set Register */
  WoReg   UESTA1SET;   /**< \brief (USBC Offset: 0x194) Endpoint Status Set Register */
  WoReg   UESTA2SET;   /**< \brief (USBC Offset: 0x198) Endpoint Status Set Register */
  WoReg   UESTA3SET;   /**< \brief (USBC Offset: 0x19C) Endpoint Status Set Register */
  WoReg   UESTA4SET;   /**< \brief (USBC Offset: 0x1A0) Endpoint Status Set Register */
  WoReg   UESTA5SET;   /**< \brief (USBC Offset: 0x1A4) Endpoint Status Set Register */
  WoReg   UESTA6SET;   /**< \brief (USBC Offset: 0x1A8) Endpoint Status Set Register */
  WoReg   UESTA7SET;   /**< \brief (USBC Offset: 0x1AC) Endpoint Status Set Register */
  RoReg   Reserved5[4];
  RoReg   UECON0;      /**< \brief (USBC Offset: 0x1C0) Endpoint Control Register */
  RoReg   UECON1;      /**< \brief (USBC Offset: 0x1C4) Endpoint Control Register */
  RoReg   UECON2;      /**< \brief (USBC Offset: 0x1C8) Endpoint Control Register */
  RoReg   UECON3;      /**< \brief (USBC Offset: 0x1CC) Endpoint Control Register */
  RoReg   UECON4;      /**< \brief (USBC Offset: 0x1D0) Endpoint Control Register */
  RoReg   UECON5;      /**< \brief (USBC Offset: 0x1D4) Endpoint Control Register */
  RoReg   UECON6;      /**< \brief (USBC Offset: 0x1D8) Endpoint Control Register */
  RoReg   UECON7;      /**< \brief (USBC Offset: 0x1DC) Endpoint Control Register */
  RoReg   Reserved6[4];
  WoReg   UECON0SET;   /**< \brief (USBC Offset: 0x1F0) Endpoint Control Set Register */
  WoReg   UECON1SET;   /**< \brief (USBC Offset: 0x1F4) Endpoint Control Set Register */
  WoReg   UECON2SET;   /**< \brief (USBC Offset: 0x1F8) Endpoint Control Set Register */
  WoReg   UECON3SET;   /**< \brief (USBC Offset: 0x1FC) Endpoint Control Set Register */
  WoReg   UECON4SET;   /**< \brief (USBC Offset: 0x200) Endpoint Control Set Register */
  WoReg   UECON5SET;   /**< \brief (USBC Offset: 0x204) Endpoint Control Set Register */
  WoReg   UECON6SET;   /**< \brief (USBC Offset: 0x208) Endpoint Control Set Register */
  WoReg   UECON7SET;   /**< \brief (USBC Offset: 0x20C) Endpoint Control Set Register */
  RoReg   Reserved7[4];
  WoReg   UECON0CLR;   /**< \brief (USBC Offset: 0x220) Endpoint Control Clear Register */
  WoReg   UECON1CLR;   /**< \brief (USBC Offset: 0x224) TXINE Clear */
  WoReg   UECON2CLR;   /**< \brief (USBC Offset: 0x228) TXINE Clear */
  WoReg   UECON3CLR;   /**< \brief (USBC Offset: 0x22C) TXINE Clear */
  WoReg   UECON4CLR;   /**< \brief (USBC Offset: 0x230) TXINE Clear */
  WoReg   UECON5CLR;   /**< \brief (USBC Offset: 0x234) TXINE Clear */
  WoReg   UECON6CLR;   /**< \brief (USBC Offset: 0x238) TXINE Clear */
  WoReg   UECON7CLR;   /**< \brief (USBC Offset: 0x23C) TXINE Clear */
  RoReg   Reserved8[112];
  RwReg   UHCON;       /**< \brief (USBC Offset: 0x400) Host General Control Register */
  RoReg   UHINT;       /**< \brief (USBC Offset: 0x404) Host Global Interrupt Register */
  WoReg   UHINTCLR;    /**< \brief (USBC Offset: 0x408) Host Global Interrrupt Clear Register */
  WoReg   UHINTSET;    /**< \brief (USBC Offset: 0x40C) Host Global Interrupt Set Register */
  RoReg   UHINTE;      /**< \brief (USBC Offset: 0x410) Host Global Interrupt Enable Register */
  WoReg   UHINTECLR;   /**< \brief (USBC Offset: 0x414) Host Global Interrupt Enable Clear Register */
  WoReg   UHINTESET;   /**< \brief (USBC Offset: 0x418) Host Global Interrupt Enable Set Register */
  RwReg   UPRST;       /**< \brief (USBC Offset: 0x41C) Pipe Reset Register */
  RwReg   UHFNUM;      /**< \brief (USBC Offset: 0x420) Host Frame Number Register */
  RwReg   UHSOFC;      /**< \brief (USBC Offset: 0x424) Host Start of Frame Control Register */
  RoReg   Reserved9[54];
  RwReg   UPCFG0;      /**< \brief (USBC Offset: 0x500) Pipe Configuration Register */
  RwReg   UPCFG1;      /**< \brief (USBC Offset: 0x504) Pipe Configuration Register */
  RwReg   UPCFG2;      /**< \brief (USBC Offset: 0x508) Pipe Configuration Register */
  RwReg   UPCFG3;      /**< \brief (USBC Offset: 0x50C) Pipe Configuration Register */
  RwReg   UPCFG4;      /**< \brief (USBC Offset: 0x510) Pipe Configuration Register */
  RwReg   UPCFG5;      /**< \brief (USBC Offset: 0x514) Pipe Configuration Register */
  RwReg   UPCFG6;      /**< \brief (USBC Offset: 0x518) Pipe Configuration Register */
  RwReg   UPCFG7;      /**< \brief (USBC Offset: 0x51C) Pipe Configuration Register */
  RoReg   Reserved10[4];
  RoReg   UPSTA0;      /**< \brief (USBC Offset: 0x530) Pipe Status Register */
  RoReg   UPSTA1;      /**< \brief (USBC Offset: 0x534) Pipe Status Register */
  RoReg   UPSTA2;      /**< \brief (USBC Offset: 0x538) Pipe Status Register */
  RoReg   UPSTA3;      /**< \brief (USBC Offset: 0x53C) Pipe Status Register */
  RoReg   UPSTA4;      /**< \brief (USBC Offset: 0x540) Pipe Status Register */
  RoReg   UPSTA5;      /**< \brief (USBC Offset: 0x544) Pipe Status Register */
  RoReg   UPSTA6;      /**< \brief (USBC Offset: 0x548) Pipe Status Register */
  RoReg   UPSTA7;      /**< \brief (USBC Offset: 0x54C) Pipe Status Register */
  RoReg   Reserved11[4];
  WoReg   UPSTA0CLR;   /**< \brief (USBC Offset: 0x560) Pipe Status Clear Register */
  WoReg   UPSTA1CLR;   /**< \brief (USBC Offset: 0x564) Pipe Status Clear Register */
  WoReg   UPSTA2CLR;   /**< \brief (USBC Offset: 0x568) Pipe Status Clear Register */
  WoReg   UPSTA3CLR;   /**< \brief (USBC Offset: 0x56C) Pipe Status Clear Register */
  WoReg   UPSTA4CLR;   /**< \brief (USBC Offset: 0x570) Pipe Status Clear Register */
  WoReg   UPSTA5CLR;   /**< \brief (USBC Offset: 0x574) Pipe Status Clear Register */
  WoReg   UPSTA6CLR;   /**< \brief (USBC Offset: 0x578) Pipe Status Clear Register */
  WoReg   UPSTA7CLR;   /**< \brief (USBC Offset: 0x57C) Pipe Status Clear Register */
  RoReg   Reserved12[4];
  WoReg   UPSTA0SET;   /**< \brief (USBC Offset: 0x590) Pipe Status Set Register */
  WoReg   UPSTA1SET;   /**< \brief (USBC Offset: 0x594) Pipe Status Set Register */
  WoReg   UPSTA2SET;   /**< \brief (USBC Offset: 0x598) Pipe Status Set Register */
  WoReg   UPSTA3SET;   /**< \brief (USBC Offset: 0x59C) Pipe Status Set Register */
  WoReg   UPSTA4SET;   /**< \brief (USBC Offset: 0x5A0) Pipe Status Set Register */
  WoReg   UPSTA5SET;   /**< \brief (USBC Offset: 0x5A4) Pipe Status Set Register */
  WoReg   UPSTA6SET;   /**< \brief (USBC Offset: 0x5A8) Pipe Status Set Register */
  WoReg   UPSTA7SET;   /**< \brief (USBC Offset: 0x5AC) Pipe Status Set Register */
  RoReg   Reserved13[4];
  RoReg   UPCON0;      /**< \brief (USBC Offset: 0x5C0) Pipe Control Register */
  RoReg   UPCON1;      /**< \brief (USBC Offset: 0x5C4) Pipe Control Register */
  RoReg   UPCON2;      /**< \brief (USBC Offset: 0x5C8) Pipe Control Register */
  RoReg   UPCON3;      /**< \brief (USBC Offset: 0x5CC) Pipe Control Register */
  RoReg   UPCON4;      /**< \brief (USBC Offset: 0x5D0) Pipe Control Register */
  RoReg   UPCON5;      /**< \brief (USBC Offset: 0x5D4) Pipe Control Register */
  RoReg   UPCON6;      /**< \brief (USBC Offset: 0x5D8) Pipe Control Register */
  RoReg   UPCON7;      /**< \brief (USBC Offset: 0x5DC) Pipe Control Register */
  RoReg   Reserved14[4];
  WoReg   UPCON0SET;   /**< \brief (USBC Offset: 0x5F0) Pipe Control Set Register */
  WoReg   UPCON1SET;   /**< \brief (USBC Offset: 0x5F4) Pipe Control Set Register */
  WoReg   UPCON2SET;   /**< \brief (USBC Offset: 0x5F8) Pipe Control Set Register */
  WoReg   UPCON3SET;   /**< \brief (USBC Offset: 0x5FC) Pipe Control Set Register */
  WoReg   UPCON4SET;   /**< \brief (USBC Offset: 0x600) Pipe Control Set Register */
  WoReg   UPCON5SET;   /**< \brief (USBC Offset: 0x604) Pipe Control Set Register */
  WoReg   UPCON6SET;   /**< \brief (USBC Offset: 0x608) Pipe Control Set Register */
  WoReg   UPCON7SET;   /**< \brief (USBC Offset: 0x60C) Pipe Control Set Register */
  RoReg   Reserved15[4];
  WoReg   UPCON0CLR;   /**< \brief (USBC Offset: 0x620) Pipe Control Clear Register */
  WoReg   UPCON1CLR;   /**< \brief (USBC Offset: 0x624) Pipe Control Clear Register */
  WoReg   UPCON2CLR;   /**< \brief (USBC Offset: 0x628) Pipe Control Clear Register */
  WoReg   UPCON3CLR;   /**< \brief (USBC Offset: 0x62C) Pipe Control Clear Register */
  WoReg   UPCON4CLR;   /**< \brief (USBC Offset: 0x630) Pipe Control Clear Register */
  WoReg   UPCON5CLR;   /**< \brief (USBC Offset: 0x634) Pipe Control Clear Register */
  WoReg   UPCON6CLR;   /**< \brief (USBC Offset: 0x638) Pipe Control Clear Register */
  WoReg   UPCON7CLR;   /**< \brief (USBC Offset: 0x63C) Pipe Control Clear Register */
  RoReg   Reserved16[4];
  RwReg   UPINRQ0;     /**< \brief (USBC Offset: 0x650) Pipe In Request */
  RwReg   UPINRQ1;     /**< \brief (USBC Offset: 0x654) Pipe In Request */
  RwReg   UPINRQ2;     /**< \brief (USBC Offset: 0x658) Pipe In Request */
  RwReg   UPINRQ3;     /**< \brief (USBC Offset: 0x65C) Pipe In Request */
  RwReg   UPINRQ4;     /**< \brief (USBC Offset: 0x660) Pipe In Request */
  RwReg   UPINRQ5;     /**< \brief (USBC Offset: 0x664) Pipe In Request */
  RwReg   UPINRQ6;     /**< \brief (USBC Offset: 0x668) Pipe In Request */
  RwReg   UPINRQ7;     /**< \brief (USBC Offset: 0x66C) Pipe In Request */
  RoReg   Reserved17[100];
  RwReg   USBCON;      /**< \brief (USBC Offset: 0x800) General Control Register */
  RoReg   USBSTA;      /**< \brief (USBC Offset: 0x804) General Status Register */
  WoReg   USBSTACLR;   /**< \brief (USBC Offset: 0x808) General Status Clear Register */
  WoReg   USBSTASET;   /**< \brief (USBC Offset: 0x80C) General Status Set Register */
  RoReg   Reserved18[2];
  RoReg   UVERS;       /**< \brief (USBC Offset: 0x818) IP Version Register */
  RoReg   UFEATURES;   /**< \brief (USBC Offset: 0x81C) IP Features Register */
  RoReg   UADDRSIZE;   /**< \brief (USBC Offset: 0x820) IP PB address size Register */
  RoReg   UNAME1;      /**< \brief (USBC Offset: 0x824) IP Name Part One: HUSB */
  RoReg   UNAME2;      /**< \brief (USBC Offset: 0x828) IP Name Part Two: HOST */
  RoReg   USBFSM;      /**< \brief (USBC Offset: 0x82C) USB internal finite state machine */
  RwReg   UDESC;       /**< \brief (USBC Offset: 0x830) Endpoint descriptor table */
} Usbc;
