Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/* -------- USBC_UESTA4CLR : (USBC Offset: 0x170) Endpoint Status Clear Register -------- */
#define USBC_UESTA4CLR_TXINIC       (0x1u <<  0) /**< \brief (USBC_UESTA4CLR) TXINI Clear */
#define USBC_UESTA4CLR_RXOUTIC      (0x1u <<  1) /**< \brief (USBC_UESTA4CLR) RXOUTI Clear */
#define USBC_UESTA4CLR_RXSTPIC      (0x1u <<  2) /**< \brief (USBC_UESTA4CLR) RXSTPI Clear */
#define USBC_UESTA4CLR_NAKOUTIC     (0x1u <<  3) /**< \brief (USBC_UESTA4CLR) NAKOUTI Clear */
#define USBC_UESTA4CLR_NAKINIC      (0x1u <<  4) /**< \brief (USBC_UESTA4CLR) NAKINI Clear */
#define USBC_UESTA4CLR_STALLEDIC    (0x1u <<  6) /**< \brief (USBC_UESTA4CLR) STALLEDI Clear */
#define USBC_UESTA4CLR_RAMACERIC    (0x1u << 11) /**< \brief (USBC_UESTA4CLR) RAMACERI Clear */
/* -------- USBC_UESTA5CLR : (USBC Offset: 0x174) Endpoint Status Clear Register -------- */
#define USBC_UESTA5CLR_TXINIC       (0x1u <<  0) /**< \brief (USBC_UESTA5CLR) TXINI Clear */
#define USBC_UESTA5CLR_RXOUTIC      (0x1u <<  1) /**< \brief (USBC_UESTA5CLR) RXOUTI Clear */
#define USBC_UESTA5CLR_RXSTPIC      (0x1u <<  2) /**< \brief (USBC_UESTA5CLR) RXSTPI Clear */
#define USBC_UESTA5CLR_NAKOUTIC     (0x1u <<  3) /**< \brief (USBC_UESTA5CLR) NAKOUTI Clear */
#define USBC_UESTA5CLR_NAKINIC      (0x1u <<  4) /**< \brief (USBC_UESTA5CLR) NAKINI Clear */
#define USBC_UESTA5CLR_STALLEDIC    (0x1u <<  6) /**< \brief (USBC_UESTA5CLR) STALLEDI Clear */
#define USBC_UESTA5CLR_RAMACERIC    (0x1u << 11) /**< \brief (USBC_UESTA5CLR) RAMACERI Clear */
/* -------- USBC_UESTA6CLR : (USBC Offset: 0x178) Endpoint Status Clear Register -------- */
#define USBC_UESTA6CLR_TXINIC       (0x1u <<  0) /**< \brief (USBC_UESTA6CLR) TXINI Clear */
#define USBC_UESTA6CLR_RXOUTIC      (0x1u <<  1) /**< \brief (USBC_UESTA6CLR) RXOUTI Clear */
#define USBC_UESTA6CLR_RXSTPIC      (0x1u <<  2) /**< \brief (USBC_UESTA6CLR) RXSTPI Clear */
#define USBC_UESTA6CLR_NAKOUTIC     (0x1u <<  3) /**< \brief (USBC_UESTA6CLR) NAKOUTI Clear */
#define USBC_UESTA6CLR_NAKINIC      (0x1u <<  4) /**< \brief (USBC_UESTA6CLR) NAKINI Clear */
#define USBC_UESTA6CLR_STALLEDIC    (0x1u <<  6) /**< \brief (USBC_UESTA6CLR) STALLEDI Clear */
#define USBC_UESTA6CLR_RAMACERIC    (0x1u << 11) /**< \brief (USBC_UESTA6CLR) RAMACERI Clear */
/* -------- USBC_UESTA7CLR : (USBC Offset: 0x17C) Endpoint Status Clear Register -------- */
#define USBC_UESTA7CLR_TXINIC       (0x1u <<  0) /**< \brief (USBC_UESTA7CLR) TXINI Clear */
#define USBC_UESTA7CLR_RXOUTIC      (0x1u <<  1) /**< \brief (USBC_UESTA7CLR) RXOUTI Clear */
#define USBC_UESTA7CLR_RXSTPIC      (0x1u <<  2) /**< \brief (USBC_UESTA7CLR) RXSTPI Clear */
#define USBC_UESTA7CLR_NAKOUTIC     (0x1u <<  3) /**< \brief (USBC_UESTA7CLR) NAKOUTI Clear */
#define USBC_UESTA7CLR_NAKINIC      (0x1u <<  4) /**< \brief (USBC_UESTA7CLR) NAKINI Clear */
#define USBC_UESTA7CLR_STALLEDIC    (0x1u <<  6) /**< \brief (USBC_UESTA7CLR) STALLEDI Clear */
#define USBC_UESTA7CLR_RAMACERIC    (0x1u << 11) /**< \brief (USBC_UESTA7CLR) RAMACERI Clear */
/* -------- USBC_UESTA0SET : (USBC Offset: 0x190) Endpoint Status Set Register -------- */
#define USBC_UESTA0SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA0SET) TXINI Set */
#define USBC_UESTA0SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA0SET) RXOUTI Set */
#define USBC_UESTA0SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA0SET) RXSTPI Set */
#define USBC_UESTA0SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA0SET) NAKOUTI Set */
#define USBC_UESTA0SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA0SET) NAKINI Set */
#define USBC_UESTA0SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA0SET) STALLEDI Set */
#define USBC_UESTA0SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA0SET) RAMACERI Set */
#define USBC_UESTA0SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA0SET) NBUSYBK Set */
/* -------- USBC_UESTA1SET : (USBC Offset: 0x194) Endpoint Status Set Register -------- */
#define USBC_UESTA1SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA1SET) TXINI Set */
#define USBC_UESTA1SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA1SET) RXOUTI Set */
#define USBC_UESTA1SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA1SET) RXSTPI Set */
#define USBC_UESTA1SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA1SET) NAKOUTI Set */
#define USBC_UESTA1SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA1SET) NAKINI Set */
#define USBC_UESTA1SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA1SET) STALLEDI Set */
#define USBC_UESTA1SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA1SET) RAMACERI Set */
#define USBC_UESTA1SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA1SET) NBUSYBK Set */
/* -------- USBC_UESTA2SET : (USBC Offset: 0x198) Endpoint Status Set Register -------- */
#define USBC_UESTA2SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA2SET) TXINI Set */
#define USBC_UESTA2SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA2SET) RXOUTI Set */
#define USBC_UESTA2SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA2SET) RXSTPI Set */
#define USBC_UESTA2SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA2SET) NAKOUTI Set */
#define USBC_UESTA2SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA2SET) NAKINI Set */
#define USBC_UESTA2SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA2SET) STALLEDI Set */
#define USBC_UESTA2SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA2SET) RAMACERI Set */
#define USBC_UESTA2SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA2SET) NBUSYBK Set */
/* -------- USBC_UESTA3SET : (USBC Offset: 0x19C) Endpoint Status Set Register -------- */
#define USBC_UESTA3SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA3SET) TXINI Set */
#define USBC_UESTA3SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA3SET) RXOUTI Set */
#define USBC_UESTA3SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA3SET) RXSTPI Set */
#define USBC_UESTA3SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA3SET) NAKOUTI Set */
#define USBC_UESTA3SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA3SET) NAKINI Set */
#define USBC_UESTA3SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA3SET) STALLEDI Set */
#define USBC_UESTA3SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA3SET) RAMACERI Set */
#define USBC_UESTA3SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA3SET) NBUSYBK Set */
/* -------- USBC_UESTA4SET : (USBC Offset: 0x1A0) Endpoint Status Set Register -------- */
#define USBC_UESTA4SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA4SET) TXINI Set */
#define USBC_UESTA4SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA4SET) RXOUTI Set */
#define USBC_UESTA4SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA4SET) RXSTPI Set */
#define USBC_UESTA4SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA4SET) NAKOUTI Set */
#define USBC_UESTA4SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA4SET) NAKINI Set */
#define USBC_UESTA4SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA4SET) STALLEDI Set */
#define USBC_UESTA4SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA4SET) RAMACERI Set */
#define USBC_UESTA4SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA4SET) NBUSYBK Set */
/* -------- USBC_UESTA5SET : (USBC Offset: 0x1A4) Endpoint Status Set Register -------- */
#define USBC_UESTA5SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA5SET) TXINI Set */
#define USBC_UESTA5SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA5SET) RXOUTI Set */
#define USBC_UESTA5SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA5SET) RXSTPI Set */
#define USBC_UESTA5SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA5SET) NAKOUTI Set */
#define USBC_UESTA5SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA5SET) NAKINI Set */
#define USBC_UESTA5SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA5SET) STALLEDI Set */
#define USBC_UESTA5SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA5SET) RAMACERI Set */
#define USBC_UESTA5SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA5SET) NBUSYBK Set */
/* -------- USBC_UESTA6SET : (USBC Offset: 0x1A8) Endpoint Status Set Register -------- */
#define USBC_UESTA6SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA6SET) TXINI Set */
#define USBC_UESTA6SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA6SET) RXOUTI Set */
#define USBC_UESTA6SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA6SET) RXSTPI Set */
#define USBC_UESTA6SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA6SET) NAKOUTI Set */
#define USBC_UESTA6SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA6SET) NAKINI Set */
#define USBC_UESTA6SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA6SET) STALLEDI Set */
#define USBC_UESTA6SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA6SET) RAMACERI Set */
#define USBC_UESTA6SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA6SET) NBUSYBK Set */
/* -------- USBC_UESTA7SET : (USBC Offset: 0x1AC) Endpoint Status Set Register -------- */
#define USBC_UESTA7SET_TXINIS       (0x1u <<  0) /**< \brief (USBC_UESTA7SET) TXINI Set */
#define USBC_UESTA7SET_RXOUTIS      (0x1u <<  1) /**< \brief (USBC_UESTA7SET) RXOUTI Set */
#define USBC_UESTA7SET_RXSTPIS      (0x1u <<  2) /**< \brief (USBC_UESTA7SET) RXSTPI Set */
#define USBC_UESTA7SET_NAKOUTIS     (0x1u <<  3) /**< \brief (USBC_UESTA7SET) NAKOUTI Set */
#define USBC_UESTA7SET_NAKINIS      (0x1u <<  4) /**< \brief (USBC_UESTA7SET) NAKINI Set */
#define USBC_UESTA7SET_STALLEDIS    (0x1u <<  6) /**< \brief (USBC_UESTA7SET) STALLEDI Set */
#define USBC_UESTA7SET_RAMACERIS    (0x1u << 11) /**< \brief (USBC_UESTA7SET) RAMACERI Set */
#define USBC_UESTA7SET_NBUSYBKS     (0x1u << 12) /**< \brief (USBC_UESTA7SET) NBUSYBK Set */
/* -------- USBC_UECON0 : (USBC Offset: 0x1C0) Endpoint Control Register -------- */
#define USBC_UECON0_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON0) TXIN Interrupt Enable */
#define USBC_UECON0_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON0) RXOUT Interrupt Enable */
#define USBC_UECON0_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON0) RXSTP Interrupt Enable */
#define USBC_UECON0_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON0) NAKOUT Interrupt Enable */
#define USBC_UECON0_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON0) NAKIN Interrupt Enable */
#define USBC_UECON0_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON0) STALLED Interrupt Enable */
#define USBC_UECON0_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON0) No Reply */
#define USBC_UECON0_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON0) RAMACER Interrupt Enable */
#define USBC_UECON0_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON0) Number of Busy Banks Interrupt Enable */
#define USBC_UECON0_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON0) Kill IN Bank */
#define USBC_UECON0_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON0) FIFO Control */
#define USBC_UECON0_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON0) NYET token disable */
#define USBC_UECON0_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON0) Reset Data Toggle */
#define USBC_UECON0_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON0) STALL Request */
#define USBC_UECON0_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON0) Busy Bank1 Enable */
#define USBC_UECON0_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON0) Busy Bank0 Enable */
/* -------- USBC_UECON1 : (USBC Offset: 0x1C4) Endpoint Control Register -------- */
#define USBC_UECON1_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON1) TXIN Interrupt Enable */
#define USBC_UECON1_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON1) RXOUT Interrupt Enable */
#define USBC_UECON1_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON1) RXSTP Interrupt Enable */
#define USBC_UECON1_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON1) NAKOUT Interrupt Enable */
#define USBC_UECON1_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON1) NAKIN Interrupt Enable */
#define USBC_UECON1_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON1) STALLED Interrupt Enable */
#define USBC_UECON1_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON1) No Reply */
#define USBC_UECON1_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON1) RAMACER Interrupt Enable */
#define USBC_UECON1_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON1) Number of Busy Banks Interrupt Enable */
#define USBC_UECON1_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON1) Kill IN Bank */
#define USBC_UECON1_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON1) FIFO Control */
#define USBC_UECON1_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON1) NYET Token Enable */
#define USBC_UECON1_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON1) Reset Data Toggle */
#define USBC_UECON1_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON1) STALL Request */
#define USBC_UECON1_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON1) Busy Bank1 Enable */
#define USBC_UECON1_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON1) Busy Bank0 Enable */
/* -------- USBC_UECON2 : (USBC Offset: 0x1C8) Endpoint Control Register -------- */
#define USBC_UECON2_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON2) TXIN Interrupt Enable */
#define USBC_UECON2_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON2) RXOUT Interrupt Enable */
#define USBC_UECON2_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON2) RXSTP Interrupt Enable */
#define USBC_UECON2_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON2) NAKOUT Interrupt Enable */
#define USBC_UECON2_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON2) NAKIN Interrupt Enable */
#define USBC_UECON2_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON2) STALLED Interrupt Enable */
#define USBC_UECON2_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON2) No Reply */
#define USBC_UECON2_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON2) RAMACER Interrupt Enable */
#define USBC_UECON2_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON2) Number of Busy Banks Interrupt Enable */
#define USBC_UECON2_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON2) Kill IN Bank */
#define USBC_UECON2_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON2) FIFO Control */
#define USBC_UECON2_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON2) NYET Token Enable */
#define USBC_UECON2_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON2) Reset Data Toggle */
#define USBC_UECON2_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON2) STALL Request */
#define USBC_UECON2_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON2) Busy Bank1 Enable */
#define USBC_UECON2_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON2) Busy Bank0 Enable */
/* -------- USBC_UECON3 : (USBC Offset: 0x1CC) Endpoint Control Register -------- */
#define USBC_UECON3_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON3) TXIN Interrupt Enable */
#define USBC_UECON3_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON3) RXOUT Interrupt Enable */
#define USBC_UECON3_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON3) RXSTP Interrupt Enable */
#define USBC_UECON3_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON3) NAKOUT Interrupt Enable */
#define USBC_UECON3_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON3) NAKIN Interrupt Enable */
#define USBC_UECON3_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON3) STALLED Interrupt Enable */
#define USBC_UECON3_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON3) No Reply */
#define USBC_UECON3_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON3) RAMACER Interrupt Enable */
#define USBC_UECON3_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON3) Number of Busy Banks Interrupt Enable */
#define USBC_UECON3_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON3) Kill IN Bank */
#define USBC_UECON3_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON3) FIFO Control */
#define USBC_UECON3_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON3) NYET Token Enable */
#define USBC_UECON3_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON3) Reset Data Toggle */
#define USBC_UECON3_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON3) STALL Request */
#define USBC_UECON3_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON3) Busy Bank1 Enable */
#define USBC_UECON3_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON3) Busy Bank0 Enable */
/* -------- USBC_UECON4 : (USBC Offset: 0x1D0) Endpoint Control Register -------- */
#define USBC_UECON4_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON4) TXIN Interrupt Enable */
#define USBC_UECON4_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON4) RXOUT Interrupt Enable */
#define USBC_UECON4_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON4) RXSTP Interrupt Enable */
#define USBC_UECON4_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON4) NAKOUT Interrupt Enable */
#define USBC_UECON4_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON4) NAKIN Interrupt Enable */
#define USBC_UECON4_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON4) STALLED Interrupt Enable */
#define USBC_UECON4_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON4) No Reply */
#define USBC_UECON4_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON4) RAMACER Interrupt Enable */
#define USBC_UECON4_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON4) Number of Busy Banks Interrupt Enable */
#define USBC_UECON4_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON4) Kill IN Bank */
#define USBC_UECON4_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON4) FIFO Control */
#define USBC_UECON4_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON4) NYET Token Enable */
#define USBC_UECON4_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON4) Reset Data Toggle */
#define USBC_UECON4_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON4) STALL Request */
#define USBC_UECON4_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON4) Busy Bank1 Enable */
#define USBC_UECON4_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON4) Busy Bank0 Enable */
/* -------- USBC_UECON5 : (USBC Offset: 0x1D4) Endpoint Control Register -------- */
#define USBC_UECON5_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON5) TXIN Interrupt Enable */
#define USBC_UECON5_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON5) RXOUT Interrupt Enable */
#define USBC_UECON5_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON5) RXSTP Interrupt Enable */
#define USBC_UECON5_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON5) NAKOUT Interrupt Enable */
#define USBC_UECON5_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON5) NAKIN Interrupt Enable */
#define USBC_UECON5_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON5) STALLED Interrupt Enable */
#define USBC_UECON5_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON5) No Reply */
#define USBC_UECON5_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON5) RAMACER Interrupt Enable */
#define USBC_UECON5_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON5) Number of Busy Banks Interrupt Enable */
#define USBC_UECON5_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON5) Kill IN Bank */
#define USBC_UECON5_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON5) FIFO Control */
#define USBC_UECON5_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON5) NYET Token Enable */
#define USBC_UECON5_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON5) Reset Data Toggle */
#define USBC_UECON5_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON5) STALL Request */
#define USBC_UECON5_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON5) Busy Bank1 Enable */
#define USBC_UECON5_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON5) Busy Bank0 Enable */
/* -------- USBC_UECON6 : (USBC Offset: 0x1D8) Endpoint Control Register -------- */
#define USBC_UECON6_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON6) TXIN Interrupt Enable */
#define USBC_UECON6_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON6) RXOUT Interrupt Enable */
#define USBC_UECON6_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON6) RXSTP Interrupt Enable */
#define USBC_UECON6_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON6) NAKOUT Interrupt Enable */
#define USBC_UECON6_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON6) NAKIN Interrupt Enable */
#define USBC_UECON6_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON6) STALLED Interrupt Enable */
#define USBC_UECON6_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON6) No Reply */
#define USBC_UECON6_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON6) RAMACER Interrupt Enable */
#define USBC_UECON6_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON6) Number of Busy Banks Interrupt Enable */
#define USBC_UECON6_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON6) Kill IN Bank */
#define USBC_UECON6_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON6) FIFO Control */
#define USBC_UECON6_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON6) NYET Token Enable */
#define USBC_UECON6_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON6) Reset Data Toggle */
#define USBC_UECON6_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON6) STALL Request */
#define USBC_UECON6_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON6) Busy Bank1 Enable */
#define USBC_UECON6_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON6) Busy Bank0 Enable */
/* -------- USBC_UECON7 : (USBC Offset: 0x1DC) Endpoint Control Register -------- */
#define USBC_UECON7_TXINE           (0x1u <<  0) /**< \brief (USBC_UECON7) TXIN Interrupt Enable */
#define USBC_UECON7_RXOUTE          (0x1u <<  1) /**< \brief (USBC_UECON7) RXOUT Interrupt Enable */
#define USBC_UECON7_RXSTPE          (0x1u <<  2) /**< \brief (USBC_UECON7) RXSTP Interrupt Enable */
#define USBC_UECON7_NAKOUTE         (0x1u <<  3) /**< \brief (USBC_UECON7) NAKOUT Interrupt Enable */
#define USBC_UECON7_NAKINE          (0x1u <<  4) /**< \brief (USBC_UECON7) NAKIN Interrupt Enable */
#define USBC_UECON7_STALLEDE        (0x1u <<  6) /**< \brief (USBC_UECON7) STALLED Interrupt Enable */
#define USBC_UECON7_NREPLY          (0x1u <<  8) /**< \brief (USBC_UECON7) No Reply */
#define USBC_UECON7_RAMACERE        (0x1u << 11) /**< \brief (USBC_UECON7) RAMACER Interrupt Enable */
#define USBC_UECON7_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UECON7) Number of Busy Banks Interrupt Enable */
#define USBC_UECON7_KILLBK          (0x1u << 13) /**< \brief (USBC_UECON7) Kill IN Bank */
#define USBC_UECON7_FIFOCON         (0x1u << 14) /**< \brief (USBC_UECON7) FIFO Control */
#define USBC_UECON7_NYETDIS         (0x1u << 17) /**< \brief (USBC_UECON7) NYET Token Enable */
#define USBC_UECON7_RSTDT           (0x1u << 18) /**< \brief (USBC_UECON7) Reset Data Toggle */
#define USBC_UECON7_STALLRQ         (0x1u << 19) /**< \brief (USBC_UECON7) STALL Request */
#define USBC_UECON7_BUSY0           (0x1u << 24) /**< \brief (USBC_UECON7) Busy Bank1 Enable */
#define USBC_UECON7_BUSY1           (0x1u << 25) /**< \brief (USBC_UECON7) Busy Bank0 Enable */
/* -------- USBC_UECON0SET : (USBC Offset: 0x1F0) Endpoint Control Set Register -------- */
#define USBC_UECON0SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON0SET) TXINE Set */
#define USBC_UECON0SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON0SET) RXOUTE Set */
#define USBC_UECON0SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON0SET) RXSTPE Set */
#define USBC_UECON0SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON0SET) NAKOUTE Set */
#define USBC_UECON0SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON0SET) NAKINE Set */
#define USBC_UECON0SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON0SET) STALLEDE Set */
#define USBC_UECON0SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON0SET) NREPLY Set */
