Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UECON0SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON0SET) RAMACERE Set */
#define USBC_UECON0SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON0SET) NBUSYBKE Set */
#define USBC_UECON0SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON0SET) KILLBK Set */
#define USBC_UECON0SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON0SET) NYETDIS Set */
#define USBC_UECON0SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON0SET) RSTDT Set */
#define USBC_UECON0SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON0SET) STALLRQ Set */
#define USBC_UECON0SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON0SET) BUSY0 Set */
#define USBC_UECON0SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON0SET) BUSY1 Set */
/* -------- USBC_UECON1SET : (USBC Offset: 0x1F4) Endpoint Control Set Register -------- */
#define USBC_UECON1SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON1SET) TXINE Set */
#define USBC_UECON1SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON1SET) RXOUTE Set */
#define USBC_UECON1SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON1SET) RXSTPE Set */
#define USBC_UECON1SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON1SET) NAKOUTE Set */
#define USBC_UECON1SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON1SET) NAKINE Set */
#define USBC_UECON1SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON1SET) STALLEDE Set */
#define USBC_UECON1SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON1SET) NREPLY Set */
#define USBC_UECON1SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON1SET) RAMACERE Set */
#define USBC_UECON1SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON1SET) NBUSYBKE Set */
#define USBC_UECON1SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON1SET) KILLBK Set */
#define USBC_UECON1SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON1SET) NYETDIS Set */
#define USBC_UECON1SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON1SET) RSTDT Set */
#define USBC_UECON1SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON1SET) STALLRQ Set */
#define USBC_UECON1SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON1SET) BUSY0 Set */
#define USBC_UECON1SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON1SET) BUSY1 Set */
/* -------- USBC_UECON2SET : (USBC Offset: 0x1F8) Endpoint Control Set Register -------- */
#define USBC_UECON2SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON2SET) TXINE Set */
#define USBC_UECON2SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON2SET) RXOUTE Set */
#define USBC_UECON2SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON2SET) RXSTPE Set */
#define USBC_UECON2SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON2SET) NAKOUTE Set */
#define USBC_UECON2SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON2SET) NAKINE Set */
#define USBC_UECON2SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON2SET) STALLEDE Set */
#define USBC_UECON2SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON2SET) NREPLY Set */
#define USBC_UECON2SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON2SET) RAMACERE Set */
#define USBC_UECON2SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON2SET) NBUSYBKE Set */
#define USBC_UECON2SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON2SET) KILLBK Set */
#define USBC_UECON2SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON2SET) NYETDIS Set */
#define USBC_UECON2SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON2SET) RSTDT Set */
#define USBC_UECON2SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON2SET) STALLRQ Set */
#define USBC_UECON2SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON2SET) BUSY0 Set */
#define USBC_UECON2SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON2SET) BUSY1 Set */
/* -------- USBC_UECON3SET : (USBC Offset: 0x1FC) Endpoint Control Set Register -------- */
#define USBC_UECON3SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON3SET) TXINE Set */
#define USBC_UECON3SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON3SET) RXOUTE Set */
#define USBC_UECON3SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON3SET) RXSTPE Set */
#define USBC_UECON3SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON3SET) NAKOUTE Set */
#define USBC_UECON3SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON3SET) NAKINE Set */
#define USBC_UECON3SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON3SET) STALLEDE Set */
#define USBC_UECON3SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON3SET) NREPLY Set */
#define USBC_UECON3SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON3SET) RAMACERE Set */
#define USBC_UECON3SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON3SET) NBUSYBKE Set */
#define USBC_UECON3SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON3SET) KILLBK Set */
#define USBC_UECON3SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON3SET) NYETDIS Set */
#define USBC_UECON3SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON3SET) RSTDT Set */
#define USBC_UECON3SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON3SET) STALLRQ Set */
#define USBC_UECON3SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON3SET) BUSY0 Set */
#define USBC_UECON3SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON3SET) BUSY1 Set */
/* -------- USBC_UECON4SET : (USBC Offset: 0x200) Endpoint Control Set Register -------- */
#define USBC_UECON4SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON4SET) TXINE Set */
#define USBC_UECON4SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON4SET) RXOUTE Set */
#define USBC_UECON4SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON4SET) RXSTPE Set */
#define USBC_UECON4SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON4SET) NAKOUTE Set */
#define USBC_UECON4SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON4SET) NAKINE Set */
#define USBC_UECON4SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON4SET) STALLEDE Set */
#define USBC_UECON4SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON4SET) NREPLY Set */
#define USBC_UECON4SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON4SET) RAMACERE Set */
#define USBC_UECON4SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON4SET) NBUSYBKE Set */
#define USBC_UECON4SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON4SET) KILLBK Set */
#define USBC_UECON4SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON4SET) NYETDIS Set */
#define USBC_UECON4SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON4SET) RSTDT Set */
#define USBC_UECON4SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON4SET) STALLRQ Set */
#define USBC_UECON4SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON4SET) BUSY0 Set */
#define USBC_UECON4SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON4SET) BUSY1 Set */
/* -------- USBC_UECON5SET : (USBC Offset: 0x204) Endpoint Control Set Register -------- */
#define USBC_UECON5SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON5SET) TXINE Set */
#define USBC_UECON5SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON5SET) RXOUTE Set */
#define USBC_UECON5SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON5SET) RXSTPE Set */
#define USBC_UECON5SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON5SET) NAKOUTE Set */
#define USBC_UECON5SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON5SET) NAKINE Set */
#define USBC_UECON5SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON5SET) STALLEDE Set */
#define USBC_UECON5SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON5SET) NREPLY Set */
#define USBC_UECON5SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON5SET) RAMACERE Set */
#define USBC_UECON5SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON5SET) NBUSYBKE Set */
#define USBC_UECON5SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON5SET) KILLBK Set */
#define USBC_UECON5SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON5SET) NYETDIS Set */
#define USBC_UECON5SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON5SET) RSTDT Set */
#define USBC_UECON5SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON5SET) STALLRQ Set */
#define USBC_UECON5SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON5SET) BUSY0 Set */
#define USBC_UECON5SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON5SET) BUSY1 Set */
/* -------- USBC_UECON6SET : (USBC Offset: 0x208) Endpoint Control Set Register -------- */
#define USBC_UECON6SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON6SET) TXINE Set */
#define USBC_UECON6SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON6SET) RXOUTE Set */
#define USBC_UECON6SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON6SET) RXSTPE Set */
#define USBC_UECON6SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON6SET) NAKOUTE Set */
#define USBC_UECON6SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON6SET) NAKINE Set */
#define USBC_UECON6SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON6SET) STALLEDE Set */
#define USBC_UECON6SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON6SET) NREPLY Set */
#define USBC_UECON6SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON6SET) RAMACERE Set */
#define USBC_UECON6SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON6SET) NBUSYBKE Set */
#define USBC_UECON6SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON6SET) KILLBK Set */
#define USBC_UECON6SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON6SET) NYETDIS Set */
#define USBC_UECON6SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON6SET) RSTDT Set */
#define USBC_UECON6SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON6SET) STALLRQ Set */
#define USBC_UECON6SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON6SET) BUSY0 Set */
#define USBC_UECON6SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON6SET) BUSY1 Set */
/* -------- USBC_UECON7SET : (USBC Offset: 0x20C) Endpoint Control Set Register -------- */
#define USBC_UECON7SET_TXINES       (0x1u <<  0) /**< \brief (USBC_UECON7SET) TXINE Set */
#define USBC_UECON7SET_RXOUTES      (0x1u <<  1) /**< \brief (USBC_UECON7SET) RXOUTE Set */
#define USBC_UECON7SET_RXSTPES      (0x1u <<  2) /**< \brief (USBC_UECON7SET) RXSTPE Set */
#define USBC_UECON7SET_NAKOUTES     (0x1u <<  3) /**< \brief (USBC_UECON7SET) NAKOUTE Set */
#define USBC_UECON7SET_NAKINES      (0x1u <<  4) /**< \brief (USBC_UECON7SET) NAKINE Set */
#define USBC_UECON7SET_STALLEDES    (0x1u <<  6) /**< \brief (USBC_UECON7SET) STALLEDE Set */
#define USBC_UECON7SET_NREPLYS      (0x1u <<  8) /**< \brief (USBC_UECON7SET) NREPLY Set */
#define USBC_UECON7SET_RAMACERES    (0x1u << 11) /**< \brief (USBC_UECON7SET) RAMACERE Set */
#define USBC_UECON7SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UECON7SET) NBUSYBKE Set */
#define USBC_UECON7SET_KILLBKS      (0x1u << 13) /**< \brief (USBC_UECON7SET) KILLBK Set */
#define USBC_UECON7SET_NYETDISS     (0x1u << 17) /**< \brief (USBC_UECON7SET) NYETDIS Set */
#define USBC_UECON7SET_RSTDTS       (0x1u << 18) /**< \brief (USBC_UECON7SET) RSTDT Set */
#define USBC_UECON7SET_STALLRQS     (0x1u << 19) /**< \brief (USBC_UECON7SET) STALLRQ Set */
#define USBC_UECON7SET_BUSY0S       (0x1u << 24) /**< \brief (USBC_UECON7SET) BUSY0 Set */
#define USBC_UECON7SET_BUSY1S       (0x1u << 25) /**< \brief (USBC_UECON7SET) BUSY1 Set */
/* -------- USBC_UECON0CLR : (USBC Offset: 0x220) Endpoint Control Clear Register -------- */
#define USBC_UECON0CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON0CLR) TXINE Clear */
#define USBC_UECON0CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON0CLR) RXOUTE Clear */
#define USBC_UECON0CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON0CLR) RXSTPE Clear */
#define USBC_UECON0CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON0CLR) NAKOUTE Clear */
#define USBC_UECON0CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON0CLR) NAKINE Clear */
#define USBC_UECON0CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON0CLR) STALLEDE Clear */
#define USBC_UECON0CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON0CLR) NREPLY Clear */
#define USBC_UECON0CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON0CLR) RAMACERE Clear */
#define USBC_UECON0CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON0CLR) NBUSYBKE Clear */
#define USBC_UECON0CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON0CLR) FIFOCON Clear */
#define USBC_UECON0CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON0CLR) NYETDIS Clear */
#define USBC_UECON0CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON0CLR) STALLRQ Clear */
#define USBC_UECON0CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON0CLR) BUSY0 Clear */
#define USBC_UECON0CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON0CLR) BUSY1 Clear */
/* -------- USBC_UECON1CLR : (USBC Offset: 0x224) TXINE Clear -------- */
#define USBC_UECON1CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON1CLR) TXINE Clear */
#define USBC_UECON1CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON1CLR) RXOUTE Clear */
#define USBC_UECON1CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON1CLR) NAKOUTE Clear */
#define USBC_UECON1CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON1CLR) NAKINE Clear */
#define USBC_UECON1CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON1CLR) RXSTPE Clear */
#define USBC_UECON1CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON1CLR) NREPLY Clear */
#define USBC_UECON1CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON1CLR) RAMACERE Clear */
#define USBC_UECON1CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON1CLR) NBUSYBKE Clear */
#define USBC_UECON1CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON1CLR) FIFOCON Clear */
#define USBC_UECON1CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON1CLR) NYETDIS Clear */
#define USBC_UECON1CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON1CLR) STALLEDE Clear */
#define USBC_UECON1CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON1CLR) BUSY0 Clear */
#define USBC_UECON1CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON1CLR) BUSY1 Clear */
/* -------- USBC_UECON2CLR : (USBC Offset: 0x228) TXINE Clear -------- */
#define USBC_UECON2CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON2CLR) TXINE Clear */
#define USBC_UECON2CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON2CLR) RXOUTE Clear */
#define USBC_UECON2CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON2CLR) RXOUTE Clear */
#define USBC_UECON2CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON2CLR) NAKOUTE Clear */
#define USBC_UECON2CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON2CLR) NAKINE Clear */
#define USBC_UECON2CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON2CLR) RXSTPE Clear */
#define USBC_UECON2CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON2CLR) NREPLY Clear */
#define USBC_UECON2CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON2CLR) RAMACERE Clear */
#define USBC_UECON2CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON2CLR) NBUSYBKE Clear */
#define USBC_UECON2CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON2CLR) FIFOCON Clear */
#define USBC_UECON2CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON2CLR) NYETDIS Clear */
#define USBC_UECON2CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON2CLR) STALLEDE Clear */
#define USBC_UECON2CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON2CLR) BUSY0 Clear */
#define USBC_UECON2CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON2CLR) BUSY1 Clear */
/* -------- USBC_UECON3CLR : (USBC Offset: 0x22C) TXINE Clear -------- */
#define USBC_UECON3CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON3CLR) TXINE Clear */
#define USBC_UECON3CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON3CLR) RXOUTE Clear */
#define USBC_UECON3CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON3CLR) RXOUTE Clear */
#define USBC_UECON3CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON3CLR) NAKOUTE Clear */
#define USBC_UECON3CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON3CLR) NAKINE Clear */
#define USBC_UECON3CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON3CLR) RXSTPE Clear */
#define USBC_UECON3CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON3CLR) NREPLY Clear */
#define USBC_UECON3CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON3CLR) RAMACERE Clear */
#define USBC_UECON3CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON3CLR) NBUSYBKE Clear */
#define USBC_UECON3CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON3CLR) FIFOCON Clear */
#define USBC_UECON3CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON3CLR) NYETDIS Clear */
#define USBC_UECON3CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON3CLR) STALLEDE Clear */
#define USBC_UECON3CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON3CLR) BUSY0 Clear */
#define USBC_UECON3CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON3CLR) BUSY1 Clear */
/* -------- USBC_UECON4CLR : (USBC Offset: 0x230) TXINE Clear -------- */
#define USBC_UECON4CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON4CLR) TXINE Clear */
#define USBC_UECON4CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON4CLR) RXOUTE Clear */
#define USBC_UECON4CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON4CLR) RXOUTE Clear */
#define USBC_UECON4CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON4CLR) NAKOUTE Clear */
#define USBC_UECON4CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON4CLR) NAKINE Clear */
#define USBC_UECON4CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON4CLR) RXSTPE Clear */
#define USBC_UECON4CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON4CLR) NREPLY Clear */
#define USBC_UECON4CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON4CLR) RAMACERE Clear */
#define USBC_UECON4CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON4CLR) NBUSYBKE Clear */
#define USBC_UECON4CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON4CLR) FIFOCON Clear */
#define USBC_UECON4CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON4CLR) NYETDIS Clear */
#define USBC_UECON4CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON4CLR) STALLEDE Clear */
#define USBC_UECON4CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON4CLR) BUSY0 Clear */
#define USBC_UECON4CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON4CLR) BUSY1 Clear */
/* -------- USBC_UECON5CLR : (USBC Offset: 0x234) TXINE Clear -------- */
#define USBC_UECON5CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON5CLR) TXINE Clear */
#define USBC_UECON5CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON5CLR) RXOUTE Clear */
#define USBC_UECON5CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON5CLR) RXOUTE Clear */
#define USBC_UECON5CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON5CLR) NAKOUTE Clear */
#define USBC_UECON5CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON5CLR) NAKINE Clear */
#define USBC_UECON5CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON5CLR) RXSTPE Clear */
#define USBC_UECON5CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON5CLR) NREPLY Clear */
#define USBC_UECON5CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON5CLR) RAMACERE Clear */
#define USBC_UECON5CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON5CLR) NBUSYBKE Clear */
#define USBC_UECON5CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON5CLR) FIFOCON Clear */
#define USBC_UECON5CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON5CLR) NYETDIS Clear */
#define USBC_UECON5CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON5CLR) STALLEDE Clear */
#define USBC_UECON5CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON5CLR) BUSY0 Clear */
#define USBC_UECON5CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON5CLR) BUSY1 Clear */
/* -------- USBC_UECON6CLR : (USBC Offset: 0x238) TXINE Clear -------- */
#define USBC_UECON6CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON6CLR) TXINE Clear */
#define USBC_UECON6CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON6CLR) RXOUTE Clear */
#define USBC_UECON6CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON6CLR) NAKOUTE Clear */
#define USBC_UECON6CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON6CLR) NAKINE Clear */
#define USBC_UECON6CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON6CLR) RXSTPE Clear */
#define USBC_UECON6CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON6CLR) NREPLY Clear */
#define USBC_UECON6CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON6CLR) RAMACERE Clear */
#define USBC_UECON6CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON6CLR) NBUSYBKE Clear */
#define USBC_UECON6CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON6CLR) FIFOCON Clear */
#define USBC_UECON6CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON6CLR) NYETDIS Clear */
#define USBC_UECON6CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON6CLR) STALLEDE Clear */
#define USBC_UECON6CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON6CLR) BUSY0 Clear */
#define USBC_UECON6CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON6CLR) BUSY1 Clear */
/* -------- USBC_UECON7CLR : (USBC Offset: 0x23C) TXINE Clear -------- */
#define USBC_UECON7CLR_TXINEC       (0x1u <<  0) /**< \brief (USBC_UECON7CLR) TXINE Clear */
#define USBC_UECON7CLR_RXOUTEC      (0x1u <<  1) /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_RXSTPEC      (0x1u <<  2) /**< \brief (USBC_UECON7CLR) RXOUTE Clear */
#define USBC_UECON7CLR_NAKOUTEC     (0x1u <<  3) /**< \brief (USBC_UECON7CLR) NAKOUTE Clear */
#define USBC_UECON7CLR_NAKINEC      (0x1u <<  4) /**< \brief (USBC_UECON7CLR) NAKINE Clear */
#define USBC_UECON7CLR_STALLEDEC    (0x1u <<  6) /**< \brief (USBC_UECON7CLR) RXSTPE Clear */
#define USBC_UECON7CLR_NREPLYC      (0x1u <<  8) /**< \brief (USBC_UECON7CLR) NREPLY Clear */
#define USBC_UECON7CLR_RAMACEREC    (0x1u << 11) /**< \brief (USBC_UECON7CLR) RAMACERE Clear */
#define USBC_UECON7CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UECON7CLR) NBUSYBKE Clear */
#define USBC_UECON7CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UECON7CLR) FIFOCON Clear */
#define USBC_UECON7CLR_NYETDISC     (0x1u << 17) /**< \brief (USBC_UECON7CLR) NYETDIS Clear */
#define USBC_UECON7CLR_STALLRQC     (0x1u << 19) /**< \brief (USBC_UECON7CLR) STALLEDE Clear */
#define USBC_UECON7CLR_BUSY0C       (0x1u << 24) /**< \brief (USBC_UECON7CLR) BUSY0 Clear */
#define USBC_UECON7CLR_BUSY1C       (0x1u << 25) /**< \brief (USBC_UECON7CLR) BUSY1 Clear */
/* -------- USBC_UHCON : (USBC Offset: 0x400) Host General Control Register -------- */
#define USBC_UHCON_SOFE             (0x1u <<  8) /**< \brief (USBC_UHCON) SOF Enable */
#define USBC_UHCON_RESET            (0x1u <<  9) /**< \brief (USBC_UHCON) Send USB Reset */
#define USBC_UHCON_RESUME           (0x1u << 10) /**< \brief (USBC_UHCON) Send USB Resume */
#define USBC_UHCON_SPDCONF_Pos      12
#define USBC_UHCON_SPDCONF_Msk      (0x3u << USBC_UHCON_SPDCONF_Pos) /**< \brief (USBC_UHCON) Speed Configuration */
#define USBC_UHCON_SPDCONF(value)   ((USBC_UHCON_SPDCONF_Msk & ((value) << USBC_UHCON_SPDCONF_Pos)))
#define USBC_UHCON_TSTJ             (0x1u << 16) /**< \brief (USBC_UHCON) Test J */
#define USBC_UHCON_TSTK             (0x1u << 17) /**< \brief (USBC_UHCON) Test K */
/* -------- USBC_UHINT : (USBC Offset: 0x404) Host Global Interrupt Register -------- */
#define USBC_UHINT_DCONNI           (0x1u <<  0) /**< \brief (USBC_UHINT) Device Connection Interrupt */
#define USBC_UHINT_DDISCI           (0x1u <<  1) /**< \brief (USBC_UHINT) Device Disconnection Interrupt */
#define USBC_UHINT_RSTI             (0x1u <<  2) /**< \brief (USBC_UHINT) USB Reset Sent Interrupt */
#define USBC_UHINT_RSMEDI           (0x1u <<  3) /**< \brief (USBC_UHINT) Downstream Resume Sent Interrupt */
#define USBC_UHINT_RXRSMI           (0x1u <<  4) /**< \brief (USBC_UHINT) Upstream Resume Received Interrupt */
