Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UHINT_HSOFI            (0x1u <<  5) /**< \brief (USBC_UHINT) Host SOF Interrupt */
#define USBC_UHINT_HWUPI            (0x1u <<  6) /**< \brief (USBC_UHINT) Host Wake-Up Interrupt */
#define USBC_UHINT_P0INT            (0x1u <<  8) /**< \brief (USBC_UHINT) Pipe 0 Interrupt */
#define USBC_UHINT_P1INT            (0x1u <<  9) /**< \brief (USBC_UHINT) Pipe 1 Interrupt */
#define USBC_UHINT_P2INT            (0x1u << 10) /**< \brief (USBC_UHINT) Pipe 2 Interrupt */
#define USBC_UHINT_P3INT            (0x1u << 11) /**< \brief (USBC_UHINT) Pipe 3 Interrupt */
#define USBC_UHINT_P4INT            (0x1u << 12) /**< \brief (USBC_UHINT) Pipe 4 Interrupt */
#define USBC_UHINT_P5INT            (0x1u << 13) /**< \brief (USBC_UHINT) Pipe 5 Interrupt */
#define USBC_UHINT_P6INT            (0x1u << 14) /**< \brief (USBC_UHINT) Pipe 6 Interrupt */
/* -------- USBC_UHINTCLR : (USBC Offset: 0x408) Host Global Interrrupt Clear Register -------- */
#define USBC_UHINTCLR_DCONNIC       (0x1u <<  0) /**< \brief (USBC_UHINTCLR) DCONNI Clear */
#define USBC_UHINTCLR_DDISCIC       (0x1u <<  1) /**< \brief (USBC_UHINTCLR) DDISCI Clear */
#define USBC_UHINTCLR_RSTIC         (0x1u <<  2) /**< \brief (USBC_UHINTCLR) RSTI Clear */
#define USBC_UHINTCLR_RSMEDIC       (0x1u <<  3) /**< \brief (USBC_UHINTCLR) RSMEDI Clear */
#define USBC_UHINTCLR_RXRSMIC       (0x1u <<  4) /**< \brief (USBC_UHINTCLR) RXRSMI Clear */
#define USBC_UHINTCLR_HSOFIC        (0x1u <<  5) /**< \brief (USBC_UHINTCLR) HSOFI Clear */
#define USBC_UHINTCLR_HWUPIC        (0x1u <<  6) /**< \brief (USBC_UHINTCLR) HWUPI Clear */
/* -------- USBC_UHINTSET : (USBC Offset: 0x40C) Host Global Interrupt Set Register -------- */
#define USBC_UHINTSET_DCONNIS       (0x1u <<  0) /**< \brief (USBC_UHINTSET) DCONNI Set */
#define USBC_UHINTSET_DDISCIS       (0x1u <<  1) /**< \brief (USBC_UHINTSET) DDISCI Set */
#define USBC_UHINTSET_RSTIS         (0x1u <<  2) /**< \brief (USBC_UHINTSET) RSTI Set */
#define USBC_UHINTSET_RSMEDIS       (0x1u <<  3) /**< \brief (USBC_UHINTSET) RSMEDI Set */
#define USBC_UHINTSET_RXRSMIS       (0x1u <<  4) /**< \brief (USBC_UHINTSET) RXRSMI Set */
#define USBC_UHINTSET_HSOFIS        (0x1u <<  5) /**< \brief (USBC_UHINTSET) HSOFI Set */
#define USBC_UHINTSET_HWUPIS        (0x1u <<  6) /**< \brief (USBC_UHINTSET) HWUPI Set */
/* -------- USBC_UHINTE : (USBC Offset: 0x410) Host Global Interrupt Enable Register -------- */
#define USBC_UHINTE_DCONNIE         (0x1u <<  0) /**< \brief (USBC_UHINTE) DCONNI Enable */
#define USBC_UHINTE_DDISCIE         (0x1u <<  1) /**< \brief (USBC_UHINTE) DDISCI Enable */
#define USBC_UHINTE_RSTIE           (0x1u <<  2) /**< \brief (USBC_UHINTE) RSTI Enable */
#define USBC_UHINTE_RSMEDIE         (0x1u <<  3) /**< \brief (USBC_UHINTE) RSMEDI Enable */
#define USBC_UHINTE_RXRSMIE         (0x1u <<  4) /**< \brief (USBC_UHINTE) RXRSMI Enable */
#define USBC_UHINTE_HSOFIE          (0x1u <<  5) /**< \brief (USBC_UHINTE) HSOFI Enable */
#define USBC_UHINTE_HWUPIE          (0x1u <<  6) /**< \brief (USBC_UHINTE) HWUPI Enable */
#define USBC_UHINTE_P0INTE          (0x1u <<  8) /**< \brief (USBC_UHINTE) P0INT Enable */
#define USBC_UHINTE_P1INTE          (0x1u <<  9) /**< \brief (USBC_UHINTE) P1INT Enable */
#define USBC_UHINTE_P2INTE          (0x1u << 10) /**< \brief (USBC_UHINTE) P2INT Enable */
#define USBC_UHINTE_P3INTE          (0x1u << 11) /**< \brief (USBC_UHINTE) P3INT Enable */
#define USBC_UHINTE_P4INTE          (0x1u << 12) /**< \brief (USBC_UHINTE) P4INT Enable */
#define USBC_UHINTE_P5INTE          (0x1u << 13) /**< \brief (USBC_UHINTE) P5INT Enable */
#define USBC_UHINTE_P6INTE          (0x1u << 14) /**< \brief (USBC_UHINTE) P6INT Enable */
#define USBC_UHINTE_P7INTE          (0x1u << 15) /**< \brief (USBC_UHINTE) P7INT Enable */
/* -------- USBC_UHINTECLR : (USBC Offset: 0x414) Host Global Interrupt Enable Clear Register -------- */
#define USBC_UHINTECLR_DCONNIEC     (0x1u <<  0) /**< \brief (USBC_UHINTECLR) DCONNIE Clear */
#define USBC_UHINTECLR_DDISCIEC     (0x1u <<  1) /**< \brief (USBC_UHINTECLR) DDISCIE Clear */
#define USBC_UHINTECLR_RSTIEC       (0x1u <<  2) /**< \brief (USBC_UHINTECLR) RSTIE Clear */
#define USBC_UHINTECLR_RSMEDIEC     (0x1u <<  3) /**< \brief (USBC_UHINTECLR) RSMEDIE Clear */
#define USBC_UHINTECLR_RXRSMIEC     (0x1u <<  4) /**< \brief (USBC_UHINTECLR) RXRSMIE Clear */
#define USBC_UHINTECLR_HSOFIEC      (0x1u <<  5) /**< \brief (USBC_UHINTECLR) HSOFIE Clear */
#define USBC_UHINTECLR_HWUPIEC      (0x1u <<  6) /**< \brief (USBC_UHINTECLR) HWUPIE Clear */
#define USBC_UHINTECLR_P0INTEC      (0x1u <<  8) /**< \brief (USBC_UHINTECLR) P0INTE Clear */
#define USBC_UHINTECLR_P1INTEC      (0x1u <<  9) /**< \brief (USBC_UHINTECLR) P1INTE Clear */
#define USBC_UHINTECLR_P2INTEC      (0x1u << 10) /**< \brief (USBC_UHINTECLR) P2INTE Clear */
#define USBC_UHINTECLR_P3INTEC      (0x1u << 11) /**< \brief (USBC_UHINTECLR) P3INTE Clear */
#define USBC_UHINTECLR_P4INTEC      (0x1u << 12) /**< \brief (USBC_UHINTECLR) P4INTE Clear */
#define USBC_UHINTECLR_P5INTEC      (0x1u << 13) /**< \brief (USBC_UHINTECLR) P5INTE Clear */
#define USBC_UHINTECLR_P6INTEC      (0x1u << 14) /**< \brief (USBC_UHINTECLR) P6INTE Clear */
#define USBC_UHINTECLR_P7INTEC      (0x1u << 15) /**< \brief (USBC_UHINTECLR) P7INTE Clear */
/* -------- USBC_UHINTESET : (USBC Offset: 0x418) Host Global Interrupt Enable Set Register -------- */
#define USBC_UHINTESET_DCONNIES     (0x1u <<  0) /**< \brief (USBC_UHINTESET) DCONNIE Set */
#define USBC_UHINTESET_DDISCIES     (0x1u <<  1) /**< \brief (USBC_UHINTESET) DDISCIE Set */
#define USBC_UHINTESET_RSTIES       (0x1u <<  2) /**< \brief (USBC_UHINTESET) RSTIE Set */
#define USBC_UHINTESET_RSMEDIES     (0x1u <<  3) /**< \brief (USBC_UHINTESET) RSMEDIE Set */
#define USBC_UHINTESET_RXRSMIES     (0x1u <<  4) /**< \brief (USBC_UHINTESET) RXRSMIE Set */
#define USBC_UHINTESET_HSOFIES      (0x1u <<  5) /**< \brief (USBC_UHINTESET) HSOFIE Set */
#define USBC_UHINTESET_HWUPIES      (0x1u <<  6) /**< \brief (USBC_UHINTESET) HWUPIE Set */
#define USBC_UHINTESET_P0INTES      (0x1u <<  8) /**< \brief (USBC_UHINTESET) P0INTE Set */
#define USBC_UHINTESET_P1INTES      (0x1u <<  9) /**< \brief (USBC_UHINTESET) P1INTE Set */
#define USBC_UHINTESET_P2INTES      (0x1u << 10) /**< \brief (USBC_UHINTESET) P2INTE Set */
#define USBC_UHINTESET_P3INTES      (0x1u << 11) /**< \brief (USBC_UHINTESET) P3INTE Set */
#define USBC_UHINTESET_P4INTES      (0x1u << 12) /**< \brief (USBC_UHINTESET) P4INTE Set */
#define USBC_UHINTESET_P5INTES      (0x1u << 13) /**< \brief (USBC_UHINTESET) P5INTE Set */
#define USBC_UHINTESET_P6INTES      (0x1u << 14) /**< \brief (USBC_UHINTESET) P6INTE Set */
#define USBC_UHINTESET_P7INTES      (0x1u << 15) /**< \brief (USBC_UHINTESET) P7INTE Set */
/* -------- USBC_UPRST : (USBC Offset: 0x41C) Pipe Reset Register -------- */
#define USBC_UPRST_PEN0             (0x1u <<  0) /**< \brief (USBC_UPRST) Pipe0 Enable */
#define USBC_UPRST_PEN1             (0x1u <<  1) /**< \brief (USBC_UPRST) Pipe1 Enable */
#define USBC_UPRST_PEN2             (0x1u <<  2) /**< \brief (USBC_UPRST) Pipe2 Enable */
#define USBC_UPRST_PEN3             (0x1u <<  3) /**< \brief (USBC_UPRST) Pipe3 Enable */
#define USBC_UPRST_PEN4             (0x1u <<  4) /**< \brief (USBC_UPRST) Pipe4 Enable */
#define USBC_UPRST_PEN5             (0x1u <<  5) /**< \brief (USBC_UPRST) Pipe5 Enable */
#define USBC_UPRST_PEN6             (0x1u <<  6) /**< \brief (USBC_UPRST) Pipe6 Enable */
#define USBC_UPRST_PEN7             (0x1u <<  7) /**< \brief (USBC_UPRST) Pipe7 Enable */
/* -------- USBC_UHFNUM : (USBC Offset: 0x420) Host Frame Number Register -------- */
#define USBC_UHFNUM_MFNUM_Pos       0
#define USBC_UHFNUM_MFNUM_Msk       (0x7u << USBC_UHFNUM_MFNUM_Pos) /**< \brief (USBC_UHFNUM) Micro Frame Number */
#define USBC_UHFNUM_MFNUM(value)    ((USBC_UHFNUM_MFNUM_Msk & ((value) << USBC_UHFNUM_MFNUM_Pos)))
#define USBC_UHFNUM_FNUM_Pos        3
#define USBC_UHFNUM_FNUM_Msk        (0x7FFu << USBC_UHFNUM_FNUM_Pos) /**< \brief (USBC_UHFNUM) Frame Number */
#define USBC_UHFNUM_FNUM(value)     ((USBC_UHFNUM_FNUM_Msk & ((value) << USBC_UHFNUM_FNUM_Pos)))
#define USBC_UHFNUM_FLENHIGH_Pos    16
#define USBC_UHFNUM_FLENHIGH_Msk    (0xFFu << USBC_UHFNUM_FLENHIGH_Pos) /**< \brief (USBC_UHFNUM) Frame Length */
#define USBC_UHFNUM_FLENHIGH(value) ((USBC_UHFNUM_FLENHIGH_Msk & ((value) << USBC_UHFNUM_FLENHIGH_Pos)))
/* -------- USBC_UHSOFC : (USBC Offset: 0x424) Host Start of Frame Control Register -------- */
#define USBC_UHSOFC_FLENC_Pos       0
#define USBC_UHSOFC_FLENC_Msk       (0x3FFFu << USBC_UHSOFC_FLENC_Pos) /**< \brief (USBC_UHSOFC) Frame Length Control */
#define USBC_UHSOFC_FLENC(value)    ((USBC_UHSOFC_FLENC_Msk & ((value) << USBC_UHSOFC_FLENC_Pos)))
#define USBC_UHSOFC_FLENCE          (0x1u << 16) /**< \brief (USBC_UHSOFC) Frame Length Control Enable */
/* -------- USBC_UPCFG0 : (USBC Offset: 0x500) Pipe Configuration Register -------- */
#define USBC_UPCFG0_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG0) Pipe Banks */
#define   USBC_UPCFG0_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PSIZE_Pos       4
#define USBC_UPCFG0_PSIZE_Msk       (0x7u << USBC_UPCFG0_PSIZE_Pos) /**< \brief (USBC_UPCFG0) Pipe Size */
#define USBC_UPCFG0_PSIZE(value)    ((USBC_UPCFG0_PSIZE_Msk & ((value) << USBC_UPCFG0_PSIZE_Pos)))
#define   USBC_UPCFG0_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PTOKEN_Pos      8
#define USBC_UPCFG0_PTOKEN_Msk      (0x3u << USBC_UPCFG0_PTOKEN_Pos) /**< \brief (USBC_UPCFG0) Pipe Token */
#define USBC_UPCFG0_PTOKEN(value)   ((USBC_UPCFG0_PTOKEN_Msk & ((value) << USBC_UPCFG0_PTOKEN_Pos)))
#define   USBC_UPCFG0_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PTYPE_Pos       12
#define USBC_UPCFG0_PTYPE_Msk       (0x3u << USBC_UPCFG0_PTYPE_Pos) /**< \brief (USBC_UPCFG0) Pipe Type */
#define USBC_UPCFG0_PTYPE(value)    ((USBC_UPCFG0_PTYPE_Msk & ((value) << USBC_UPCFG0_PTYPE_Pos)))
#define   USBC_UPCFG0_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG0)  */
#define   USBC_UPCFG0_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG0)  */
#define USBC_UPCFG0_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG0) Ping Enable */
#define USBC_UPCFG0_BINTERVAL_Pos    24
#define USBC_UPCFG0_BINTERVAL_Msk    (0xFFu << USBC_UPCFG0_BINTERVAL_Pos) /**< \brief (USBC_UPCFG0) binterval parameter */
#define USBC_UPCFG0_BINTERVAL(value) ((USBC_UPCFG0_BINTERVAL_Msk & ((value) << USBC_UPCFG0_BINTERVAL_Pos)))
/* -------- USBC_UPCFG1 : (USBC Offset: 0x504) Pipe Configuration Register -------- */
#define USBC_UPCFG1_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG1) Pipe Banks */
#define   USBC_UPCFG1_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PSIZE_Pos       4
#define USBC_UPCFG1_PSIZE_Msk       (0x7u << USBC_UPCFG1_PSIZE_Pos) /**< \brief (USBC_UPCFG1) Pipe Size */
#define USBC_UPCFG1_PSIZE(value)    ((USBC_UPCFG1_PSIZE_Msk & ((value) << USBC_UPCFG1_PSIZE_Pos)))
#define   USBC_UPCFG1_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTOKEN_Pos      8
#define USBC_UPCFG1_PTOKEN_Msk      (0x3u << USBC_UPCFG1_PTOKEN_Pos) /**< \brief (USBC_UPCFG1) Pipe Token */
#define USBC_UPCFG1_PTOKEN(value)   ((USBC_UPCFG1_PTOKEN_Msk & ((value) << USBC_UPCFG1_PTOKEN_Pos)))
#define   USBC_UPCFG1_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PTYPE_Pos       12
#define USBC_UPCFG1_PTYPE_Msk       (0x3u << USBC_UPCFG1_PTYPE_Pos) /**< \brief (USBC_UPCFG1) Pipe Type */
#define USBC_UPCFG1_PTYPE(value)    ((USBC_UPCFG1_PTYPE_Msk & ((value) << USBC_UPCFG1_PTYPE_Pos)))
#define   USBC_UPCFG1_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG1)  */
#define   USBC_UPCFG1_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG1)  */
#define USBC_UPCFG1_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG1) Ping Enable */
#define USBC_UPCFG1_BINTERVAL_Pos    24
#define USBC_UPCFG1_BINTERVAL_Msk    (0xFFu << USBC_UPCFG1_BINTERVAL_Pos) /**< \brief (USBC_UPCFG1) binterval parameter */
#define USBC_UPCFG1_BINTERVAL(value) ((USBC_UPCFG1_BINTERVAL_Msk & ((value) << USBC_UPCFG1_BINTERVAL_Pos)))
/* -------- USBC_UPCFG2 : (USBC Offset: 0x508) Pipe Configuration Register -------- */
#define USBC_UPCFG2_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG2) Pipe Banks */
#define   USBC_UPCFG2_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PSIZE_Pos       4
#define USBC_UPCFG2_PSIZE_Msk       (0x7u << USBC_UPCFG2_PSIZE_Pos) /**< \brief (USBC_UPCFG2) Pipe Size */
#define USBC_UPCFG2_PSIZE(value)    ((USBC_UPCFG2_PSIZE_Msk & ((value) << USBC_UPCFG2_PSIZE_Pos)))
#define   USBC_UPCFG2_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTOKEN_Pos      8
#define USBC_UPCFG2_PTOKEN_Msk      (0x3u << USBC_UPCFG2_PTOKEN_Pos) /**< \brief (USBC_UPCFG2) Pipe Token */
#define USBC_UPCFG2_PTOKEN(value)   ((USBC_UPCFG2_PTOKEN_Msk & ((value) << USBC_UPCFG2_PTOKEN_Pos)))
#define   USBC_UPCFG2_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PTYPE_Pos       12
#define USBC_UPCFG2_PTYPE_Msk       (0x3u << USBC_UPCFG2_PTYPE_Pos) /**< \brief (USBC_UPCFG2) Pipe Type */
#define USBC_UPCFG2_PTYPE(value)    ((USBC_UPCFG2_PTYPE_Msk & ((value) << USBC_UPCFG2_PTYPE_Pos)))
#define   USBC_UPCFG2_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG2)  */
#define   USBC_UPCFG2_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG2)  */
#define USBC_UPCFG2_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG2) Ping Enable */
#define USBC_UPCFG2_BINTERVAL_Pos    24
#define USBC_UPCFG2_BINTERVAL_Msk    (0xFFu << USBC_UPCFG2_BINTERVAL_Pos) /**< \brief (USBC_UPCFG2) binterval parameter */
#define USBC_UPCFG2_BINTERVAL(value) ((USBC_UPCFG2_BINTERVAL_Msk & ((value) << USBC_UPCFG2_BINTERVAL_Pos)))
/* -------- USBC_UPCFG3 : (USBC Offset: 0x50C) Pipe Configuration Register -------- */
#define USBC_UPCFG3_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG3) Pipe Banks */
#define   USBC_UPCFG3_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PSIZE_Pos       4
#define USBC_UPCFG3_PSIZE_Msk       (0x7u << USBC_UPCFG3_PSIZE_Pos) /**< \brief (USBC_UPCFG3) Pipe Size */
#define USBC_UPCFG3_PSIZE(value)    ((USBC_UPCFG3_PSIZE_Msk & ((value) << USBC_UPCFG3_PSIZE_Pos)))
#define   USBC_UPCFG3_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PTOKEN_Pos      8
#define USBC_UPCFG3_PTOKEN_Msk      (0x3u << USBC_UPCFG3_PTOKEN_Pos) /**< \brief (USBC_UPCFG3) Pipe Token */
#define USBC_UPCFG3_PTOKEN(value)   ((USBC_UPCFG3_PTOKEN_Msk & ((value) << USBC_UPCFG3_PTOKEN_Pos)))
#define   USBC_UPCFG3_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PTYPE_Pos       12
#define USBC_UPCFG3_PTYPE_Msk       (0x3u << USBC_UPCFG3_PTYPE_Pos) /**< \brief (USBC_UPCFG3) Pipe Type */
#define USBC_UPCFG3_PTYPE(value)    ((USBC_UPCFG3_PTYPE_Msk & ((value) << USBC_UPCFG3_PTYPE_Pos)))
#define   USBC_UPCFG3_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG3)  */
#define   USBC_UPCFG3_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG3)  */
#define USBC_UPCFG3_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG3) Ping Enable */
#define USBC_UPCFG3_BINTERVAL_Pos    24
#define USBC_UPCFG3_BINTERVAL_Msk    (0xFFu << USBC_UPCFG3_BINTERVAL_Pos) /**< \brief (USBC_UPCFG3) binterval parameter */
#define USBC_UPCFG3_BINTERVAL(value) ((USBC_UPCFG3_BINTERVAL_Msk & ((value) << USBC_UPCFG3_BINTERVAL_Pos)))
/* -------- USBC_UPCFG4 : (USBC Offset: 0x510) Pipe Configuration Register -------- */
#define USBC_UPCFG4_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG4) Pipe Banks */
#define   USBC_UPCFG4_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PSIZE_Pos       4
#define USBC_UPCFG4_PSIZE_Msk       (0x7u << USBC_UPCFG4_PSIZE_Pos) /**< \brief (USBC_UPCFG4) Pipe Size */
#define USBC_UPCFG4_PSIZE(value)    ((USBC_UPCFG4_PSIZE_Msk & ((value) << USBC_UPCFG4_PSIZE_Pos)))
#define   USBC_UPCFG4_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PTOKEN_Pos      8
#define USBC_UPCFG4_PTOKEN_Msk      (0x3u << USBC_UPCFG4_PTOKEN_Pos) /**< \brief (USBC_UPCFG4) Pipe Token */
#define USBC_UPCFG4_PTOKEN(value)   ((USBC_UPCFG4_PTOKEN_Msk & ((value) << USBC_UPCFG4_PTOKEN_Pos)))
#define   USBC_UPCFG4_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PTYPE_Pos       12
#define USBC_UPCFG4_PTYPE_Msk       (0x3u << USBC_UPCFG4_PTYPE_Pos) /**< \brief (USBC_UPCFG4) Pipe Type */
#define USBC_UPCFG4_PTYPE(value)    ((USBC_UPCFG4_PTYPE_Msk & ((value) << USBC_UPCFG4_PTYPE_Pos)))
#define   USBC_UPCFG4_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG4)  */
#define   USBC_UPCFG4_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG4)  */
#define USBC_UPCFG4_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG4) Ping Enable */
#define USBC_UPCFG4_BINTERVAL_Pos    24
#define USBC_UPCFG4_BINTERVAL_Msk    (0xFFu << USBC_UPCFG4_BINTERVAL_Pos) /**< \brief (USBC_UPCFG4) binterval parameter */
#define USBC_UPCFG4_BINTERVAL(value) ((USBC_UPCFG4_BINTERVAL_Msk & ((value) << USBC_UPCFG4_BINTERVAL_Pos)))
/* -------- USBC_UPCFG5 : (USBC Offset: 0x514) Pipe Configuration Register -------- */
#define USBC_UPCFG5_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG5) Pipe Banks */
#define   USBC_UPCFG5_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PSIZE_Pos       4
#define USBC_UPCFG5_PSIZE_Msk       (0x7u << USBC_UPCFG5_PSIZE_Pos) /**< \brief (USBC_UPCFG5) Pipe Size */
#define USBC_UPCFG5_PSIZE(value)    ((USBC_UPCFG5_PSIZE_Msk & ((value) << USBC_UPCFG5_PSIZE_Pos)))
#define   USBC_UPCFG5_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PTOKEN_Pos      8
#define USBC_UPCFG5_PTOKEN_Msk      (0x3u << USBC_UPCFG5_PTOKEN_Pos) /**< \brief (USBC_UPCFG5) Pipe Token */
#define USBC_UPCFG5_PTOKEN(value)   ((USBC_UPCFG5_PTOKEN_Msk & ((value) << USBC_UPCFG5_PTOKEN_Pos)))
#define   USBC_UPCFG5_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG5)  */
