Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UPCFG5_PTYPE_Pos       12
#define USBC_UPCFG5_PTYPE_Msk       (0x3u << USBC_UPCFG5_PTYPE_Pos) /**< \brief (USBC_UPCFG5) Pipe Type */
#define USBC_UPCFG5_PTYPE(value)    ((USBC_UPCFG5_PTYPE_Msk & ((value) << USBC_UPCFG5_PTYPE_Pos)))
#define   USBC_UPCFG5_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG5)  */
#define   USBC_UPCFG5_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG5)  */
#define USBC_UPCFG5_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG5) Ping Enable */
#define USBC_UPCFG5_BINTERVAL_Pos    24
#define USBC_UPCFG5_BINTERVAL_Msk    (0xFFu << USBC_UPCFG5_BINTERVAL_Pos) /**< \brief (USBC_UPCFG5) binterval parameter */
#define USBC_UPCFG5_BINTERVAL(value) ((USBC_UPCFG5_BINTERVAL_Msk & ((value) << USBC_UPCFG5_BINTERVAL_Pos)))
/* -------- USBC_UPCFG6 : (USBC Offset: 0x518) Pipe Configuration Register -------- */
#define USBC_UPCFG6_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG6) Pipe Banks */
#define   USBC_UPCFG6_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PSIZE_Pos       4
#define USBC_UPCFG6_PSIZE_Msk       (0x7u << USBC_UPCFG6_PSIZE_Pos) /**< \brief (USBC_UPCFG6) Pipe Size */
#define USBC_UPCFG6_PSIZE(value)    ((USBC_UPCFG6_PSIZE_Msk & ((value) << USBC_UPCFG6_PSIZE_Pos)))
#define   USBC_UPCFG6_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTOKEN_Pos      8
#define USBC_UPCFG6_PTOKEN_Msk      (0x3u << USBC_UPCFG6_PTOKEN_Pos) /**< \brief (USBC_UPCFG6) Pipe Token */
#define USBC_UPCFG6_PTOKEN(value)   ((USBC_UPCFG6_PTOKEN_Msk & ((value) << USBC_UPCFG6_PTOKEN_Pos)))
#define   USBC_UPCFG6_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PTYPE_Pos       12
#define USBC_UPCFG6_PTYPE_Msk       (0x3u << USBC_UPCFG6_PTYPE_Pos) /**< \brief (USBC_UPCFG6) Pipe Type */
#define USBC_UPCFG6_PTYPE(value)    ((USBC_UPCFG6_PTYPE_Msk & ((value) << USBC_UPCFG6_PTYPE_Pos)))
#define   USBC_UPCFG6_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG6)  */
#define   USBC_UPCFG6_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG6)  */
#define USBC_UPCFG6_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG6) Ping Enable */
#define USBC_UPCFG6_BINTERVAL_Pos    24
#define USBC_UPCFG6_BINTERVAL_Msk    (0xFFu << USBC_UPCFG6_BINTERVAL_Pos) /**< \brief (USBC_UPCFG6) binterval parameter */
#define USBC_UPCFG6_BINTERVAL(value) ((USBC_UPCFG6_BINTERVAL_Msk & ((value) << USBC_UPCFG6_BINTERVAL_Pos)))
/* -------- USBC_UPCFG7 : (USBC Offset: 0x51C) Pipe Configuration Register -------- */
#define USBC_UPCFG7_PBK             (0x1u <<  2) /**< \brief (USBC_UPCFG7) Pipe Banks */
#define   USBC_UPCFG7_PBK_SINGLE    (0x0u <<  2) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PBK_DOUBLE    (0x1u <<  2) /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PSIZE_Pos       4
#define USBC_UPCFG7_PSIZE_Msk       (0x7u << USBC_UPCFG7_PSIZE_Pos) /**< \brief (USBC_UPCFG7) Pipe Size */
#define USBC_UPCFG7_PSIZE(value)    ((USBC_UPCFG7_PSIZE_Msk & ((value) << USBC_UPCFG7_PSIZE_Pos)))
#define   USBC_UPCFG7_PSIZE_8       (0x0u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_16      (0x1u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_32      (0x2u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_64      (0x3u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_128     (0x4u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_256     (0x5u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_512     (0x6u <<  4) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PSIZE_1024    (0x7u <<  4) /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTOKEN_Pos      8
#define USBC_UPCFG7_PTOKEN_Msk      (0x3u << USBC_UPCFG7_PTOKEN_Pos) /**< \brief (USBC_UPCFG7) Pipe Token */
#define USBC_UPCFG7_PTOKEN(value)   ((USBC_UPCFG7_PTOKEN_Msk & ((value) << USBC_UPCFG7_PTOKEN_Pos)))
#define   USBC_UPCFG7_PTOKEN_SETUP  (0x0u <<  8) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_IN     (0x1u <<  8) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTOKEN_OUT    (0x2u <<  8) /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PTYPE_Pos       12
#define USBC_UPCFG7_PTYPE_Msk       (0x3u << USBC_UPCFG7_PTYPE_Pos) /**< \brief (USBC_UPCFG7) Pipe Type */
#define USBC_UPCFG7_PTYPE(value)    ((USBC_UPCFG7_PTYPE_Msk & ((value) << USBC_UPCFG7_PTYPE_Pos)))
#define   USBC_UPCFG7_PTYPE_CONTROL (0x0u << 12) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_ISOCHRONOUS (0x1u << 12) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_BULK    (0x2u << 12) /**< \brief (USBC_UPCFG7)  */
#define   USBC_UPCFG7_PTYPE_INTERRUPT (0x3u << 12) /**< \brief (USBC_UPCFG7)  */
#define USBC_UPCFG7_PINGEN          (0x1u << 20) /**< \brief (USBC_UPCFG7) Ping Enable */
#define USBC_UPCFG7_BINTERVAL_Pos    24
#define USBC_UPCFG7_BINTERVAL_Msk    (0xFFu << USBC_UPCFG7_BINTERVAL_Pos) /**< \brief (USBC_UPCFG7) binterval parameter */
#define USBC_UPCFG7_BINTERVAL(value) ((USBC_UPCFG7_BINTERVAL_Msk & ((value) << USBC_UPCFG7_BINTERVAL_Pos)))
/* -------- USBC_UPSTA0 : (USBC Offset: 0x530) Pipe Status Register -------- */
#define USBC_UPSTA0_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA0) Received IN Data Interrupt */
#define USBC_UPSTA0_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA0) Transmitted OUT Data Interrupt */
#define USBC_UPSTA0_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA0) Transmitted SETUP Interrupt */
#define USBC_UPSTA0_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA0) Pipe Error Interrupt */
#define USBC_UPSTA0_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA0) NAKed Interrupt */
#define USBC_UPSTA0_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA0) Errorflow Interrupt */
#define USBC_UPSTA0_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA0) Received STALLed Interrupt */
#define USBC_UPSTA0_DTSEQ_Pos       8
#define USBC_UPSTA0_DTSEQ_Msk       (0x3u << USBC_UPSTA0_DTSEQ_Pos) /**< \brief (USBC_UPSTA0) Data Toggle Sequence */
#define USBC_UPSTA0_DTSEQ(value)    ((USBC_UPSTA0_DTSEQ_Msk & ((value) << USBC_UPSTA0_DTSEQ_Pos)))
#define USBC_UPSTA0_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA0) Ram Access Error Interrupt */
#define USBC_UPSTA0_NBUSYBK_Pos     12
#define USBC_UPSTA0_NBUSYBK_Msk     (0x3u << USBC_UPSTA0_NBUSYBK_Pos) /**< \brief (USBC_UPSTA0) Number of Busy Bank */
#define USBC_UPSTA0_NBUSYBK(value)  ((USBC_UPSTA0_NBUSYBK_Msk & ((value) << USBC_UPSTA0_NBUSYBK_Pos)))
#define USBC_UPSTA0_CURRBK_Pos      14
#define USBC_UPSTA0_CURRBK_Msk      (0x3u << USBC_UPSTA0_CURRBK_Pos) /**< \brief (USBC_UPSTA0) Current Bank */
#define USBC_UPSTA0_CURRBK(value)   ((USBC_UPSTA0_CURRBK_Msk & ((value) << USBC_UPSTA0_CURRBK_Pos)))
/* -------- USBC_UPSTA1 : (USBC Offset: 0x534) Pipe Status Register -------- */
#define USBC_UPSTA1_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA1) Received IN Data Interrupt */
#define USBC_UPSTA1_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA1) Transmitted OUT Data Interrupt */
#define USBC_UPSTA1_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA1) Transmitted SETUP Interrupt */
#define USBC_UPSTA1_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA1) Pipe Error Interrupt */
#define USBC_UPSTA1_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA1) NAKed Interrupt */
#define USBC_UPSTA1_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA1) Errorflow Interrupt */
#define USBC_UPSTA1_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA1) Received STALLed Interrupt */
#define USBC_UPSTA1_DTSEQ_Pos       8
#define USBC_UPSTA1_DTSEQ_Msk       (0x3u << USBC_UPSTA1_DTSEQ_Pos) /**< \brief (USBC_UPSTA1) Data Toggle Sequence */
#define USBC_UPSTA1_DTSEQ(value)    ((USBC_UPSTA1_DTSEQ_Msk & ((value) << USBC_UPSTA1_DTSEQ_Pos)))
#define USBC_UPSTA1_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA1) Ram Access Error Interrupt */
#define USBC_UPSTA1_NBUSYBK_Pos     12
#define USBC_UPSTA1_NBUSYBK_Msk     (0x3u << USBC_UPSTA1_NBUSYBK_Pos) /**< \brief (USBC_UPSTA1) Number of Busy Bank */
#define USBC_UPSTA1_NBUSYBK(value)  ((USBC_UPSTA1_NBUSYBK_Msk & ((value) << USBC_UPSTA1_NBUSYBK_Pos)))
#define USBC_UPSTA1_CURRBK_Pos      14
#define USBC_UPSTA1_CURRBK_Msk      (0x3u << USBC_UPSTA1_CURRBK_Pos) /**< \brief (USBC_UPSTA1) Current Bank */
#define USBC_UPSTA1_CURRBK(value)   ((USBC_UPSTA1_CURRBK_Msk & ((value) << USBC_UPSTA1_CURRBK_Pos)))
/* -------- USBC_UPSTA2 : (USBC Offset: 0x538) Pipe Status Register -------- */
#define USBC_UPSTA2_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA2) Received IN Data Interrupt */
#define USBC_UPSTA2_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA2) Transmitted OUT Data Interrupt */
#define USBC_UPSTA2_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA2) Transmitted SETUP Interrupt */
#define USBC_UPSTA2_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA2) Pipe Error Interrupt */
#define USBC_UPSTA2_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA2) NAKed Interrupt */
#define USBC_UPSTA2_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA2) Errorflow Interrupt */
#define USBC_UPSTA2_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA2) Received STALLed Interrupt */
#define USBC_UPSTA2_DTSEQ_Pos       8
#define USBC_UPSTA2_DTSEQ_Msk       (0x3u << USBC_UPSTA2_DTSEQ_Pos) /**< \brief (USBC_UPSTA2) Data Toggle Sequence */
#define USBC_UPSTA2_DTSEQ(value)    ((USBC_UPSTA2_DTSEQ_Msk & ((value) << USBC_UPSTA2_DTSEQ_Pos)))
#define USBC_UPSTA2_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA2) Ram Access Error Interrupt */
#define USBC_UPSTA2_NBUSYBK_Pos     12
#define USBC_UPSTA2_NBUSYBK_Msk     (0x3u << USBC_UPSTA2_NBUSYBK_Pos) /**< \brief (USBC_UPSTA2) Number of Busy Bank */
#define USBC_UPSTA2_NBUSYBK(value)  ((USBC_UPSTA2_NBUSYBK_Msk & ((value) << USBC_UPSTA2_NBUSYBK_Pos)))
#define USBC_UPSTA2_CURRBK_Pos      14
#define USBC_UPSTA2_CURRBK_Msk      (0x3u << USBC_UPSTA2_CURRBK_Pos) /**< \brief (USBC_UPSTA2) Current Bank */
#define USBC_UPSTA2_CURRBK(value)   ((USBC_UPSTA2_CURRBK_Msk & ((value) << USBC_UPSTA2_CURRBK_Pos)))
/* -------- USBC_UPSTA3 : (USBC Offset: 0x53C) Pipe Status Register -------- */
#define USBC_UPSTA3_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA3) Received IN Data Interrupt */
#define USBC_UPSTA3_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA3) Transmitted OUT Data Interrupt */
#define USBC_UPSTA3_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA3) Transmitted SETUP Interrupt */
#define USBC_UPSTA3_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA3) Pipe Error Interrupt */
#define USBC_UPSTA3_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA3) NAKed Interrupt */
#define USBC_UPSTA3_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA3) Errorflow Interrupt */
#define USBC_UPSTA3_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA3) Received STALLed Interrupt */
#define USBC_UPSTA3_DTSEQ_Pos       8
#define USBC_UPSTA3_DTSEQ_Msk       (0x3u << USBC_UPSTA3_DTSEQ_Pos) /**< \brief (USBC_UPSTA3) Data Toggle Sequence */
#define USBC_UPSTA3_DTSEQ(value)    ((USBC_UPSTA3_DTSEQ_Msk & ((value) << USBC_UPSTA3_DTSEQ_Pos)))
#define USBC_UPSTA3_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA3) Ram Access Error Interrupt */
#define USBC_UPSTA3_NBUSYBK_Pos     12
#define USBC_UPSTA3_NBUSYBK_Msk     (0x3u << USBC_UPSTA3_NBUSYBK_Pos) /**< \brief (USBC_UPSTA3) Number of Busy Bank */
#define USBC_UPSTA3_NBUSYBK(value)  ((USBC_UPSTA3_NBUSYBK_Msk & ((value) << USBC_UPSTA3_NBUSYBK_Pos)))
#define USBC_UPSTA3_CURRBK_Pos      14
#define USBC_UPSTA3_CURRBK_Msk      (0x3u << USBC_UPSTA3_CURRBK_Pos) /**< \brief (USBC_UPSTA3) Current Bank */
#define USBC_UPSTA3_CURRBK(value)   ((USBC_UPSTA3_CURRBK_Msk & ((value) << USBC_UPSTA3_CURRBK_Pos)))
/* -------- USBC_UPSTA4 : (USBC Offset: 0x540) Pipe Status Register -------- */
#define USBC_UPSTA4_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA4) Received IN Data Interrupt */
#define USBC_UPSTA4_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA4) Transmitted OUT Data Interrupt */
#define USBC_UPSTA4_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA4) Transmitted SETUP Interrupt */
#define USBC_UPSTA4_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA4) Pipe Error Interrupt */
#define USBC_UPSTA4_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA4) NAKed Interrupt */
#define USBC_UPSTA4_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA4) Errorflow Interrupt */
#define USBC_UPSTA4_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA4) Received STALLed Interrupt */
#define USBC_UPSTA4_DTSEQ_Pos       8
#define USBC_UPSTA4_DTSEQ_Msk       (0x3u << USBC_UPSTA4_DTSEQ_Pos) /**< \brief (USBC_UPSTA4) Data Toggle Sequence */
#define USBC_UPSTA4_DTSEQ(value)    ((USBC_UPSTA4_DTSEQ_Msk & ((value) << USBC_UPSTA4_DTSEQ_Pos)))
#define USBC_UPSTA4_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA4) Ram Access Error Interrupt */
#define USBC_UPSTA4_NBUSYBK_Pos     12
#define USBC_UPSTA4_NBUSYBK_Msk     (0x3u << USBC_UPSTA4_NBUSYBK_Pos) /**< \brief (USBC_UPSTA4) Number of Busy Bank */
#define USBC_UPSTA4_NBUSYBK(value)  ((USBC_UPSTA4_NBUSYBK_Msk & ((value) << USBC_UPSTA4_NBUSYBK_Pos)))
#define USBC_UPSTA4_CURRBK_Pos      14
#define USBC_UPSTA4_CURRBK_Msk      (0x3u << USBC_UPSTA4_CURRBK_Pos) /**< \brief (USBC_UPSTA4) Current Bank */
#define USBC_UPSTA4_CURRBK(value)   ((USBC_UPSTA4_CURRBK_Msk & ((value) << USBC_UPSTA4_CURRBK_Pos)))
/* -------- USBC_UPSTA5 : (USBC Offset: 0x544) Pipe Status Register -------- */
#define USBC_UPSTA5_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA5) Received IN Data Interrupt */
#define USBC_UPSTA5_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA5) Transmitted OUT Data Interrupt */
#define USBC_UPSTA5_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA5) Transmitted SETUP Interrupt */
#define USBC_UPSTA5_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA5) Pipe Error Interrupt */
#define USBC_UPSTA5_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA5) NAKed Interrupt */
#define USBC_UPSTA5_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA5) Errorflow Interrupt */
#define USBC_UPSTA5_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA5) Received STALLed Interrupt */
#define USBC_UPSTA5_DTSEQ_Pos       8
#define USBC_UPSTA5_DTSEQ_Msk       (0x3u << USBC_UPSTA5_DTSEQ_Pos) /**< \brief (USBC_UPSTA5) Data Toggle Sequence */
#define USBC_UPSTA5_DTSEQ(value)    ((USBC_UPSTA5_DTSEQ_Msk & ((value) << USBC_UPSTA5_DTSEQ_Pos)))
#define USBC_UPSTA5_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA5) Ram Access Error Interrupt */
#define USBC_UPSTA5_NBUSYBK_Pos     12
#define USBC_UPSTA5_NBUSYBK_Msk     (0x3u << USBC_UPSTA5_NBUSYBK_Pos) /**< \brief (USBC_UPSTA5) Number of Busy Bank */
#define USBC_UPSTA5_NBUSYBK(value)  ((USBC_UPSTA5_NBUSYBK_Msk & ((value) << USBC_UPSTA5_NBUSYBK_Pos)))
#define USBC_UPSTA5_CURRBK_Pos      14
#define USBC_UPSTA5_CURRBK_Msk      (0x3u << USBC_UPSTA5_CURRBK_Pos) /**< \brief (USBC_UPSTA5) Current Bank */
#define USBC_UPSTA5_CURRBK(value)   ((USBC_UPSTA5_CURRBK_Msk & ((value) << USBC_UPSTA5_CURRBK_Pos)))
/* -------- USBC_UPSTA6 : (USBC Offset: 0x548) Pipe Status Register -------- */
#define USBC_UPSTA6_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA6) Received IN Data Interrupt */
#define USBC_UPSTA6_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA6) Transmitted OUT Data Interrupt */
#define USBC_UPSTA6_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA6) Transmitted SETUP Interrupt */
#define USBC_UPSTA6_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA6) Pipe Error Interrupt */
#define USBC_UPSTA6_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA6) NAKed Interrupt */
#define USBC_UPSTA6_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA6) Errorflow Interrupt */
#define USBC_UPSTA6_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA6) Received STALLed Interrupt */
#define USBC_UPSTA6_DTSEQ_Pos       8
#define USBC_UPSTA6_DTSEQ_Msk       (0x3u << USBC_UPSTA6_DTSEQ_Pos) /**< \brief (USBC_UPSTA6) Data Toggle Sequence */
#define USBC_UPSTA6_DTSEQ(value)    ((USBC_UPSTA6_DTSEQ_Msk & ((value) << USBC_UPSTA6_DTSEQ_Pos)))
#define USBC_UPSTA6_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA6) Ram Access Error Interrupt */
#define USBC_UPSTA6_NBUSYBK_Pos     12
#define USBC_UPSTA6_NBUSYBK_Msk     (0x3u << USBC_UPSTA6_NBUSYBK_Pos) /**< \brief (USBC_UPSTA6) Number of Busy Bank */
#define USBC_UPSTA6_NBUSYBK(value)  ((USBC_UPSTA6_NBUSYBK_Msk & ((value) << USBC_UPSTA6_NBUSYBK_Pos)))
#define USBC_UPSTA6_CURRBK_Pos      14
#define USBC_UPSTA6_CURRBK_Msk      (0x3u << USBC_UPSTA6_CURRBK_Pos) /**< \brief (USBC_UPSTA6) Current Bank */
#define USBC_UPSTA6_CURRBK(value)   ((USBC_UPSTA6_CURRBK_Msk & ((value) << USBC_UPSTA6_CURRBK_Pos)))
/* -------- USBC_UPSTA7 : (USBC Offset: 0x54C) Pipe Status Register -------- */
#define USBC_UPSTA7_RXINI           (0x1u <<  0) /**< \brief (USBC_UPSTA7) Received IN Data Interrupt */
#define USBC_UPSTA7_TXOUTI          (0x1u <<  1) /**< \brief (USBC_UPSTA7) Transmitted OUT Data Interrupt */
#define USBC_UPSTA7_TXSTPI          (0x1u <<  2) /**< \brief (USBC_UPSTA7) Transmitted SETUP Interrupt */
#define USBC_UPSTA7_PERRI           (0x1u <<  3) /**< \brief (USBC_UPSTA7) Pipe Error Interrupt */
#define USBC_UPSTA7_NAKEDI          (0x1u <<  4) /**< \brief (USBC_UPSTA7) NAKed Interrupt */
#define USBC_UPSTA7_ERRORFI         (0x1u <<  5) /**< \brief (USBC_UPSTA7) Errorflow Interrupt */
#define USBC_UPSTA7_RXSTALLDI       (0x1u <<  6) /**< \brief (USBC_UPSTA7) Received STALLed Interrupt */
#define USBC_UPSTA7_DTSEQ_Pos       8
#define USBC_UPSTA7_DTSEQ_Msk       (0x3u << USBC_UPSTA7_DTSEQ_Pos) /**< \brief (USBC_UPSTA7) Data Toggle Sequence */
#define USBC_UPSTA7_DTSEQ(value)    ((USBC_UPSTA7_DTSEQ_Msk & ((value) << USBC_UPSTA7_DTSEQ_Pos)))
#define USBC_UPSTA7_RAMACERI        (0x1u << 10) /**< \brief (USBC_UPSTA7) Ram Access Error Interrupt */
#define USBC_UPSTA7_NBUSYBK_Pos     12
#define USBC_UPSTA7_NBUSYBK_Msk     (0x3u << USBC_UPSTA7_NBUSYBK_Pos) /**< \brief (USBC_UPSTA7) Number of Busy Bank */
#define USBC_UPSTA7_NBUSYBK(value)  ((USBC_UPSTA7_NBUSYBK_Msk & ((value) << USBC_UPSTA7_NBUSYBK_Pos)))
#define USBC_UPSTA7_CURRBK_Pos      14
#define USBC_UPSTA7_CURRBK_Msk      (0x3u << USBC_UPSTA7_CURRBK_Pos) /**< \brief (USBC_UPSTA7) Current Bank */
#define USBC_UPSTA7_CURRBK(value)   ((USBC_UPSTA7_CURRBK_Msk & ((value) << USBC_UPSTA7_CURRBK_Pos)))
/* -------- USBC_UPSTA0CLR : (USBC Offset: 0x560) Pipe Status Clear Register -------- */
#define USBC_UPSTA0CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA0CLR) RXINI Clear */
#define USBC_UPSTA0CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA0CLR) TXOUTI Clear */
#define USBC_UPSTA0CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA0CLR) TXSTPI Clear */
#define USBC_UPSTA0CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA0CLR) PERRI Clear */
#define USBC_UPSTA0CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA0CLR) NAKEDI Clear */
#define USBC_UPSTA0CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA0CLR) ERRORFI Clear */
#define USBC_UPSTA0CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA0CLR) RXSTALLDI Clear */
#define USBC_UPSTA0CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA0CLR) RAMACERI Clear */
/* -------- USBC_UPSTA1CLR : (USBC Offset: 0x564) Pipe Status Clear Register -------- */
#define USBC_UPSTA1CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA1CLR) RXINI Clear */
#define USBC_UPSTA1CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA1CLR) TXOUTI Clear */
#define USBC_UPSTA1CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA1CLR) TXSTPI Clear */
#define USBC_UPSTA1CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA1CLR) PERRI Clear */
#define USBC_UPSTA1CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA1CLR) NAKEDI Clear */
#define USBC_UPSTA1CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA1CLR) ERRORFI Clear */
#define USBC_UPSTA1CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA1CLR) RXSTALLDI Clear */
#define USBC_UPSTA1CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA1CLR) RAMACERI Clear */
/* -------- USBC_UPSTA2CLR : (USBC Offset: 0x568) Pipe Status Clear Register -------- */
#define USBC_UPSTA2CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA2CLR) RXINI Clear */
#define USBC_UPSTA2CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA2CLR) TXOUTI Clear */
#define USBC_UPSTA2CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA2CLR) TXSTPI Clear */
#define USBC_UPSTA2CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA2CLR) PERRI Clear */
#define USBC_UPSTA2CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA2CLR) NAKEDI Clear */
#define USBC_UPSTA2CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA2CLR) ERRORFI Clear */
#define USBC_UPSTA2CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA2CLR) RXSTALLDI Clear */
#define USBC_UPSTA2CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA2CLR) RAMACERI Clear */
/* -------- USBC_UPSTA3CLR : (USBC Offset: 0x56C) Pipe Status Clear Register -------- */
#define USBC_UPSTA3CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA3CLR) RXINI Clear */
#define USBC_UPSTA3CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA3CLR) TXOUTI Clear */
#define USBC_UPSTA3CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA3CLR) TXSTPI Clear */
#define USBC_UPSTA3CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA3CLR) PERRI Clear */
#define USBC_UPSTA3CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA3CLR) NAKEDI Clear */
#define USBC_UPSTA3CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA3CLR) ERRORFI Clear */
#define USBC_UPSTA3CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA3CLR) RXSTALLDI Clear */
#define USBC_UPSTA3CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA3CLR) RAMACERI Clear */
/* -------- USBC_UPSTA4CLR : (USBC Offset: 0x570) Pipe Status Clear Register -------- */
#define USBC_UPSTA4CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA4CLR) RXINI Clear */
#define USBC_UPSTA4CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA4CLR) TXOUTI Clear */
#define USBC_UPSTA4CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA4CLR) TXSTPI Clear */
#define USBC_UPSTA4CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA4CLR) PERRI Clear */
#define USBC_UPSTA4CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA4CLR) NAKEDI Clear */
#define USBC_UPSTA4CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA4CLR) ERRORFI Clear */
#define USBC_UPSTA4CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA4CLR) RXSTALLDI Clear */
