Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UPSTA4CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA4CLR) RAMACERI Clear */
/* -------- USBC_UPSTA5CLR : (USBC Offset: 0x574) Pipe Status Clear Register -------- */
#define USBC_UPSTA5CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA5CLR) RXINI Clear */
#define USBC_UPSTA5CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA5CLR) TXOUTI Clear */
#define USBC_UPSTA5CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA5CLR) TXSTPI Clear */
#define USBC_UPSTA5CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA5CLR) PERRI Clear */
#define USBC_UPSTA5CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA5CLR) NAKEDI Clear */
#define USBC_UPSTA5CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA5CLR) ERRORFI Clear */
#define USBC_UPSTA5CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA5CLR) RXSTALLDI Clear */
#define USBC_UPSTA5CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA5CLR) RAMACERI Clear */
/* -------- USBC_UPSTA6CLR : (USBC Offset: 0x578) Pipe Status Clear Register -------- */
#define USBC_UPSTA6CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA6CLR) RXINI Clear */
#define USBC_UPSTA6CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA6CLR) TXOUTI Clear */
#define USBC_UPSTA6CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA6CLR) TXSTPI Clear */
#define USBC_UPSTA6CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA6CLR) PERRI Clear */
#define USBC_UPSTA6CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA6CLR) NAKEDI Clear */
#define USBC_UPSTA6CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA6CLR) ERRORFI Clear */
#define USBC_UPSTA6CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA6CLR) RXSTALLDI Clear */
#define USBC_UPSTA6CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA6CLR) RAMACERI Clear */
/* -------- USBC_UPSTA7CLR : (USBC Offset: 0x57C) Pipe Status Clear Register -------- */
#define USBC_UPSTA7CLR_RXINIC       (0x1u <<  0) /**< \brief (USBC_UPSTA7CLR) RXINI Clear */
#define USBC_UPSTA7CLR_TXOUTIC      (0x1u <<  1) /**< \brief (USBC_UPSTA7CLR) TXOUTI Clear */
#define USBC_UPSTA7CLR_TXSTPIC      (0x1u <<  2) /**< \brief (USBC_UPSTA7CLR) TXSTPI Clear */
#define USBC_UPSTA7CLR_PERRIC       (0x1u <<  3) /**< \brief (USBC_UPSTA7CLR) PERRI Clear */
#define USBC_UPSTA7CLR_NAKEDIC      (0x1u <<  4) /**< \brief (USBC_UPSTA7CLR) NAKEDI Clear */
#define USBC_UPSTA7CLR_ERRORFIC     (0x1u <<  5) /**< \brief (USBC_UPSTA7CLR) ERRORFI Clear */
#define USBC_UPSTA7CLR_RXSTALLDIC   (0x1u <<  6) /**< \brief (USBC_UPSTA7CLR) RXSTALLDI Clear */
#define USBC_UPSTA7CLR_RAMACERIC    (0x1u << 10) /**< \brief (USBC_UPSTA7CLR) RAMACERI Clear */
/* -------- USBC_UPSTA0SET : (USBC Offset: 0x590) Pipe Status Set Register -------- */
#define USBC_UPSTA0SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA0SET) RXINI Set */
#define USBC_UPSTA0SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA0SET) TXOUTI Set */
#define USBC_UPSTA0SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA0SET) TXSTPI Set */
#define USBC_UPSTA0SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA0SET) PERRI Set */
#define USBC_UPSTA0SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA0SET) NAKEDI Set */
#define USBC_UPSTA0SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA0SET) ERRORFI Set */
#define USBC_UPSTA0SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA0SET) RXSTALLDI Set */
#define USBC_UPSTA0SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA0SET) RAMACERI Set */
/* -------- USBC_UPSTA1SET : (USBC Offset: 0x594) Pipe Status Set Register -------- */
#define USBC_UPSTA1SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA1SET) RXINI Set */
#define USBC_UPSTA1SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA1SET) TXOUTI Set */
#define USBC_UPSTA1SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA1SET) TXSTPI Set */
#define USBC_UPSTA1SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA1SET) PERRI Set */
#define USBC_UPSTA1SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA1SET) NAKEDI Set */
#define USBC_UPSTA1SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA1SET) ERRORFI Set */
#define USBC_UPSTA1SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA1SET) RXSTALLDI Set */
#define USBC_UPSTA1SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA1SET) RAMACERI Set */
/* -------- USBC_UPSTA2SET : (USBC Offset: 0x598) Pipe Status Set Register -------- */
#define USBC_UPSTA2SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA2SET) RXINI Set */
#define USBC_UPSTA2SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA2SET) TXOUTI Set */
#define USBC_UPSTA2SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA2SET) TXSTPI Set */
#define USBC_UPSTA2SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA2SET) PERRI Set */
#define USBC_UPSTA2SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA2SET) NAKEDI Set */
#define USBC_UPSTA2SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA2SET) ERRORFI Set */
#define USBC_UPSTA2SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA2SET) RXSTALLDI Set */
#define USBC_UPSTA2SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA2SET) RAMACERI Set */
/* -------- USBC_UPSTA3SET : (USBC Offset: 0x59C) Pipe Status Set Register -------- */
#define USBC_UPSTA3SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA3SET) RXINI Set */
#define USBC_UPSTA3SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA3SET) TXOUTI Set */
#define USBC_UPSTA3SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA3SET) TXSTPI Set */
#define USBC_UPSTA3SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA3SET) PERRI Set */
#define USBC_UPSTA3SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA3SET) NAKEDI Set */
#define USBC_UPSTA3SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA3SET) ERRORFI Set */
#define USBC_UPSTA3SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA3SET) RXSTALLDI Set */
#define USBC_UPSTA3SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA3SET) RAMACERI Set */
/* -------- USBC_UPSTA4SET : (USBC Offset: 0x5A0) Pipe Status Set Register -------- */
#define USBC_UPSTA4SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA4SET) RXINI Set */
#define USBC_UPSTA4SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA4SET) TXOUTI Set */
#define USBC_UPSTA4SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA4SET) TXSTPI Set */
#define USBC_UPSTA4SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA4SET) PERRI Set */
#define USBC_UPSTA4SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA4SET) NAKEDI Set */
#define USBC_UPSTA4SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA4SET) ERRORFI Set */
#define USBC_UPSTA4SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA4SET) RXSTALLDI Set */
#define USBC_UPSTA4SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA4SET) RAMACERI Set */
/* -------- USBC_UPSTA5SET : (USBC Offset: 0x5A4) Pipe Status Set Register -------- */
#define USBC_UPSTA5SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA5SET) RXINI Set */
#define USBC_UPSTA5SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA5SET) TXOUTI Set */
#define USBC_UPSTA5SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA5SET) TXSTPI Set */
#define USBC_UPSTA5SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA5SET) PERRI Set */
#define USBC_UPSTA5SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA5SET) NAKEDI Set */
#define USBC_UPSTA5SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA5SET) ERRORFI Set */
#define USBC_UPSTA5SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA5SET) RXSTALLDI Set */
#define USBC_UPSTA5SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA5SET) RAMACERI Set */
/* -------- USBC_UPSTA6SET : (USBC Offset: 0x5A8) Pipe Status Set Register -------- */
#define USBC_UPSTA6SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA6SET) RXINI Set */
#define USBC_UPSTA6SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA6SET) TXOUTI Set */
#define USBC_UPSTA6SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA6SET) TXSTPI Set */
#define USBC_UPSTA6SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA6SET) PERRI Set */
#define USBC_UPSTA6SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA6SET) NAKEDI Set */
#define USBC_UPSTA6SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA6SET) ERRORFI Set */
#define USBC_UPSTA6SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA6SET) RXSTALLDI Set */
#define USBC_UPSTA6SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA6SET) RAMACERI Set */
/* -------- USBC_UPSTA7SET : (USBC Offset: 0x5AC) Pipe Status Set Register -------- */
#define USBC_UPSTA7SET_RXINIS       (0x1u <<  0) /**< \brief (USBC_UPSTA7SET) RXINI Set */
#define USBC_UPSTA7SET_TXOUTIS      (0x1u <<  1) /**< \brief (USBC_UPSTA7SET) TXOUTI Set */
#define USBC_UPSTA7SET_TXSTPIS      (0x1u <<  2) /**< \brief (USBC_UPSTA7SET) TXSTPI Set */
#define USBC_UPSTA7SET_PERRIS       (0x1u <<  3) /**< \brief (USBC_UPSTA7SET) PERRI Set */
#define USBC_UPSTA7SET_NAKEDIS      (0x1u <<  4) /**< \brief (USBC_UPSTA7SET) NAKEDI Set */
#define USBC_UPSTA7SET_ERRORFIS     (0x1u <<  5) /**< \brief (USBC_UPSTA7SET) ERRORFI Set */
#define USBC_UPSTA7SET_RXSTALLDIS   (0x1u <<  6) /**< \brief (USBC_UPSTA7SET) RXSTALLDI Set */
#define USBC_UPSTA7SET_RAMACERIS    (0x1u << 10) /**< \brief (USBC_UPSTA7SET) RAMACERI Set */
/* -------- USBC_UPCON0 : (USBC Offset: 0x5C0) Pipe Control Register -------- */
#define USBC_UPCON0_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON0) RXIN Interrupt Enable */
#define USBC_UPCON0_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON0) TXOUT Interrupt Enable */
#define USBC_UPCON0_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON0) TXSTP Interrupt Enable */
#define USBC_UPCON0_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON0) PERR Interrupt Enable */
#define USBC_UPCON0_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON0) NAKED Interrupt Enable */
#define USBC_UPCON0_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON0) ERRORFI Interrupt Enable */
#define USBC_UPCON0_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON0) RXTALLD Interrupt Enable */
#define USBC_UPCON0_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON0) RAMACER Interrupt Enable */
#define USBC_UPCON0_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON0) NBUSYBKInterrupt Enable */
#define USBC_UPCON0_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON0) FIFO Control */
#define USBC_UPCON0_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON0) Pipe Freeze */
#define USBC_UPCON0_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON0) Data Toggle Initialization */
#define USBC_UPCON0_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON0) Bank Initialization */
/* -------- USBC_UPCON1 : (USBC Offset: 0x5C4) Pipe Control Register -------- */
#define USBC_UPCON1_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON1) RXIN Interrupt Enable */
#define USBC_UPCON1_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON1) TXOUT Interrupt Enable */
#define USBC_UPCON1_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON1) TXSTP Interrupt Enable */
#define USBC_UPCON1_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON1) PERR Interrupt Enable */
#define USBC_UPCON1_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON1) NAKED Interrupt Enable */
#define USBC_UPCON1_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON1) ERRORFI Interrupt Enable */
#define USBC_UPCON1_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON1) RXTALLD Interrupt Enable */
#define USBC_UPCON1_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON1) RAMACER Interrupt Enable */
#define USBC_UPCON1_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON1) NBUSYBKInterrupt Enable */
#define USBC_UPCON1_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON1) FIFO Control */
#define USBC_UPCON1_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON1) Pipe Freeze */
#define USBC_UPCON1_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON1) Data Toggle Initialization */
#define USBC_UPCON1_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON1) Bank Initialization */
/* -------- USBC_UPCON2 : (USBC Offset: 0x5C8) Pipe Control Register -------- */
#define USBC_UPCON2_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON2) RXIN Interrupt Enable */
#define USBC_UPCON2_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON2) TXOUT Interrupt Enable */
#define USBC_UPCON2_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON2) TXSTP Interrupt Enable */
#define USBC_UPCON2_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON2) PERR Interrupt Enable */
#define USBC_UPCON2_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON2) NAKED Interrupt Enable */
#define USBC_UPCON2_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON2) ERRORFI Interrupt Enable */
#define USBC_UPCON2_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON2) RXTALLD Interrupt Enable */
#define USBC_UPCON2_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON2) RAMACER Interrupt Enable */
#define USBC_UPCON2_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON2) NBUSYBKInterrupt Enable */
#define USBC_UPCON2_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON2) FIFO Control */
#define USBC_UPCON2_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON2) Pipe Freeze */
#define USBC_UPCON2_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON2) Data Toggle Initialization */
#define USBC_UPCON2_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON2) Bank Initialization */
/* -------- USBC_UPCON3 : (USBC Offset: 0x5CC) Pipe Control Register -------- */
#define USBC_UPCON3_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON3) RXIN Interrupt Enable */
#define USBC_UPCON3_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON3) TXOUT Interrupt Enable */
#define USBC_UPCON3_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON3) TXSTP Interrupt Enable */
#define USBC_UPCON3_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON3) PERR Interrupt Enable */
#define USBC_UPCON3_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON3) NAKED Interrupt Enable */
#define USBC_UPCON3_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON3) ERRORFI Interrupt Enable */
#define USBC_UPCON3_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON3) RXTALLD Interrupt Enable */
#define USBC_UPCON3_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON3) RAMACER Interrupt Enable */
#define USBC_UPCON3_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON3) NBUSYBKInterrupt Enable */
#define USBC_UPCON3_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON3) FIFO Control */
#define USBC_UPCON3_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON3) Pipe Freeze */
#define USBC_UPCON3_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON3) Data Toggle Initialization */
#define USBC_UPCON3_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON3) Bank Initialization */
/* -------- USBC_UPCON4 : (USBC Offset: 0x5D0) Pipe Control Register -------- */
#define USBC_UPCON4_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON4) RXIN Interrupt Enable */
#define USBC_UPCON4_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON4) TXOUT Interrupt Enable */
#define USBC_UPCON4_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON4) TXSTP Interrupt Enable */
#define USBC_UPCON4_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON4) PERR Interrupt Enable */
#define USBC_UPCON4_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON4) NAKED Interrupt Enable */
#define USBC_UPCON4_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON4) ERRORFI Interrupt Enable */
#define USBC_UPCON4_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON4) RXTALLD Interrupt Enable */
#define USBC_UPCON4_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON4) RAMACER Interrupt Enable */
#define USBC_UPCON4_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON4) NBUSYBKInterrupt Enable */
#define USBC_UPCON4_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON4) FIFO Control */
#define USBC_UPCON4_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON4) Pipe Freeze */
#define USBC_UPCON4_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON4) Data Toggle Initialization */
#define USBC_UPCON4_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON4) Bank Initialization */
/* -------- USBC_UPCON5 : (USBC Offset: 0x5D4) Pipe Control Register -------- */
#define USBC_UPCON5_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON5) RXIN Interrupt Enable */
#define USBC_UPCON5_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON5) TXOUT Interrupt Enable */
#define USBC_UPCON5_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON5) TXSTP Interrupt Enable */
#define USBC_UPCON5_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON5) PERR Interrupt Enable */
#define USBC_UPCON5_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON5) NAKED Interrupt Enable */
#define USBC_UPCON5_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON5) ERRORFI Interrupt Enable */
#define USBC_UPCON5_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON5) RXTALLD Interrupt Enable */
#define USBC_UPCON5_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON5) RAMACER Interrupt Enable */
#define USBC_UPCON5_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON5) NBUSYBKInterrupt Enable */
#define USBC_UPCON5_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON5) FIFO Control */
#define USBC_UPCON5_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON5) Pipe Freeze */
#define USBC_UPCON5_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON5) Data Toggle Initialization */
#define USBC_UPCON5_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON5) Bank Initialization */
/* -------- USBC_UPCON6 : (USBC Offset: 0x5D8) Pipe Control Register -------- */
#define USBC_UPCON6_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON6) RXIN Interrupt Enable */
#define USBC_UPCON6_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON6) TXOUT Interrupt Enable */
#define USBC_UPCON6_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON6) TXSTP Interrupt Enable */
#define USBC_UPCON6_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON6) PERR Interrupt Enable */
#define USBC_UPCON6_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON6) NAKED Interrupt Enable */
#define USBC_UPCON6_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON6) ERRORFI Interrupt Enable */
#define USBC_UPCON6_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON6) RXTALLD Interrupt Enable */
#define USBC_UPCON6_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON6) RAMACER Interrupt Enable */
#define USBC_UPCON6_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON6) NBUSYBKInterrupt Enable */
#define USBC_UPCON6_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON6) FIFO Control */
#define USBC_UPCON6_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON6) Pipe Freeze */
#define USBC_UPCON6_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON6) Data Toggle Initialization */
#define USBC_UPCON6_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON6) Bank Initialization */
/* -------- USBC_UPCON7 : (USBC Offset: 0x5DC) Pipe Control Register -------- */
#define USBC_UPCON7_RXINE           (0x1u <<  0) /**< \brief (USBC_UPCON7) RXIN Interrupt Enable */
#define USBC_UPCON7_TXOUTE          (0x1u <<  1) /**< \brief (USBC_UPCON7) TXOUT Interrupt Enable */
#define USBC_UPCON7_TXSTPE          (0x1u <<  2) /**< \brief (USBC_UPCON7) TXSTP Interrupt Enable */
#define USBC_UPCON7_PERRE           (0x1u <<  3) /**< \brief (USBC_UPCON7) PERR Interrupt Enable */
#define USBC_UPCON7_NAKEDE          (0x1u <<  4) /**< \brief (USBC_UPCON7) NAKED Interrupt Enable */
#define USBC_UPCON7_ERRORFIE        (0x1u <<  5) /**< \brief (USBC_UPCON7) ERRORFI Interrupt Enable */
#define USBC_UPCON7_RXSTALLDE       (0x1u <<  6) /**< \brief (USBC_UPCON7) RXTALLD Interrupt Enable */
#define USBC_UPCON7_RAMACERE        (0x1u << 10) /**< \brief (USBC_UPCON7) RAMACER Interrupt Enable */
#define USBC_UPCON7_NBUSYBKE        (0x1u << 12) /**< \brief (USBC_UPCON7) NBUSYBKInterrupt Enable */
#define USBC_UPCON7_FIFOCON         (0x1u << 14) /**< \brief (USBC_UPCON7) FIFO Control */
#define USBC_UPCON7_PFREEZE         (0x1u << 17) /**< \brief (USBC_UPCON7) Pipe Freeze */
#define USBC_UPCON7_INITDTGL        (0x1u << 18) /**< \brief (USBC_UPCON7) Data Toggle Initialization */
#define USBC_UPCON7_INITBK          (0x1u << 19) /**< \brief (USBC_UPCON7) Bank Initialization */
/* -------- USBC_UPCON0SET : (USBC Offset: 0x5F0) Pipe Control Set Register -------- */
#define USBC_UPCON0SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON0SET) RXINE Set */
#define USBC_UPCON0SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON0SET) TXOUTE Set */
#define USBC_UPCON0SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON0SET) TXSTPE Set */
#define USBC_UPCON0SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON0SET) PERRE Set */
#define USBC_UPCON0SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON0SET) NAKEDE Set */
#define USBC_UPCON0SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON0SET) ERRORFIE Set */
#define USBC_UPCON0SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON0SET) RXSTALLDE Set */
#define USBC_UPCON0SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON0SET) RAMACERE Set */
#define USBC_UPCON0SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON0SET) NBUSYBKE Set */
#define USBC_UPCON0SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON0SET) FIFOCON Set */
#define USBC_UPCON0SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON0SET) PFREEZE Set */
#define USBC_UPCON0SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON0SET) INITDTGL Set */
#define USBC_UPCON0SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON0SET) INITBK Set */
/* -------- USBC_UPCON1SET : (USBC Offset: 0x5F4) Pipe Control Set Register -------- */
#define USBC_UPCON1SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON1SET) RXINE Set */
#define USBC_UPCON1SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON1SET) TXOUTE Set */
#define USBC_UPCON1SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON1SET) TXSTPE Set */
#define USBC_UPCON1SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON1SET) PERRE Set */
#define USBC_UPCON1SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON1SET) NAKEDE Set */
#define USBC_UPCON1SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON1SET) ERRORFIE Set */
#define USBC_UPCON1SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON1SET) RXSTALLDE Set */
#define USBC_UPCON1SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON1SET) RAMACERE Set */
#define USBC_UPCON1SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON1SET) NBUSYBKE Set */
#define USBC_UPCON1SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON1SET) FIFOCON Set */
#define USBC_UPCON1SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON1SET) PFREEZE Set */
#define USBC_UPCON1SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON1SET) INITDTGL Set */
#define USBC_UPCON1SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON1SET) INITBK Set */
/* -------- USBC_UPCON2SET : (USBC Offset: 0x5F8) Pipe Control Set Register -------- */
#define USBC_UPCON2SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON2SET) RXINE Set */
#define USBC_UPCON2SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON2SET) TXOUTE Set */
#define USBC_UPCON2SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON2SET) TXSTPE Set */
#define USBC_UPCON2SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON2SET) PERRE Set */
#define USBC_UPCON2SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON2SET) NAKEDE Set */
#define USBC_UPCON2SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON2SET) ERRORFIE Set */
#define USBC_UPCON2SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON2SET) RXSTALLDE Set */
#define USBC_UPCON2SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON2SET) RAMACERE Set */
