Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UPCON2SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON2SET) NBUSYBKE Set */
#define USBC_UPCON2SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON2SET) FIFOCON Set */
#define USBC_UPCON2SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON2SET) PFREEZE Set */
#define USBC_UPCON2SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON2SET) INITDTGL Set */
#define USBC_UPCON2SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON2SET) INITBK Set */
/* -------- USBC_UPCON3SET : (USBC Offset: 0x5FC) Pipe Control Set Register -------- */
#define USBC_UPCON3SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON3SET) RXINE Set */
#define USBC_UPCON3SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON3SET) TXOUTE Set */
#define USBC_UPCON3SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON3SET) TXSTPE Set */
#define USBC_UPCON3SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON3SET) PERRE Set */
#define USBC_UPCON3SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON3SET) NAKEDE Set */
#define USBC_UPCON3SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON3SET) ERRORFIE Set */
#define USBC_UPCON3SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON3SET) RXSTALLDE Set */
#define USBC_UPCON3SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON3SET) RAMACERE Set */
#define USBC_UPCON3SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON3SET) NBUSYBKE Set */
#define USBC_UPCON3SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON3SET) FIFOCON Set */
#define USBC_UPCON3SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON3SET) PFREEZE Set */
#define USBC_UPCON3SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON3SET) INITDTGL Set */
#define USBC_UPCON3SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON3SET) INITBK Set */
/* -------- USBC_UPCON4SET : (USBC Offset: 0x600) Pipe Control Set Register -------- */
#define USBC_UPCON4SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON4SET) RXINE Set */
#define USBC_UPCON4SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON4SET) TXOUTE Set */
#define USBC_UPCON4SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON4SET) TXSTPE Set */
#define USBC_UPCON4SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON4SET) PERRE Set */
#define USBC_UPCON4SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON4SET) NAKEDE Set */
#define USBC_UPCON4SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON4SET) ERRORFIE Set */
#define USBC_UPCON4SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON4SET) RXSTALLDE Set */
#define USBC_UPCON4SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON4SET) RAMACERE Set */
#define USBC_UPCON4SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON4SET) NBUSYBKE Set */
#define USBC_UPCON4SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON4SET) FIFOCON Set */
#define USBC_UPCON4SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON4SET) PFREEZE Set */
#define USBC_UPCON4SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON4SET) INITDTGL Set */
#define USBC_UPCON4SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON4SET) INITBK Set */
/* -------- USBC_UPCON5SET : (USBC Offset: 0x604) Pipe Control Set Register -------- */
#define USBC_UPCON5SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON5SET) RXINE Set */
#define USBC_UPCON5SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON5SET) TXOUTE Set */
#define USBC_UPCON5SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON5SET) TXSTPE Set */
#define USBC_UPCON5SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON5SET) PERRE Set */
#define USBC_UPCON5SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON5SET) NAKEDE Set */
#define USBC_UPCON5SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON5SET) ERRORFIE Set */
#define USBC_UPCON5SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON5SET) RXSTALLDE Set */
#define USBC_UPCON5SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON5SET) RAMACERE Set */
#define USBC_UPCON5SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON5SET) NBUSYBKE Set */
#define USBC_UPCON5SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON5SET) FIFOCON Set */
#define USBC_UPCON5SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON5SET) PFREEZE Set */
#define USBC_UPCON5SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON5SET) INITDTGL Set */
#define USBC_UPCON5SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON5SET) INITBK Set */
/* -------- USBC_UPCON6SET : (USBC Offset: 0x608) Pipe Control Set Register -------- */
#define USBC_UPCON6SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON6SET) RXINE Set */
#define USBC_UPCON6SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON6SET) TXOUTE Set */
#define USBC_UPCON6SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON6SET) TXSTPE Set */
#define USBC_UPCON6SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON6SET) PERRE Set */
#define USBC_UPCON6SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON6SET) NAKEDE Set */
#define USBC_UPCON6SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON6SET) ERRORFIE Set */
#define USBC_UPCON6SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON6SET) RXSTALLDE Set */
#define USBC_UPCON6SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON6SET) RAMACERE Set */
#define USBC_UPCON6SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON6SET) NBUSYBKE Set */
#define USBC_UPCON6SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON6SET) FIFOCON Set */
#define USBC_UPCON6SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON6SET) PFREEZE Set */
#define USBC_UPCON6SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON6SET) INITDTGL Set */
#define USBC_UPCON6SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON6SET) INITBK Set */
/* -------- USBC_UPCON7SET : (USBC Offset: 0x60C) Pipe Control Set Register -------- */
#define USBC_UPCON7SET_RXINES       (0x1u <<  0) /**< \brief (USBC_UPCON7SET) RXINE Set */
#define USBC_UPCON7SET_TXOUTES      (0x1u <<  1) /**< \brief (USBC_UPCON7SET) TXOUTE Set */
#define USBC_UPCON7SET_TXSTPES      (0x1u <<  2) /**< \brief (USBC_UPCON7SET) TXSTPE Set */
#define USBC_UPCON7SET_PERRES       (0x1u <<  3) /**< \brief (USBC_UPCON7SET) PERRE Set */
#define USBC_UPCON7SET_NAKEDES      (0x1u <<  4) /**< \brief (USBC_UPCON7SET) NAKEDE Set */
#define USBC_UPCON7SET_ERRORFIES    (0x1u <<  5) /**< \brief (USBC_UPCON7SET) ERRORFIE Set */
#define USBC_UPCON7SET_RXSTALLDES   (0x1u <<  6) /**< \brief (USBC_UPCON7SET) RXSTALLDE Set */
#define USBC_UPCON7SET_RAMACERES    (0x1u << 10) /**< \brief (USBC_UPCON7SET) RAMACERE Set */
#define USBC_UPCON7SET_NBUSYBKES    (0x1u << 12) /**< \brief (USBC_UPCON7SET) NBUSYBKE Set */
#define USBC_UPCON7SET_FIFOCONS     (0x1u << 14) /**< \brief (USBC_UPCON7SET) FIFOCON Set */
#define USBC_UPCON7SET_PFREEZES     (0x1u << 17) /**< \brief (USBC_UPCON7SET) PFREEZE Set */
#define USBC_UPCON7SET_INITDTGLS    (0x1u << 18) /**< \brief (USBC_UPCON7SET) INITDTGL Set */
#define USBC_UPCON7SET_INITBKS      (0x1u << 19) /**< \brief (USBC_UPCON7SET) INITBK Set */
/* -------- USBC_UPCON0CLR : (USBC Offset: 0x620) Pipe Control Clear Register -------- */
#define USBC_UPCON0CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON0CLR) RXINE Clear */
#define USBC_UPCON0CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON0CLR) TXOUTE Clear */
#define USBC_UPCON0CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON0CLR) TXSTPE Clear */
#define USBC_UPCON0CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON0CLR) PERRE Clear */
#define USBC_UPCON0CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON0CLR) NAKEDE Clear */
#define USBC_UPCON0CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON0CLR) ERRORFIE Clear */
#define USBC_UPCON0CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON0CLR) RXTALLDE Clear */
#define USBC_UPCON0CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON0CLR) RAMACERE Clear */
#define USBC_UPCON0CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON0CLR) NBUSYBKE Clear */
#define USBC_UPCON0CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON0CLR) FIFOCON Clear */
#define USBC_UPCON0CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON0CLR) PFREEZE Clear */
#define USBC_UPCON0CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON0CLR) INITDTGL Clear */
#define USBC_UPCON0CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON0CLR) INITBK Clear */
/* -------- USBC_UPCON1CLR : (USBC Offset: 0x624) Pipe Control Clear Register -------- */
#define USBC_UPCON1CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON1CLR) RXINE Clear */
#define USBC_UPCON1CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON1CLR) TXOUTE Clear */
#define USBC_UPCON1CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON1CLR) TXSTPE Clear */
#define USBC_UPCON1CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON1CLR) PERRE Clear */
#define USBC_UPCON1CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON1CLR) NAKEDE Clear */
#define USBC_UPCON1CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON1CLR) ERRORFIE Clear */
#define USBC_UPCON1CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON1CLR) RXTALLDE Clear */
#define USBC_UPCON1CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON1CLR) RAMACERE Clear */
#define USBC_UPCON1CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON1CLR) NBUSYBKE Clear */
#define USBC_UPCON1CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON1CLR) FIFOCON Clear */
#define USBC_UPCON1CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON1CLR) PFREEZE Clear */
#define USBC_UPCON1CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON1CLR) INITDTGL Clear */
#define USBC_UPCON1CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON1CLR) INITBK Clear */
/* -------- USBC_UPCON2CLR : (USBC Offset: 0x628) Pipe Control Clear Register -------- */
#define USBC_UPCON2CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON2CLR) RXINE Clear */
#define USBC_UPCON2CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON2CLR) TXOUTE Clear */
#define USBC_UPCON2CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON2CLR) TXSTPE Clear */
#define USBC_UPCON2CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON2CLR) PERRE Clear */
#define USBC_UPCON2CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON2CLR) NAKEDE Clear */
#define USBC_UPCON2CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON2CLR) ERRORFIE Clear */
#define USBC_UPCON2CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON2CLR) RXTALLDE Clear */
#define USBC_UPCON2CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON2CLR) RAMACERE Clear */
#define USBC_UPCON2CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON2CLR) NBUSYBKE Clear */
#define USBC_UPCON2CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON2CLR) FIFOCON Clear */
#define USBC_UPCON2CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON2CLR) PFREEZE Clear */
#define USBC_UPCON2CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON2CLR) INITDTGL Clear */
#define USBC_UPCON2CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON2CLR) INITBK Clear */
/* -------- USBC_UPCON3CLR : (USBC Offset: 0x62C) Pipe Control Clear Register -------- */
#define USBC_UPCON3CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON3CLR) RXINE Clear */
#define USBC_UPCON3CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON3CLR) TXOUTE Clear */
#define USBC_UPCON3CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON3CLR) TXSTPE Clear */
#define USBC_UPCON3CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON3CLR) PERRE Clear */
#define USBC_UPCON3CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON3CLR) NAKEDE Clear */
#define USBC_UPCON3CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON3CLR) ERRORFIE Clear */
#define USBC_UPCON3CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON3CLR) RXTALLDE Clear */
#define USBC_UPCON3CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON3CLR) RAMACERE Clear */
#define USBC_UPCON3CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON3CLR) NBUSYBKE Clear */
#define USBC_UPCON3CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON3CLR) FIFOCON Clear */
#define USBC_UPCON3CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON3CLR) PFREEZE Clear */
#define USBC_UPCON3CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON3CLR) INITDTGL Clear */
#define USBC_UPCON3CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON3CLR) INITBK Clear */
/* -------- USBC_UPCON4CLR : (USBC Offset: 0x630) Pipe Control Clear Register -------- */
#define USBC_UPCON4CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON4CLR) RXINE Clear */
#define USBC_UPCON4CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON4CLR) TXOUTE Clear */
#define USBC_UPCON4CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON4CLR) TXSTPE Clear */
#define USBC_UPCON4CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON4CLR) PERRE Clear */
#define USBC_UPCON4CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON4CLR) NAKEDE Clear */
#define USBC_UPCON4CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON4CLR) ERRORFIE Clear */
#define USBC_UPCON4CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON4CLR) RXTALLDE Clear */
#define USBC_UPCON4CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON4CLR) RAMACERE Clear */
#define USBC_UPCON4CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON4CLR) NBUSYBKE Clear */
#define USBC_UPCON4CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON4CLR) FIFOCON Clear */
#define USBC_UPCON4CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON4CLR) PFREEZE Clear */
#define USBC_UPCON4CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON4CLR) INITDTGL Clear */
#define USBC_UPCON4CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON4CLR) INITBK Clear */
/* -------- USBC_UPCON5CLR : (USBC Offset: 0x634) Pipe Control Clear Register -------- */
#define USBC_UPCON5CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON5CLR) RXINE Clear */
#define USBC_UPCON5CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON5CLR) TXOUTE Clear */
#define USBC_UPCON5CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON5CLR) TXSTPE Clear */
#define USBC_UPCON5CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON5CLR) PERRE Clear */
#define USBC_UPCON5CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON5CLR) NAKEDE Clear */
#define USBC_UPCON5CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON5CLR) ERRORFIE Clear */
#define USBC_UPCON5CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON5CLR) RXTALLDE Clear */
#define USBC_UPCON5CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON5CLR) RAMACERE Clear */
#define USBC_UPCON5CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON5CLR) NBUSYBKE Clear */
#define USBC_UPCON5CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON5CLR) FIFOCON Clear */
#define USBC_UPCON5CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON5CLR) PFREEZE Clear */
#define USBC_UPCON5CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON5CLR) INITDTGL Clear */
#define USBC_UPCON5CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON5CLR) INITBK Clear */
/* -------- USBC_UPCON6CLR : (USBC Offset: 0x638) Pipe Control Clear Register -------- */
#define USBC_UPCON6CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON6CLR) RXINE Clear */
#define USBC_UPCON6CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON6CLR) TXOUTE Clear */
#define USBC_UPCON6CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON6CLR) TXSTPE Clear */
#define USBC_UPCON6CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON6CLR) PERRE Clear */
#define USBC_UPCON6CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON6CLR) NAKEDE Clear */
#define USBC_UPCON6CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON6CLR) ERRORFIE Clear */
#define USBC_UPCON6CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON6CLR) RXTALLDE Clear */
#define USBC_UPCON6CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON6CLR) RAMACERE Clear */
#define USBC_UPCON6CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON6CLR) NBUSYBKE Clear */
#define USBC_UPCON6CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON6CLR) FIFOCON Clear */
#define USBC_UPCON6CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON6CLR) PFREEZE Clear */
#define USBC_UPCON6CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON6CLR) INITDTGL Clear */
#define USBC_UPCON6CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON6CLR) INITBK Clear */
/* -------- USBC_UPCON7CLR : (USBC Offset: 0x63C) Pipe Control Clear Register -------- */
#define USBC_UPCON7CLR_RXINEC       (0x1u <<  0) /**< \brief (USBC_UPCON7CLR) RXINE Clear */
#define USBC_UPCON7CLR_TXOUTEC      (0x1u <<  1) /**< \brief (USBC_UPCON7CLR) TXOUTE Clear */
#define USBC_UPCON7CLR_TXSTPEC      (0x1u <<  2) /**< \brief (USBC_UPCON7CLR) TXSTPE Clear */
#define USBC_UPCON7CLR_PERREC       (0x1u <<  3) /**< \brief (USBC_UPCON7CLR) PERRE Clear */
#define USBC_UPCON7CLR_NAKEDEC      (0x1u <<  4) /**< \brief (USBC_UPCON7CLR) NAKEDE Clear */
#define USBC_UPCON7CLR_ERRORFIEC    (0x1u <<  5) /**< \brief (USBC_UPCON7CLR) ERRORFIE Clear */
#define USBC_UPCON7CLR_RXSTALLDEC   (0x1u <<  6) /**< \brief (USBC_UPCON7CLR) RXTALLDE Clear */
#define USBC_UPCON7CLR_RAMACEREC    (0x1u << 10) /**< \brief (USBC_UPCON7CLR) RAMACERE Clear */
#define USBC_UPCON7CLR_NBUSYBKEC    (0x1u << 12) /**< \brief (USBC_UPCON7CLR) NBUSYBKE Clear */
#define USBC_UPCON7CLR_FIFOCONC     (0x1u << 14) /**< \brief (USBC_UPCON7CLR) FIFOCON Clear */
#define USBC_UPCON7CLR_PFREEZEC     (0x1u << 17) /**< \brief (USBC_UPCON7CLR) PFREEZE Clear */
#define USBC_UPCON7CLR_INITDTGLC    (0x1u << 18) /**< \brief (USBC_UPCON7CLR) INITDTGL Clear */
#define USBC_UPCON7CLR_INITBKC      (0x1u << 19) /**< \brief (USBC_UPCON7CLR) INITBK Clear */
/* -------- USBC_UPINRQ0 : (USBC Offset: 0x650) Pipe In Request -------- */
#define USBC_UPINRQ0_INRQ_Pos       0
#define USBC_UPINRQ0_INRQ_Msk       (0xFFu << USBC_UPINRQ0_INRQ_Pos) /**< \brief (USBC_UPINRQ0) IN Request Number before Freeze */
#define USBC_UPINRQ0_INRQ(value)    ((USBC_UPINRQ0_INRQ_Msk & ((value) << USBC_UPINRQ0_INRQ_Pos)))
#define USBC_UPINRQ0_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ0) IN Request Mode */
/* -------- USBC_UPINRQ1 : (USBC Offset: 0x654) Pipe In Request -------- */
#define USBC_UPINRQ1_INRQ_Pos       0
#define USBC_UPINRQ1_INRQ_Msk       (0xFFu << USBC_UPINRQ1_INRQ_Pos) /**< \brief (USBC_UPINRQ1) IN Request Number before Freeze */
#define USBC_UPINRQ1_INRQ(value)    ((USBC_UPINRQ1_INRQ_Msk & ((value) << USBC_UPINRQ1_INRQ_Pos)))
#define USBC_UPINRQ1_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ1) IN Request Mode */
/* -------- USBC_UPINRQ2 : (USBC Offset: 0x658) Pipe In Request -------- */
#define USBC_UPINRQ2_INRQ_Pos       0
#define USBC_UPINRQ2_INRQ_Msk       (0xFFu << USBC_UPINRQ2_INRQ_Pos) /**< \brief (USBC_UPINRQ2) IN Request Number before Freeze */
#define USBC_UPINRQ2_INRQ(value)    ((USBC_UPINRQ2_INRQ_Msk & ((value) << USBC_UPINRQ2_INRQ_Pos)))
#define USBC_UPINRQ2_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ2) IN Request Mode */
/* -------- USBC_UPINRQ3 : (USBC Offset: 0x65C) Pipe In Request -------- */
#define USBC_UPINRQ3_INRQ_Pos       0
#define USBC_UPINRQ3_INRQ_Msk       (0xFFu << USBC_UPINRQ3_INRQ_Pos) /**< \brief (USBC_UPINRQ3) IN Request Number before Freeze */
#define USBC_UPINRQ3_INRQ(value)    ((USBC_UPINRQ3_INRQ_Msk & ((value) << USBC_UPINRQ3_INRQ_Pos)))
#define USBC_UPINRQ3_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ3) IN Request Mode */
/* -------- USBC_UPINRQ4 : (USBC Offset: 0x660) Pipe In Request -------- */
#define USBC_UPINRQ4_INRQ_Pos       0
#define USBC_UPINRQ4_INRQ_Msk       (0xFFu << USBC_UPINRQ4_INRQ_Pos) /**< \brief (USBC_UPINRQ4) IN Request Number before Freeze */
#define USBC_UPINRQ4_INRQ(value)    ((USBC_UPINRQ4_INRQ_Msk & ((value) << USBC_UPINRQ4_INRQ_Pos)))
#define USBC_UPINRQ4_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ4) IN Request Mode */
/* -------- USBC_UPINRQ5 : (USBC Offset: 0x664) Pipe In Request -------- */
#define USBC_UPINRQ5_INRQ_Pos       0
#define USBC_UPINRQ5_INRQ_Msk       (0xFFu << USBC_UPINRQ5_INRQ_Pos) /**< \brief (USBC_UPINRQ5) IN Request Number before Freeze */
#define USBC_UPINRQ5_INRQ(value)    ((USBC_UPINRQ5_INRQ_Msk & ((value) << USBC_UPINRQ5_INRQ_Pos)))
#define USBC_UPINRQ5_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ5) IN Request Mode */
/* -------- USBC_UPINRQ6 : (USBC Offset: 0x668) Pipe In Request -------- */
#define USBC_UPINRQ6_INRQ_Pos       0
#define USBC_UPINRQ6_INRQ_Msk       (0xFFu << USBC_UPINRQ6_INRQ_Pos) /**< \brief (USBC_UPINRQ6) IN Request Number before Freeze */
#define USBC_UPINRQ6_INRQ(value)    ((USBC_UPINRQ6_INRQ_Msk & ((value) << USBC_UPINRQ6_INRQ_Pos)))
#define USBC_UPINRQ6_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ6) IN Request Mode */
/* -------- USBC_UPINRQ7 : (USBC Offset: 0x66C) Pipe In Request -------- */
#define USBC_UPINRQ7_INRQ_Pos       0
#define USBC_UPINRQ7_INRQ_Msk       (0xFFu << USBC_UPINRQ7_INRQ_Pos) /**< \brief (USBC_UPINRQ7) IN Request Number before Freeze */
#define USBC_UPINRQ7_INRQ(value)    ((USBC_UPINRQ7_INRQ_Msk & ((value) << USBC_UPINRQ7_INRQ_Pos)))
#define USBC_UPINRQ7_INMODE         (0x1u <<  8) /**< \brief (USBC_UPINRQ7) IN Request Mode */
/* -------- USBC_USBCON : (USBC Offset: 0x800) General Control Register -------- */
#define USBC_USBCON_FRZCLK          (0x1u << 14) /**< \brief (USBC_USBCON) Freeze USB Clock */
#define USBC_USBCON_USBE            (0x1u << 15) /**< \brief (USBC_USBCON) USBC Enable */
#define USBC_USBCON_UIMOD           (0x1u << 24) /**< \brief (USBC_USBCON) USBC Mode */
/* -------- USBC_USBSTA : (USBC Offset: 0x804) General Status Register -------- */
#define USBC_USBSTA_VBUSRQ          (0x1u <<  9) /**< \brief (USBC_USBSTA) VBus Request */
#define USBC_USBSTA_SPEED_Pos       12
#define USBC_USBSTA_SPEED_Msk       (0x3u << USBC_USBSTA_SPEED_Pos) /**< \brief (USBC_USBSTA) Speed Status */
#define USBC_USBSTA_SPEED(value)    ((USBC_USBSTA_SPEED_Msk & ((value) << USBC_USBSTA_SPEED_Pos)))
#define   USBC_USBSTA_SPEED_FULL    (0x0u << 12) /**< \brief (USBC_USBSTA)  */
#define   USBC_USBSTA_SPEED_HIGH    (0x1u << 12) /**< \brief (USBC_USBSTA)  */
#define   USBC_USBSTA_SPEED_LOW     (0x2u << 12) /**< \brief (USBC_USBSTA)  */
#define USBC_USBSTA_CLKUSABLE       (0x1u << 14) /**< \brief (USBC_USBSTA) USB Clock Usable */
#define USBC_USBSTA_SUSPEND         (0x1u << 16) /**< \brief (USBC_USBSTA) Suspend module state */
/* -------- USBC_USBSTACLR : (USBC Offset: 0x808) General Status Clear Register -------- */
#define USBC_USBSTACLR_RAMACERIC    (0x1u <<  8) /**< \brief (USBC_USBSTACLR) RAMACERI Clear */
#define USBC_USBSTACLR_VBUSRQC      (0x1u <<  9) /**< \brief (USBC_USBSTACLR) VBUSRQ Clear */
/* -------- USBC_USBSTASET : (USBC Offset: 0x80C) General Status Set Register -------- */
#define USBC_USBSTASET_RAMACERIS    (0x1u <<  8) /**< \brief (USBC_USBSTASET) RAMACERI Set */
#define USBC_USBSTASET_VBUSRQS      (0x1u <<  9) /**< \brief (USBC_USBSTASET) VBUSRQ Set */
/* -------- USBC_UVERS : (USBC Offset: 0x818) IP Version Register -------- */
#define USBC_UVERS_VERSION_Pos      0
#define USBC_UVERS_VERSION_Msk      (0xFFFu << USBC_UVERS_VERSION_Pos) /**< \brief (USBC_UVERS) Version Number */
#define USBC_UVERS_VERSION(value)   ((USBC_UVERS_VERSION_Msk & ((value) << USBC_UVERS_VERSION_Pos)))
#define USBC_UVERS_VARIANT_Pos      16
#define USBC_UVERS_VARIANT_Msk      (0x7u << USBC_UVERS_VARIANT_Pos) /**< \brief (USBC_UVERS) Variant Number */
#define USBC_UVERS_VARIANT(value)   ((USBC_UVERS_VARIANT_Msk & ((value) << USBC_UVERS_VARIANT_Pos)))
/* -------- USBC_UFEATURES : (USBC Offset: 0x81C) IP Features Register -------- */
#define USBC_UFEATURES_EPTNBRMAX_Pos    0
#define USBC_UFEATURES_EPTNBRMAX_Msk    (0xFu << USBC_UFEATURES_EPTNBRMAX_Pos) /**< \brief (USBC_UFEATURES) Maximum Number of Pipes/Endpints */
