Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define USBC_UFEATURES_EPTNBRMAX(value) ((USBC_UFEATURES_EPTNBRMAX_Msk & ((value) << USBC_UFEATURES_EPTNBRMAX_Pos)))
#define USBC_UFEATURES_UTMIMODE     (0x1u <<  8) /**< \brief (USBC_UFEATURES) UTMI Mode */
/* -------- USBC_UADDRSIZE : (USBC Offset: 0x820) IP PB address size Register -------- */
#define USBC_UADDRSIZE_UADDRSIZE_Pos    0
#define USBC_UADDRSIZE_UADDRSIZE_Msk    (0xFFFFFFFFu << USBC_UADDRSIZE_UADDRSIZE_Pos) /**< \brief (USBC_UADDRSIZE) IP PB Address Size */
#define USBC_UADDRSIZE_UADDRSIZE(value) ((USBC_UADDRSIZE_UADDRSIZE_Msk & ((value) << USBC_UADDRSIZE_UADDRSIZE_Pos)))
/* -------- USBC_UNAME1 : (USBC Offset: 0x824) IP Name Part One: HUSB -------- */
#define USBC_UNAME1_UNAME1_Pos      0
#define USBC_UNAME1_UNAME1_Msk      (0xFFFFFFFFu << USBC_UNAME1_UNAME1_Pos) /**< \brief (USBC_UNAME1) IP Name Part One */
#define USBC_UNAME1_UNAME1(value)   ((USBC_UNAME1_UNAME1_Msk & ((value) << USBC_UNAME1_UNAME1_Pos)))
/* -------- USBC_UNAME2 : (USBC Offset: 0x828) IP Name Part Two: HOST -------- */
#define USBC_UNAME2_UNAME2_Pos      0
#define USBC_UNAME2_UNAME2_Msk      (0xFFFFFFFFu << USBC_UNAME2_UNAME2_Pos) /**< \brief (USBC_UNAME2) IP Name Part Two */
#define USBC_UNAME2_UNAME2(value)   ((USBC_UNAME2_UNAME2_Msk & ((value) << USBC_UNAME2_UNAME2_Pos)))
/* -------- USBC_USBFSM : (USBC Offset: 0x82C) USB internal finite state machine -------- */
#define USBC_USBFSM_DRDSTATE_Pos    0
#define USBC_USBFSM_DRDSTATE_Msk    (0xFu << USBC_USBFSM_DRDSTATE_Pos) /**< \brief (USBC_USBFSM) DualRoleDevice state */
#define USBC_USBFSM_DRDSTATE(value) ((USBC_USBFSM_DRDSTATE_Msk & ((value) << USBC_USBFSM_DRDSTATE_Pos)))
#define   USBC_USBFSM_DRDSTATE_A_IDLE (0x0u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_WAIT_VRISE (0x1u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_WAIT_BCON (0x2u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_HOST (0x3u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_SUSPEND (0x4u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_PERIPHERAL (0x5u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_WAIT_VFALL (0x6u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_VBUS_ERR (0x7u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_A_WAIT_DISCHARGE (0x8u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_IDLE (0x9u <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_PERIPHERAL (0xAu <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_WAIT_BEGIN_HNP (0xBu <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_WAIT_DISCHARGE (0xCu <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_WAIT_ACON (0xDu <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_HOST (0xEu <<  0) /**< \brief (USBC_USBFSM)  */
#define   USBC_USBFSM_DRDSTATE_B_SRP_INIT (0xFu <<  0) /**< \brief (USBC_USBFSM)  */
/* -------- USBC_UDESC : (USBC Offset: 0x830) Endpoint descriptor table -------- */
#define USBC_UDESC_UDESCA_Pos       0
#define USBC_UDESC_UDESCA_Msk       (0xFFFFFFFFu << USBC_UDESC_UDESCA_Pos) /**< \brief (USBC_UDESC) USB Descriptor Address */
#define USBC_UDESC_UDESCA(value)    ((USBC_UDESC_UDESCA_Msk & ((value) << USBC_UDESC_UDESCA_Pos)))

/*@}*/

/* ============================================================================= */
/**  SOFTWARE API DEFINITION FOR WDT */
/* ============================================================================= */
/** \addtogroup SAM4L4_WDT Watchdog Timer */
/*@{*/

#define REV_WDT        0x501

#ifndef __ASSEMBLY__
/** \brief WDT hardware registers */
typedef struct {
  RwReg   CTRL;        /**< \brief (WDT Offset: 0x000) Control Register */
  WoReg   CLR;         /**< \brief (WDT Offset: 0x004) Clear Register */
  RoReg   SR;          /**< \brief (WDT Offset: 0x008) Status Register */
  WoReg   IER;         /**< \brief (WDT Offset: 0x00C) Interrupt Enable Register */
  WoReg   IDR;         /**< \brief (WDT Offset: 0x010) Interrupt Disable Register */
  RoReg   IMR;         /**< \brief (WDT Offset: 0x014) Interrupt Mask Register */
  RoReg   ISR;         /**< \brief (WDT Offset: 0x018) Interrupt Status Register */
  WoReg   ICR;         /**< \brief (WDT Offset: 0x01C) Interrupt Clear Register */
  RoReg   Reserved1[247];
  RoReg   VERSION;     /**< \brief (WDT Offset: 0x3FC) Version Register */
} Wdt;
#endif /* __ASSEMBLY__ */
/* -------- WDT_CTRL : (WDT Offset: 0x000) Control Register -------- */
#define WDT_CTRL_EN                 (0x1u <<  0) /**< \brief (WDT_CTRL) WDT Enable */
#define   WDT_CTRL_EN_0             (0x0u <<  0) /**< \brief (WDT_CTRL) WDT is disabled. */
#define   WDT_CTRL_EN_1             (0x1u <<  0) /**< \brief (WDT_CTRL) WDT is enabled */
#define WDT_CTRL_DAR                (0x1u <<  1) /**< \brief (WDT_CTRL) WDT Disable After Reset */
#define WDT_CTRL_MODE               (0x1u <<  2) /**< \brief (WDT_CTRL) WDT Mode */
#define WDT_CTRL_SFV                (0x1u <<  3) /**< \brief (WDT_CTRL) WDT Store Final Value */
#define WDT_CTRL_IM                 (0x1u <<  4) /**< \brief (WDT_CTRL) WDT Interruput Mode */
#define WDT_CTRL_FCD                (0x1u <<  7) /**< \brief (WDT_CTRL) WDT Fuse Calibration Done */
#define WDT_CTRL_PSEL_Pos           8
#define WDT_CTRL_PSEL_Msk           (0x1Fu << WDT_CTRL_PSEL_Pos) /**< \brief (WDT_CTRL) Timeout Prescale Select */
#define WDT_CTRL_PSEL(value)        ((WDT_CTRL_PSEL_Msk & ((value) << WDT_CTRL_PSEL_Pos)))
#define WDT_CTRL_CSSEL1             (0x1u << 14) /**< \brief (WDT_CTRL) Clock Source Selection1 */
#define WDT_CTRL_CEN                (0x1u << 16) /**< \brief (WDT_CTRL) Clock Enable */
#define WDT_CTRL_CSSEL              (0x1u << 17) /**< \brief (WDT_CTRL) Clock Source Selection0 */
#define WDT_CTRL_TBAN_Pos           18
#define WDT_CTRL_TBAN_Msk           (0x1Fu << WDT_CTRL_TBAN_Pos) /**< \brief (WDT_CTRL) TBAN Prescale Select */
#define WDT_CTRL_TBAN(value)        ((WDT_CTRL_TBAN_Msk & ((value) << WDT_CTRL_TBAN_Pos)))
#define WDT_CTRL_KEY_Pos            24
#define WDT_CTRL_KEY_Msk            (0xFFu << WDT_CTRL_KEY_Pos) /**< \brief (WDT_CTRL) Key */
#define WDT_CTRL_KEY(value)         ((WDT_CTRL_KEY_Msk & ((value) << WDT_CTRL_KEY_Pos)))
/* -------- WDT_CLR : (WDT Offset: 0x004) Clear Register -------- */
#define WDT_CLR_WDTCLR              (0x1u <<  0) /**< \brief (WDT_CLR) Clear WDT counter */
#define WDT_CLR_KEY_Pos             24
#define WDT_CLR_KEY_Msk             (0xFFu << WDT_CLR_KEY_Pos) /**< \brief (WDT_CLR) Key */
#define WDT_CLR_KEY(value)          ((WDT_CLR_KEY_Msk & ((value) << WDT_CLR_KEY_Pos)))
/* -------- WDT_SR : (WDT Offset: 0x008) Status Register -------- */
#define WDT_SR_WINDOW               (0x1u <<  0) /**< \brief (WDT_SR) WDT in window */
#define WDT_SR_CLEARED              (0x1u <<  1) /**< \brief (WDT_SR) WDT cleared */
/* -------- WDT_IER : (WDT Offset: 0x00C) Interrupt Enable Register -------- */
#define WDT_IER_WINT                (0x1u <<  2) /**< \brief (WDT_IER)  */
/* -------- WDT_IDR : (WDT Offset: 0x010) Interrupt Disable Register -------- */
#define WDT_IDR_WINT                (0x1u <<  2) /**< \brief (WDT_IDR)  */
/* -------- WDT_IMR : (WDT Offset: 0x014) Interrupt Mask Register -------- */
#define WDT_IMR_WINT                (0x1u <<  2) /**< \brief (WDT_IMR)  */
/* -------- WDT_ISR : (WDT Offset: 0x018) Interrupt Status Register -------- */
#define WDT_ISR_WINT                (0x1u <<  2) /**< \brief (WDT_ISR)  */
/* -------- WDT_ICR : (WDT Offset: 0x01C) Interrupt Clear Register -------- */
#define WDT_ICR_WINT                (0x1u <<  2) /**< \brief (WDT_ICR)  */
/* -------- WDT_VERSION : (WDT Offset: 0x3FC) Version Register -------- */
#define WDT_VERSION_VERSION_Pos     0
#define WDT_VERSION_VERSION_Msk     (0xFFFu << WDT_VERSION_VERSION_Pos) /**< \brief (WDT_VERSION) Version number */
#define WDT_VERSION_VERSION(value)  ((WDT_VERSION_VERSION_Msk & ((value) << WDT_VERSION_VERSION_Pos)))
#define WDT_VERSION_VARIANT_Pos     16
#define WDT_VERSION_VARIANT_Msk     (0xFu << WDT_VERSION_VARIANT_Pos) /**< \brief (WDT_VERSION) Variant number */
#define WDT_VERSION_VARIANT(value)  ((WDT_VERSION_VARIANT_Msk & ((value) << WDT_VERSION_VARIANT_Pos)))

/*@}*/

/*@}*/

/* ************************************************************************** */
/**  REGISTER ACCESS DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_reg Registers Access Definitions */
/*@{*/

