Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
/* ========== Register definition for IISC peripheral ========== */
#define REG_IISC_CR               REG_ACCESS(WoReg  , 0x40004000U) /**< \brief (IISC) Control Register */ 
#define REG_IISC_MR               REG_ACCESS(RwReg  , 0x40004004U) /**< \brief (IISC) Mode Register */ 
#define REG_IISC_SR               REG_ACCESS(RoReg  , 0x40004008U) /**< \brief (IISC) Status Register */ 
#define REG_IISC_SCR              REG_ACCESS(WoReg  , 0x4000400CU) /**< \brief (IISC) Status Clear Register */ 
#define REG_IISC_SSR              REG_ACCESS(WoReg  , 0x40004010U) /**< \brief (IISC) Status Set Register */ 
#define REG_IISC_IER              REG_ACCESS(WoReg  , 0x40004014U) /**< \brief (IISC) Interrupt Enable Register */ 
#define REG_IISC_IDR              REG_ACCESS(WoReg  , 0x40004018U) /**< \brief (IISC) Interrupt Disable Register */ 
#define REG_IISC_IMR              REG_ACCESS(RoReg  , 0x4000401CU) /**< \brief (IISC) Interrupt Mask Register */ 
#define REG_IISC_RHR              REG_ACCESS(RoReg  , 0x40004020U) /**< \brief (IISC) Receive Holding Register */ 
#define REG_IISC_THR              REG_ACCESS(WoReg  , 0x40004024U) /**< \brief (IISC) Transmit Holding Register */ 
#define REG_IISC_VERSION          REG_ACCESS(RoReg  , 0x40004028U) /**< \brief (IISC) Version Register */ 
#define REG_IISC_PARAMETER        REG_ACCESS(RoReg  , 0x4000402CU) /**< \brief (IISC) Parameter Register */ 
/* ========== Register definition for SPI peripheral ========== */
#define REG_SPI_CR                REG_ACCESS(WoReg  , 0x40008000U) /**< \brief (SPI) Control Register */ 
#define REG_SPI_MR                REG_ACCESS(RwReg  , 0x40008004U) /**< \brief (SPI) Mode Register */ 
#define REG_SPI_RDR               REG_ACCESS(RoReg  , 0x40008008U) /**< \brief (SPI) Receive Data Register */ 
#define REG_SPI_TDR               REG_ACCESS(WoReg  , 0x4000800CU) /**< \brief (SPI) Transmit Data Register */ 
#define REG_SPI_SR                REG_ACCESS(RoReg  , 0x40008010U) /**< \brief (SPI) Status Register */ 
#define REG_SPI_IER               REG_ACCESS(WoReg  , 0x40008014U) /**< \brief (SPI) Interrupt Enable Register */ 
#define REG_SPI_IDR               REG_ACCESS(WoReg  , 0x40008018U) /**< \brief (SPI) Interrupt Disable Register */ 
#define REG_SPI_IMR               REG_ACCESS(RoReg  , 0x4000801CU) /**< \brief (SPI) Interrupt Mask Register */ 
#define REG_SPI_CSR0              REG_ACCESS(RwReg  , 0x40008030U) /**< \brief (SPI) Chip Select Register 0 */ 
#define REG_SPI_CSR1              REG_ACCESS(RwReg  , 0x40008034U) /**< \brief (SPI) Chip Select Register 1 */ 
#define REG_SPI_CSR2              REG_ACCESS(RwReg  , 0x40008038U) /**< \brief (SPI) Chip Select Register 2 */ 
#define REG_SPI_CSR3              REG_ACCESS(RwReg  , 0x4000803CU) /**< \brief (SPI) Chip Select Register 3 */ 
#define REG_SPI_WPCR              REG_ACCESS(RwReg  , 0x400080E4U) /**< \brief (SPI) Write Protection control Register */ 
#define REG_SPI_WPSR              REG_ACCESS(RoReg  , 0x400080E8U) /**< \brief (SPI) Write Protection status Register */ 
#define REG_SPI_FEATURES          REG_ACCESS(RoReg  , 0x400080F8U) /**< \brief (SPI) Features Register */ 
#define REG_SPI_VERSION           REG_ACCESS(RoReg  , 0x400080FCU) /**< \brief (SPI) Version Register */ 
/* ========== Register definition for TC0 peripheral ========== */
#define REG_TC0_CCR0              REG_ACCESS(WoReg  , 0x40010000U) /**< \brief (TC0) Channel Control Register Channel 0 0 */
#define REG_TC0_CMR0              REG_ACCESS(RwReg  , 0x40010004U) /**< \brief (TC0) Channel Mode Register Channel 0 0 */
#define REG_TC0_SMC0              REG_ACCESS(RwReg  , 0x40010008U) /**< \brief (TC0) Stepper Motor Mode Register 0 */
#define REG_TC0_CV0               REG_ACCESS(RoReg  , 0x40010010U) /**< \brief (TC0) Counter Value Channel 0 0 */
#define REG_TC0_RA0               REG_ACCESS(RwReg  , 0x40010014U) /**< \brief (TC0) Register A Channel 0 0 */
#define REG_TC0_RB0               REG_ACCESS(RwReg  , 0x40010018U) /**< \brief (TC0) Register B Channel 0 0 */
#define REG_TC0_RC0               REG_ACCESS(RwReg  , 0x4001001CU) /**< \brief (TC0) Register C Channel 0 0 */
#define REG_TC0_SR0               REG_ACCESS(RoReg  , 0x40010020U) /**< \brief (TC0) Status Register Channel 0 0 */
#define REG_TC0_IER0              REG_ACCESS(WoReg  , 0x40010024U) /**< \brief (TC0) Interrupt Enable Register Channel 0 0 */
#define REG_TC0_IDR0              REG_ACCESS(WoReg  , 0x40010028U) /**< \brief (TC0) Interrupt Disable Register Channel 0 0 */
#define REG_TC0_IMR0              REG_ACCESS(RoReg  , 0x4001002CU) /**< \brief (TC0) Interrupt Mask Register Channel 0 0 */
#define REG_TC0_CCR1              REG_ACCESS(WoReg  , 0x40010040U) /**< \brief (TC0) Channel Control Register Channel 0 1 */
#define REG_TC0_CMR1              REG_ACCESS(RwReg  , 0x40010044U) /**< \brief (TC0) Channel Mode Register Channel 0 1 */
#define REG_TC0_SMC1              REG_ACCESS(RwReg  , 0x40010048U) /**< \brief (TC0) Stepper Motor Mode Register 1 */
#define REG_TC0_CV1               REG_ACCESS(RoReg  , 0x40010050U) /**< \brief (TC0) Counter Value Channel 0 1 */
#define REG_TC0_RA1               REG_ACCESS(RwReg  , 0x40010054U) /**< \brief (TC0) Register A Channel 0 1 */
#define REG_TC0_RB1               REG_ACCESS(RwReg  , 0x40010058U) /**< \brief (TC0) Register B Channel 0 1 */
#define REG_TC0_RC1               REG_ACCESS(RwReg  , 0x4001005CU) /**< \brief (TC0) Register C Channel 0 1 */
#define REG_TC0_SR1               REG_ACCESS(RoReg  , 0x40010060U) /**< \brief (TC0) Status Register Channel 0 1 */
#define REG_TC0_IER1              REG_ACCESS(WoReg  , 0x40010064U) /**< \brief (TC0) Interrupt Enable Register Channel 0 1 */
#define REG_TC0_IDR1              REG_ACCESS(WoReg  , 0x40010068U) /**< \brief (TC0) Interrupt Disable Register Channel 0 1 */
#define REG_TC0_IMR1              REG_ACCESS(RoReg  , 0x4001006CU) /**< \brief (TC0) Interrupt Mask Register Channel 0 1 */
#define REG_TC0_CCR2              REG_ACCESS(WoReg  , 0x40010080U) /**< \brief (TC0) Channel Control Register Channel 0 2 */
#define REG_TC0_CMR2              REG_ACCESS(RwReg  , 0x40010084U) /**< \brief (TC0) Channel Mode Register Channel 0 2 */
#define REG_TC0_SMC2              REG_ACCESS(RwReg  , 0x40010088U) /**< \brief (TC0) Stepper Motor Mode Register 2 */
#define REG_TC0_CV2               REG_ACCESS(RoReg  , 0x40010090U) /**< \brief (TC0) Counter Value Channel 0 2 */
#define REG_TC0_RA2               REG_ACCESS(RwReg  , 0x40010094U) /**< \brief (TC0) Register A Channel 0 2 */
#define REG_TC0_RB2               REG_ACCESS(RwReg  , 0x40010098U) /**< \brief (TC0) Register B Channel 0 2 */
#define REG_TC0_RC2               REG_ACCESS(RwReg  , 0x4001009CU) /**< \brief (TC0) Register C Channel 0 2 */
#define REG_TC0_SR2               REG_ACCESS(RoReg  , 0x400100A0U) /**< \brief (TC0) Status Register Channel 0 2 */
#define REG_TC0_IER2              REG_ACCESS(WoReg  , 0x400100A4U) /**< \brief (TC0) Interrupt Enable Register Channel 0 2 */
#define REG_TC0_IDR2              REG_ACCESS(WoReg  , 0x400100A8U) /**< \brief (TC0) Interrupt Disable Register Channel 0 2 */
#define REG_TC0_IMR2              REG_ACCESS(RoReg  , 0x400100ACU) /**< \brief (TC0) Interrupt Mask Register Channel 0 2 */
#define REG_TC0_BCR               REG_ACCESS(WoReg  , 0x400100C0U) /**< \brief (TC0) TC Block Control Register */ 
#define REG_TC0_BMR               REG_ACCESS(RwReg  , 0x400100C4U) /**< \brief (TC0) TC Block Mode Register */ 
#define REG_TC0_QIER              REG_ACCESS(WoReg  , 0x400100C8U) /**< \brief (TC0) QDEC Interrupt Enable Register */ 
#define REG_TC0_QIDR              REG_ACCESS(WoReg  , 0x400100CCU) /**< \brief (TC0) QDEC Interrupt Disable Register */ 
#define REG_TC0_QIMR              REG_ACCESS(RoReg  , 0x400100D0U) /**< \brief (TC0) QDEC Interrupt Mask Register */ 
#define REG_TC0_QISR              REG_ACCESS(RoReg  , 0x400100D4U) /**< \brief (TC0) QDEC Interrupt Status Register */ 
#define REG_TC0_FMR               REG_ACCESS(RwReg  , 0x400100D8U) /**< \brief (TC0) Fault Mode Register */ 
#define REG_TC0_WPMR              REG_ACCESS(RwReg  , 0x400100E4U) /**< \brief (TC0) Write Protect Mode Register */ 
#define REG_TC0_FEATURES          REG_ACCESS(RoReg  , 0x400100F8U) /**< \brief (TC0) Features Register */ 
#define REG_TC0_VERSION           REG_ACCESS(RoReg  , 0x400100FCU) /**< \brief (TC0) Version Register */ 
/* ========== Register definition for TC1 peripheral ========== */
#define REG_TC1_CCR0              REG_ACCESS(WoReg  , 0x40014000U) /**< \brief (TC1) Channel Control Register Channel 0 0 */
#define REG_TC1_CMR0              REG_ACCESS(RwReg  , 0x40014004U) /**< \brief (TC1) Channel Mode Register Channel 0 0 */
#define REG_TC1_SMC0              REG_ACCESS(RwReg  , 0x40014008U) /**< \brief (TC1) Stepper Motor Mode Register 0 */
#define REG_TC1_CV0               REG_ACCESS(RoReg  , 0x40014010U) /**< \brief (TC1) Counter Value Channel 0 0 */
#define REG_TC1_RA0               REG_ACCESS(RwReg  , 0x40014014U) /**< \brief (TC1) Register A Channel 0 0 */
#define REG_TC1_RB0               REG_ACCESS(RwReg  , 0x40014018U) /**< \brief (TC1) Register B Channel 0 0 */
#define REG_TC1_RC0               REG_ACCESS(RwReg  , 0x4001401CU) /**< \brief (TC1) Register C Channel 0 0 */
#define REG_TC1_SR0               REG_ACCESS(RoReg  , 0x40014020U) /**< \brief (TC1) Status Register Channel 0 0 */
#define REG_TC1_IER0              REG_ACCESS(WoReg  , 0x40014024U) /**< \brief (TC1) Interrupt Enable Register Channel 0 0 */
#define REG_TC1_IDR0              REG_ACCESS(WoReg  , 0x40014028U) /**< \brief (TC1) Interrupt Disable Register Channel 0 0 */
#define REG_TC1_IMR0              REG_ACCESS(RoReg  , 0x4001402CU) /**< \brief (TC1) Interrupt Mask Register Channel 0 0 */
#define REG_TC1_CCR1              REG_ACCESS(WoReg  , 0x40014040U) /**< \brief (TC1) Channel Control Register Channel 0 1 */
#define REG_TC1_CMR1              REG_ACCESS(RwReg  , 0x40014044U) /**< \brief (TC1) Channel Mode Register Channel 0 1 */
#define REG_TC1_SMC1              REG_ACCESS(RwReg  , 0x40014048U) /**< \brief (TC1) Stepper Motor Mode Register 1 */
#define REG_TC1_CV1               REG_ACCESS(RoReg  , 0x40014050U) /**< \brief (TC1) Counter Value Channel 0 1 */
#define REG_TC1_RA1               REG_ACCESS(RwReg  , 0x40014054U) /**< \brief (TC1) Register A Channel 0 1 */
#define REG_TC1_RB1               REG_ACCESS(RwReg  , 0x40014058U) /**< \brief (TC1) Register B Channel 0 1 */
#define REG_TC1_RC1               REG_ACCESS(RwReg  , 0x4001405CU) /**< \brief (TC1) Register C Channel 0 1 */
#define REG_TC1_SR1               REG_ACCESS(RoReg  , 0x40014060U) /**< \brief (TC1) Status Register Channel 0 1 */
#define REG_TC1_IER1              REG_ACCESS(WoReg  , 0x40014064U) /**< \brief (TC1) Interrupt Enable Register Channel 0 1 */
#define REG_TC1_IDR1              REG_ACCESS(WoReg  , 0x40014068U) /**< \brief (TC1) Interrupt Disable Register Channel 0 1 */
#define REG_TC1_IMR1              REG_ACCESS(RoReg  , 0x4001406CU) /**< \brief (TC1) Interrupt Mask Register Channel 0 1 */
#define REG_TC1_CCR2              REG_ACCESS(WoReg  , 0x40014080U) /**< \brief (TC1) Channel Control Register Channel 0 2 */
#define REG_TC1_CMR2              REG_ACCESS(RwReg  , 0x40014084U) /**< \brief (TC1) Channel Mode Register Channel 0 2 */
#define REG_TC1_SMC2              REG_ACCESS(RwReg  , 0x40014088U) /**< \brief (TC1) Stepper Motor Mode Register 2 */
#define REG_TC1_CV2               REG_ACCESS(RoReg  , 0x40014090U) /**< \brief (TC1) Counter Value Channel 0 2 */
#define REG_TC1_RA2               REG_ACCESS(RwReg  , 0x40014094U) /**< \brief (TC1) Register A Channel 0 2 */
#define REG_TC1_RB2               REG_ACCESS(RwReg  , 0x40014098U) /**< \brief (TC1) Register B Channel 0 2 */
#define REG_TC1_RC2               REG_ACCESS(RwReg  , 0x4001409CU) /**< \brief (TC1) Register C Channel 0 2 */
#define REG_TC1_SR2               REG_ACCESS(RoReg  , 0x400140A0U) /**< \brief (TC1) Status Register Channel 0 2 */
#define REG_TC1_IER2              REG_ACCESS(WoReg  , 0x400140A4U) /**< \brief (TC1) Interrupt Enable Register Channel 0 2 */
#define REG_TC1_IDR2              REG_ACCESS(WoReg  , 0x400140A8U) /**< \brief (TC1) Interrupt Disable Register Channel 0 2 */
#define REG_TC1_IMR2              REG_ACCESS(RoReg  , 0x400140ACU) /**< \brief (TC1) Interrupt Mask Register Channel 0 2 */
#define REG_TC1_BCR               REG_ACCESS(WoReg  , 0x400140C0U) /**< \brief (TC1) TC Block Control Register */ 
#define REG_TC1_BMR               REG_ACCESS(RwReg  , 0x400140C4U) /**< \brief (TC1) TC Block Mode Register */ 
#define REG_TC1_QIER              REG_ACCESS(WoReg  , 0x400140C8U) /**< \brief (TC1) QDEC Interrupt Enable Register */ 
#define REG_TC1_QIDR              REG_ACCESS(WoReg  , 0x400140CCU) /**< \brief (TC1) QDEC Interrupt Disable Register */ 
#define REG_TC1_QIMR              REG_ACCESS(RoReg  , 0x400140D0U) /**< \brief (TC1) QDEC Interrupt Mask Register */ 
#define REG_TC1_QISR              REG_ACCESS(RoReg  , 0x400140D4U) /**< \brief (TC1) QDEC Interrupt Status Register */ 
#define REG_TC1_FMR               REG_ACCESS(RwReg  , 0x400140D8U) /**< \brief (TC1) Fault Mode Register */ 
#define REG_TC1_WPMR              REG_ACCESS(RwReg  , 0x400140E4U) /**< \brief (TC1) Write Protect Mode Register */ 
#define REG_TC1_FEATURES          REG_ACCESS(RoReg  , 0x400140F8U) /**< \brief (TC1) Features Register */ 
#define REG_TC1_VERSION           REG_ACCESS(RoReg  , 0x400140FCU) /**< \brief (TC1) Version Register */ 
/* ========== Register definition for TWIM0 peripheral ========== */
#define REG_TWIM0_CR              REG_ACCESS(WoReg  , 0x40018000U) /**< \brief (TWIM0) Control Register */ 
#define REG_TWIM0_CWGR            REG_ACCESS(RwReg  , 0x40018004U) /**< \brief (TWIM0) Clock Waveform Generator Register */ 
#define REG_TWIM0_SMBTR           REG_ACCESS(RwReg  , 0x40018008U) /**< \brief (TWIM0) SMBus Timing Register */ 
#define REG_TWIM0_CMDR            REG_ACCESS(RwReg  , 0x4001800CU) /**< \brief (TWIM0) Command Register */ 
#define REG_TWIM0_NCMDR           REG_ACCESS(RwReg  , 0x40018010U) /**< \brief (TWIM0) Next Command Register */ 
#define REG_TWIM0_RHR             REG_ACCESS(RoReg  , 0x40018014U) /**< \brief (TWIM0) Receive Holding Register */ 
#define REG_TWIM0_THR             REG_ACCESS(WoReg  , 0x40018018U) /**< \brief (TWIM0) Transmit Holding Register */ 
#define REG_TWIM0_SR              REG_ACCESS(RoReg  , 0x4001801CU) /**< \brief (TWIM0) Status Register */ 
#define REG_TWIM0_IER             REG_ACCESS(WoReg  , 0x40018020U) /**< \brief (TWIM0) Interrupt Enable Register */ 
#define REG_TWIM0_IDR             REG_ACCESS(WoReg  , 0x40018024U) /**< \brief (TWIM0) Interrupt Disable Register */ 
#define REG_TWIM0_IMR             REG_ACCESS(RoReg  , 0x40018028U) /**< \brief (TWIM0) Interrupt Mask Register */ 
#define REG_TWIM0_SCR             REG_ACCESS(WoReg  , 0x4001802CU) /**< \brief (TWIM0) Status Clear Register */ 
#define REG_TWIM0_PR              REG_ACCESS(RoReg  , 0x40018030U) /**< \brief (TWIM0) Parameter Register */ 
#define REG_TWIM0_VR              REG_ACCESS(RoReg  , 0x40018034U) /**< \brief (TWIM0) Version Register */ 
#define REG_TWIM0_HSCWGR          REG_ACCESS(RwReg  , 0x40018038U) /**< \brief (TWIM0) HS-mode Clock Waveform Generator */ 
#define REG_TWIM0_SRR             REG_ACCESS(RwReg  , 0x4001803CU) /**< \brief (TWIM0) Slew Rate Register */ 
#define REG_TWIM0_HSSRR           REG_ACCESS(RwReg  , 0x40018040U) /**< \brief (TWIM0) HS-mode Slew Rate Register */ 
/* ========== Register definition for TWIS0 peripheral ========== */
#define REG_TWIS0_CR              REG_ACCESS(RwReg  , 0x40018400U) /**< \brief (TWIS0) Control Register */ 
#define REG_TWIS0_NBYTES          REG_ACCESS(RwReg  , 0x40018404U) /**< \brief (TWIS0) NBYTES Register */ 
#define REG_TWIS0_TR              REG_ACCESS(RwReg  , 0x40018408U) /**< \brief (TWIS0) Timing Register */ 
#define REG_TWIS0_RHR             REG_ACCESS(RoReg  , 0x4001840CU) /**< \brief (TWIS0) Receive Holding Register */ 
#define REG_TWIS0_THR             REG_ACCESS(WoReg  , 0x40018410U) /**< \brief (TWIS0) Transmit Holding Register */ 
#define REG_TWIS0_PECR            REG_ACCESS(RoReg  , 0x40018414U) /**< \brief (TWIS0) Packet Error Check Register */ 
#define REG_TWIS0_SR              REG_ACCESS(RoReg  , 0x40018418U) /**< \brief (TWIS0) Status Register */ 
#define REG_TWIS0_IER             REG_ACCESS(WoReg  , 0x4001841CU) /**< \brief (TWIS0) Interrupt Enable Register */ 
#define REG_TWIS0_IDR             REG_ACCESS(WoReg  , 0x40018420U) /**< \brief (TWIS0) Interrupt Disable Register */ 
#define REG_TWIS0_IMR             REG_ACCESS(RoReg  , 0x40018424U) /**< \brief (TWIS0) Interrupt Mask Register */ 
#define REG_TWIS0_SCR             REG_ACCESS(WoReg  , 0x40018428U) /**< \brief (TWIS0) Status Clear Register */ 
#define REG_TWIS0_PR              REG_ACCESS(RoReg  , 0x4001842CU) /**< \brief (TWIS0) Parameter Register */ 
#define REG_TWIS0_VR              REG_ACCESS(RoReg  , 0x40018430U) /**< \brief (TWIS0) Version Register */ 
#define REG_TWIS0_HSTR            REG_ACCESS(RwReg  , 0x40018434U) /**< \brief (TWIS0) HS-mode Timing Register */ 
#define REG_TWIS0_SRR             REG_ACCESS(RwReg  , 0x40018438U) /**< \brief (TWIS0) Slew Rate Register */ 
#define REG_TWIS0_HSSRR           REG_ACCESS(RwReg  , 0x4001843CU) /**< \brief (TWIS0) HS-mode Slew Rate Register */ 
/* ========== Register definition for TWIM1 peripheral ========== */
#define REG_TWIM1_CR              REG_ACCESS(WoReg  , 0x4001C000U) /**< \brief (TWIM1) Control Register */ 
#define REG_TWIM1_CWGR            REG_ACCESS(RwReg  , 0x4001C004U) /**< \brief (TWIM1) Clock Waveform Generator Register */ 
#define REG_TWIM1_SMBTR           REG_ACCESS(RwReg  , 0x4001C008U) /**< \brief (TWIM1) SMBus Timing Register */ 
#define REG_TWIM1_CMDR            REG_ACCESS(RwReg  , 0x4001C00CU) /**< \brief (TWIM1) Command Register */ 
#define REG_TWIM1_NCMDR           REG_ACCESS(RwReg  , 0x4001C010U) /**< \brief (TWIM1) Next Command Register */ 
#define REG_TWIM1_RHR             REG_ACCESS(RoReg  , 0x4001C014U) /**< \brief (TWIM1) Receive Holding Register */ 
#define REG_TWIM1_THR             REG_ACCESS(WoReg  , 0x4001C018U) /**< \brief (TWIM1) Transmit Holding Register */ 
#define REG_TWIM1_SR              REG_ACCESS(RoReg  , 0x4001C01CU) /**< \brief (TWIM1) Status Register */ 
#define REG_TWIM1_IER             REG_ACCESS(WoReg  , 0x4001C020U) /**< \brief (TWIM1) Interrupt Enable Register */ 
#define REG_TWIM1_IDR             REG_ACCESS(WoReg  , 0x4001C024U) /**< \brief (TWIM1) Interrupt Disable Register */ 
#define REG_TWIM1_IMR             REG_ACCESS(RoReg  , 0x4001C028U) /**< \brief (TWIM1) Interrupt Mask Register */ 
#define REG_TWIM1_SCR             REG_ACCESS(WoReg  , 0x4001C02CU) /**< \brief (TWIM1) Status Clear Register */ 
#define REG_TWIM1_PR              REG_ACCESS(RoReg  , 0x4001C030U) /**< \brief (TWIM1) Parameter Register */ 
#define REG_TWIM1_VR              REG_ACCESS(RoReg  , 0x4001C034U) /**< \brief (TWIM1) Version Register */ 
#define REG_TWIM1_HSCWGR          REG_ACCESS(RwReg  , 0x4001C038U) /**< \brief (TWIM1) HS-mode Clock Waveform Generator */ 
#define REG_TWIM1_SRR             REG_ACCESS(RwReg  , 0x4001C03CU) /**< \brief (TWIM1) Slew Rate Register */ 
#define REG_TWIM1_HSSRR           REG_ACCESS(RwReg  , 0x4001C040U) /**< \brief (TWIM1) HS-mode Slew Rate Register */ 
/* ========== Register definition for TWIS1 peripheral ========== */
#define REG_TWIS1_CR              REG_ACCESS(RwReg  , 0x4001C400U) /**< \brief (TWIS1) Control Register */ 
#define REG_TWIS1_NBYTES          REG_ACCESS(RwReg  , 0x4001C404U) /**< \brief (TWIS1) NBYTES Register */ 
#define REG_TWIS1_TR              REG_ACCESS(RwReg  , 0x4001C408U) /**< \brief (TWIS1) Timing Register */ 
#define REG_TWIS1_RHR             REG_ACCESS(RoReg  , 0x4001C40CU) /**< \brief (TWIS1) Receive Holding Register */ 
#define REG_TWIS1_THR             REG_ACCESS(WoReg  , 0x4001C410U) /**< \brief (TWIS1) Transmit Holding Register */ 
#define REG_TWIS1_PECR            REG_ACCESS(RoReg  , 0x4001C414U) /**< \brief (TWIS1) Packet Error Check Register */ 
#define REG_TWIS1_SR              REG_ACCESS(RoReg  , 0x4001C418U) /**< \brief (TWIS1) Status Register */ 
#define REG_TWIS1_IER             REG_ACCESS(WoReg  , 0x4001C41CU) /**< \brief (TWIS1) Interrupt Enable Register */ 
#define REG_TWIS1_IDR             REG_ACCESS(WoReg  , 0x4001C420U) /**< \brief (TWIS1) Interrupt Disable Register */ 
#define REG_TWIS1_IMR             REG_ACCESS(RoReg  , 0x4001C424U) /**< \brief (TWIS1) Interrupt Mask Register */ 
#define REG_TWIS1_SCR             REG_ACCESS(WoReg  , 0x4001C428U) /**< \brief (TWIS1) Status Clear Register */ 
#define REG_TWIS1_PR              REG_ACCESS(RoReg  , 0x4001C42CU) /**< \brief (TWIS1) Parameter Register */ 
#define REG_TWIS1_VR              REG_ACCESS(RoReg  , 0x4001C430U) /**< \brief (TWIS1) Version Register */ 
#define REG_TWIS1_HSTR            REG_ACCESS(RwReg  , 0x4001C434U) /**< \brief (TWIS1) HS-mode Timing Register */ 
#define REG_TWIS1_SRR             REG_ACCESS(RwReg  , 0x4001C438U) /**< \brief (TWIS1) Slew Rate Register */ 
#define REG_TWIS1_HSSRR           REG_ACCESS(RwReg  , 0x4001C43CU) /**< \brief (TWIS1) HS-mode Slew Rate Register */ 
/* ========== Register definition for USART0 peripheral ========== */
#define REG_USART0_CR             REG_ACCESS(WoReg  , 0x40024000U) /**< \brief (USART0) Control Register */ 
#define REG_USART0_MR             REG_ACCESS(RwReg  , 0x40024004U) /**< \brief (USART0) Mode Register */ 
#define REG_USART0_IER            REG_ACCESS(WoReg  , 0x40024008U) /**< \brief (USART0) Interrupt Enable Register */ 
#define REG_USART0_IDR            REG_ACCESS(WoReg  , 0x4002400CU) /**< \brief (USART0) Interrupt Disable Register */ 
#define REG_USART0_IMR            REG_ACCESS(RoReg  , 0x40024010U) /**< \brief (USART0) Interrupt Mask Register */ 
#define REG_USART0_CSR            REG_ACCESS(RoReg  , 0x40024014U) /**< \brief (USART0) Channel Status Register */ 
#define REG_USART0_RHR            REG_ACCESS(RoReg  , 0x40024018U) /**< \brief (USART0) Receiver Holding Register */ 
#define REG_USART0_THR            REG_ACCESS(WoReg  , 0x4002401CU) /**< \brief (USART0) Transmitter Holding Register */ 
#define REG_USART0_BRGR           REG_ACCESS(RwReg  , 0x40024020U) /**< \brief (USART0) Baud Rate Generator Register */ 
#define REG_USART0_RTOR           REG_ACCESS(RwReg  , 0x40024024U) /**< \brief (USART0) Receiver Time-out Register */ 
#define REG_USART0_TTGR           REG_ACCESS(RwReg  , 0x40024028U) /**< \brief (USART0) Transmitter Timeguard Register */ 
#define REG_USART0_FIDI           REG_ACCESS(RwReg  , 0x40024040U) /**< \brief (USART0) FI DI Ratio Register */ 
#define REG_USART0_NER            REG_ACCESS(RoReg  , 0x40024044U) /**< \brief (USART0) Number of Errors Register */ 
#define REG_USART0_IFR            REG_ACCESS(RwReg  , 0x4002404CU) /**< \brief (USART0) IrDA Filter Register */ 
#define REG_USART0_MAN            REG_ACCESS(RwReg  , 0x40024050U) /**< \brief (USART0) Manchester Configuration Register */ 
#define REG_USART0_LINMR          REG_ACCESS(RwReg  , 0x40024054U) /**< \brief (USART0) LIN Mode Register */ 
#define REG_USART0_LINIR          REG_ACCESS(RwReg  , 0x40024058U) /**< \brief (USART0) LIN Identifier Register */ 
#define REG_USART0_LINBRR         REG_ACCESS(RoReg  , 0x4002405CU) /**< \brief (USART0) LIN Baud Rate Register */ 
#define REG_USART0_WPMR           REG_ACCESS(RwReg  , 0x400240E4U) /**< \brief (USART0) Write Protect Mode Register */ 
#define REG_USART0_WPSR           REG_ACCESS(RoReg  , 0x400240E8U) /**< \brief (USART0) Write Protect Status Register */ 
