Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_USART0_VERSION        REG_ACCESS(RoReg  , 0x400240FCU) /**< \brief (USART0) Version Register */ 
/* ========== Register definition for USART1 peripheral ========== */
#define REG_USART1_CR             REG_ACCESS(WoReg  , 0x40028000U) /**< \brief (USART1) Control Register */ 
#define REG_USART1_MR             REG_ACCESS(RwReg  , 0x40028004U) /**< \brief (USART1) Mode Register */ 
#define REG_USART1_IER            REG_ACCESS(WoReg  , 0x40028008U) /**< \brief (USART1) Interrupt Enable Register */ 
#define REG_USART1_IDR            REG_ACCESS(WoReg  , 0x4002800CU) /**< \brief (USART1) Interrupt Disable Register */ 
#define REG_USART1_IMR            REG_ACCESS(RoReg  , 0x40028010U) /**< \brief (USART1) Interrupt Mask Register */ 
#define REG_USART1_CSR            REG_ACCESS(RoReg  , 0x40028014U) /**< \brief (USART1) Channel Status Register */ 
#define REG_USART1_RHR            REG_ACCESS(RoReg  , 0x40028018U) /**< \brief (USART1) Receiver Holding Register */ 
#define REG_USART1_THR            REG_ACCESS(WoReg  , 0x4002801CU) /**< \brief (USART1) Transmitter Holding Register */ 
#define REG_USART1_BRGR           REG_ACCESS(RwReg  , 0x40028020U) /**< \brief (USART1) Baud Rate Generator Register */ 
#define REG_USART1_RTOR           REG_ACCESS(RwReg  , 0x40028024U) /**< \brief (USART1) Receiver Time-out Register */ 
#define REG_USART1_TTGR           REG_ACCESS(RwReg  , 0x40028028U) /**< \brief (USART1) Transmitter Timeguard Register */ 
#define REG_USART1_FIDI           REG_ACCESS(RwReg  , 0x40028040U) /**< \brief (USART1) FI DI Ratio Register */ 
#define REG_USART1_NER            REG_ACCESS(RoReg  , 0x40028044U) /**< \brief (USART1) Number of Errors Register */ 
#define REG_USART1_IFR            REG_ACCESS(RwReg  , 0x4002804CU) /**< \brief (USART1) IrDA Filter Register */ 
#define REG_USART1_MAN            REG_ACCESS(RwReg  , 0x40028050U) /**< \brief (USART1) Manchester Configuration Register */ 
#define REG_USART1_LINMR          REG_ACCESS(RwReg  , 0x40028054U) /**< \brief (USART1) LIN Mode Register */ 
#define REG_USART1_LINIR          REG_ACCESS(RwReg  , 0x40028058U) /**< \brief (USART1) LIN Identifier Register */ 
#define REG_USART1_LINBRR         REG_ACCESS(RoReg  , 0x4002805CU) /**< \brief (USART1) LIN Baud Rate Register */ 
#define REG_USART1_WPMR           REG_ACCESS(RwReg  , 0x400280E4U) /**< \brief (USART1) Write Protect Mode Register */ 
#define REG_USART1_WPSR           REG_ACCESS(RoReg  , 0x400280E8U) /**< \brief (USART1) Write Protect Status Register */ 
#define REG_USART1_VERSION        REG_ACCESS(RoReg  , 0x400280FCU) /**< \brief (USART1) Version Register */ 
/* ========== Register definition for USART2 peripheral ========== */
#define REG_USART2_CR             REG_ACCESS(WoReg  , 0x4002C000U) /**< \brief (USART2) Control Register */ 
#define REG_USART2_MR             REG_ACCESS(RwReg  , 0x4002C004U) /**< \brief (USART2) Mode Register */ 
#define REG_USART2_IER            REG_ACCESS(WoReg  , 0x4002C008U) /**< \brief (USART2) Interrupt Enable Register */ 
#define REG_USART2_IDR            REG_ACCESS(WoReg  , 0x4002C00CU) /**< \brief (USART2) Interrupt Disable Register */ 
#define REG_USART2_IMR            REG_ACCESS(RoReg  , 0x4002C010U) /**< \brief (USART2) Interrupt Mask Register */ 
#define REG_USART2_CSR            REG_ACCESS(RoReg  , 0x4002C014U) /**< \brief (USART2) Channel Status Register */ 
#define REG_USART2_RHR            REG_ACCESS(RoReg  , 0x4002C018U) /**< \brief (USART2) Receiver Holding Register */ 
#define REG_USART2_THR            REG_ACCESS(WoReg  , 0x4002C01CU) /**< \brief (USART2) Transmitter Holding Register */ 
#define REG_USART2_BRGR           REG_ACCESS(RwReg  , 0x4002C020U) /**< \brief (USART2) Baud Rate Generator Register */ 
#define REG_USART2_RTOR           REG_ACCESS(RwReg  , 0x4002C024U) /**< \brief (USART2) Receiver Time-out Register */ 
#define REG_USART2_TTGR           REG_ACCESS(RwReg  , 0x4002C028U) /**< \brief (USART2) Transmitter Timeguard Register */ 
#define REG_USART2_FIDI           REG_ACCESS(RwReg  , 0x4002C040U) /**< \brief (USART2) FI DI Ratio Register */ 
#define REG_USART2_NER            REG_ACCESS(RoReg  , 0x4002C044U) /**< \brief (USART2) Number of Errors Register */ 
#define REG_USART2_IFR            REG_ACCESS(RwReg  , 0x4002C04CU) /**< \brief (USART2) IrDA Filter Register */ 
#define REG_USART2_MAN            REG_ACCESS(RwReg  , 0x4002C050U) /**< \brief (USART2) Manchester Configuration Register */ 
#define REG_USART2_LINMR          REG_ACCESS(RwReg  , 0x4002C054U) /**< \brief (USART2) LIN Mode Register */ 
#define REG_USART2_LINIR          REG_ACCESS(RwReg  , 0x4002C058U) /**< \brief (USART2) LIN Identifier Register */ 
#define REG_USART2_LINBRR         REG_ACCESS(RoReg  , 0x4002C05CU) /**< \brief (USART2) LIN Baud Rate Register */ 
#define REG_USART2_WPMR           REG_ACCESS(RwReg  , 0x4002C0E4U) /**< \brief (USART2) Write Protect Mode Register */ 
#define REG_USART2_WPSR           REG_ACCESS(RoReg  , 0x4002C0E8U) /**< \brief (USART2) Write Protect Status Register */ 
#define REG_USART2_VERSION        REG_ACCESS(RoReg  , 0x4002C0FCU) /**< \brief (USART2) Version Register */ 
/* ========== Register definition for USART3 peripheral ========== */
#define REG_USART3_CR             REG_ACCESS(WoReg  , 0x40030000U) /**< \brief (USART3) Control Register */ 
#define REG_USART3_MR             REG_ACCESS(RwReg  , 0x40030004U) /**< \brief (USART3) Mode Register */ 
#define REG_USART3_IER            REG_ACCESS(WoReg  , 0x40030008U) /**< \brief (USART3) Interrupt Enable Register */ 
#define REG_USART3_IDR            REG_ACCESS(WoReg  , 0x4003000CU) /**< \brief (USART3) Interrupt Disable Register */ 
#define REG_USART3_IMR            REG_ACCESS(RoReg  , 0x40030010U) /**< \brief (USART3) Interrupt Mask Register */ 
#define REG_USART3_CSR            REG_ACCESS(RoReg  , 0x40030014U) /**< \brief (USART3) Channel Status Register */ 
#define REG_USART3_RHR            REG_ACCESS(RoReg  , 0x40030018U) /**< \brief (USART3) Receiver Holding Register */ 
#define REG_USART3_THR            REG_ACCESS(WoReg  , 0x4003001CU) /**< \brief (USART3) Transmitter Holding Register */ 
#define REG_USART3_BRGR           REG_ACCESS(RwReg  , 0x40030020U) /**< \brief (USART3) Baud Rate Generator Register */ 
#define REG_USART3_RTOR           REG_ACCESS(RwReg  , 0x40030024U) /**< \brief (USART3) Receiver Time-out Register */ 
#define REG_USART3_TTGR           REG_ACCESS(RwReg  , 0x40030028U) /**< \brief (USART3) Transmitter Timeguard Register */ 
#define REG_USART3_FIDI           REG_ACCESS(RwReg  , 0x40030040U) /**< \brief (USART3) FI DI Ratio Register */ 
#define REG_USART3_NER            REG_ACCESS(RoReg  , 0x40030044U) /**< \brief (USART3) Number of Errors Register */ 
#define REG_USART3_IFR            REG_ACCESS(RwReg  , 0x4003004CU) /**< \brief (USART3) IrDA Filter Register */ 
#define REG_USART3_MAN            REG_ACCESS(RwReg  , 0x40030050U) /**< \brief (USART3) Manchester Configuration Register */ 
#define REG_USART3_LINMR          REG_ACCESS(RwReg  , 0x40030054U) /**< \brief (USART3) LIN Mode Register */ 
#define REG_USART3_LINIR          REG_ACCESS(RwReg  , 0x40030058U) /**< \brief (USART3) LIN Identifier Register */ 
#define REG_USART3_LINBRR         REG_ACCESS(RoReg  , 0x4003005CU) /**< \brief (USART3) LIN Baud Rate Register */ 
#define REG_USART3_WPMR           REG_ACCESS(RwReg  , 0x400300E4U) /**< \brief (USART3) Write Protect Mode Register */ 
#define REG_USART3_WPSR           REG_ACCESS(RoReg  , 0x400300E8U) /**< \brief (USART3) Write Protect Status Register */ 
#define REG_USART3_VERSION        REG_ACCESS(RoReg  , 0x400300FCU) /**< \brief (USART3) Version Register */ 
/* ========== Register definition for ADCIFE peripheral ========== */
#define REG_ADCIFE_CR             REG_ACCESS(WoReg  , 0x40038000U) /**< \brief (ADCIFE) Control Register */ 
#define REG_ADCIFE_CFG            REG_ACCESS(RwReg  , 0x40038004U) /**< \brief (ADCIFE) Configuration Register */ 
#define REG_ADCIFE_SR             REG_ACCESS(RoReg  , 0x40038008U) /**< \brief (ADCIFE) Status Register */ 
#define REG_ADCIFE_SCR            REG_ACCESS(WoReg  , 0x4003800CU) /**< \brief (ADCIFE) Status Clear Register */ 
#define REG_ADCIFE_RTS            REG_ACCESS(RwReg  , 0x40038010U) /**< \brief (ADCIFE) Resistive Touch Screen Register */ 
#define REG_ADCIFE_SEQCFG         REG_ACCESS(RwReg  , 0x40038014U) /**< \brief (ADCIFE) Sequencer Configuration Register */ 
#define REG_ADCIFE_CDMA           REG_ACCESS(WoReg  , 0x40038018U) /**< \brief (ADCIFE) Configuration Direct Memory Access Register */ 
#define REG_ADCIFE_TIM            REG_ACCESS(RwReg  , 0x4003801CU) /**< \brief (ADCIFE) Timing Configuration Register */ 
#define REG_ADCIFE_ITIMER         REG_ACCESS(RwReg  , 0x40038020U) /**< \brief (ADCIFE) Internal Timer Register */ 
#define REG_ADCIFE_WCFG           REG_ACCESS(RwReg  , 0x40038024U) /**< \brief (ADCIFE) Window Monitor Configuration Register */ 
#define REG_ADCIFE_WTH            REG_ACCESS(RwReg  , 0x40038028U) /**< \brief (ADCIFE) Window Monitor Threshold Configuration Register */ 
#define REG_ADCIFE_LCV            REG_ACCESS(RoReg  , 0x4003802CU) /**< \brief (ADCIFE) Sequencer Last Converted Value Register */ 
#define REG_ADCIFE_IER            REG_ACCESS(WoReg  , 0x40038030U) /**< \brief (ADCIFE) Interrupt Enable Register */ 
#define REG_ADCIFE_IDR            REG_ACCESS(WoReg  , 0x40038034U) /**< \brief (ADCIFE) Interrupt Disable Register */ 
#define REG_ADCIFE_IMR            REG_ACCESS(RoReg  , 0x40038038U) /**< \brief (ADCIFE) Interrupt Mask Register */ 
#define REG_ADCIFE_CALIB          REG_ACCESS(RwReg  , 0x4003803CU) /**< \brief (ADCIFE) Calibration Register */ 
#define REG_ADCIFE_VERSION        REG_ACCESS(RoReg  , 0x40038040U) /**< \brief (ADCIFE) Version Register */ 
#define REG_ADCIFE_PARAMETER      REG_ACCESS(RoReg  , 0x40038044U) /**< \brief (ADCIFE) Parameter Register */ 
/* ========== Register definition for DACC peripheral ========== */
#define REG_DACC_CR               REG_ACCESS(WoReg  , 0x4003C000U) /**< \brief (DACC) Control Register */ 
#define REG_DACC_MR               REG_ACCESS(RwReg  , 0x4003C004U) /**< \brief (DACC) Mode Register */ 
#define REG_DACC_CDR              REG_ACCESS(WoReg  , 0x4003C008U) /**< \brief (DACC) Conversion Data Register */ 
#define REG_DACC_IER              REG_ACCESS(WoReg  , 0x4003C00CU) /**< \brief (DACC) Interrupt Enable Register */ 
#define REG_DACC_IDR              REG_ACCESS(WoReg  , 0x4003C010U) /**< \brief (DACC) Interrupt Disable Register */ 
#define REG_DACC_IMR              REG_ACCESS(RoReg  , 0x4003C014U) /**< \brief (DACC) Interrupt Mask Register */ 
#define REG_DACC_ISR              REG_ACCESS(RoReg  , 0x4003C018U) /**< \brief (DACC) Interrupt Status Register */ 
#define REG_DACC_WPMR             REG_ACCESS(RwReg  , 0x4003C0E4U) /**< \brief (DACC) Write Protect Mode Register */ 
#define REG_DACC_WPSR             REG_ACCESS(RoReg  , 0x4003C0E8U) /**< \brief (DACC) Write Protect Status Register */ 
#define REG_DACC_VERSION          REG_ACCESS(RoReg  , 0x4003C0FCU) /**< \brief (DACC) Version Register */ 
/* ========== Register definition for ACIFC peripheral ========== */
#define REG_ACIFC_CTRL            REG_ACCESS(RwReg  , 0x40040000U) /**< \brief (ACIFC) Control Register */ 
#define REG_ACIFC_SR              REG_ACCESS(RoReg  , 0x40040004U) /**< \brief (ACIFC) Status Register */ 
#define REG_ACIFC_IER             REG_ACCESS(WoReg  , 0x40040010U) /**< \brief (ACIFC) Interrupt Enable Register */ 
#define REG_ACIFC_IDR             REG_ACCESS(WoReg  , 0x40040014U) /**< \brief (ACIFC) Interrupt Disable Register */ 
#define REG_ACIFC_IMR             REG_ACCESS(RoReg  , 0x40040018U) /**< \brief (ACIFC) Interrupt Mask Register */ 
#define REG_ACIFC_ISR             REG_ACCESS(RoReg  , 0x4004001CU) /**< \brief (ACIFC) Interrupt Status Register */ 
#define REG_ACIFC_ICR             REG_ACCESS(WoReg  , 0x40040020U) /**< \brief (ACIFC) Interrupt Status Clear Register */ 
#define REG_ACIFC_TR              REG_ACCESS(RwReg  , 0x40040024U) /**< \brief (ACIFC) Test Register */ 
#define REG_ACIFC_PARAMETER       REG_ACCESS(RoReg  , 0x40040030U) /**< \brief (ACIFC) Parameter Register */ 
#define REG_ACIFC_VERSION         REG_ACCESS(RoReg  , 0x40040034U) /**< \brief (ACIFC) Version Register */ 
#define REG_ACIFC_CONFW0          REG_ACCESS(RwReg  , 0x40040080U) /**< \brief (ACIFC) Window configuration Register 0 */
#define REG_ACIFC_CONFW1          REG_ACCESS(RwReg  , 0x40040084U) /**< \brief (ACIFC) Window configuration Register 1 */
#define REG_ACIFC_CONFW2          REG_ACCESS(RwReg  , 0x40040088U) /**< \brief (ACIFC) Window configuration Register 2 */
#define REG_ACIFC_CONFW3          REG_ACCESS(RwReg  , 0x4004008CU) /**< \brief (ACIFC) Window configuration Register 3 */
#define REG_ACIFC_CONF0           REG_ACCESS(RwReg  , 0x400400D0U) /**< \brief (ACIFC) AC Configuration Register 0 */
#define REG_ACIFC_CONF1           REG_ACCESS(RwReg  , 0x400400D4U) /**< \brief (ACIFC) AC Configuration Register 1 */
#define REG_ACIFC_CONF2           REG_ACCESS(RwReg  , 0x400400D8U) /**< \brief (ACIFC) AC Configuration Register 2 */
#define REG_ACIFC_CONF3           REG_ACCESS(RwReg  , 0x400400DCU) /**< \brief (ACIFC) AC Configuration Register 3 */
#define REG_ACIFC_CONF4           REG_ACCESS(RwReg  , 0x400400E0U) /**< \brief (ACIFC) AC Configuration Register 4 */
#define REG_ACIFC_CONF5           REG_ACCESS(RwReg  , 0x400400E4U) /**< \brief (ACIFC) AC Configuration Register 5 */
#define REG_ACIFC_CONF6           REG_ACCESS(RwReg  , 0x400400E8U) /**< \brief (ACIFC) AC Configuration Register 6 */
#define REG_ACIFC_CONF7           REG_ACCESS(RwReg  , 0x400400ECU) /**< \brief (ACIFC) AC Configuration Register 7 */
/* ========== Register definition for GLOC peripheral ========== */
#define REG_GLOC_CR0              REG_ACCESS(RwReg  , 0x40060000U) /**< \brief (GLOC) Control Register 0 */
#define REG_GLOC_TRUTH0           REG_ACCESS(RwReg  , 0x40060004U) /**< \brief (GLOC) Truth Register 0 */
#define REG_GLOC_CR1              REG_ACCESS(RwReg  , 0x40060008U) /**< \brief (GLOC) Control Register 1 */
#define REG_GLOC_TRUTH1           REG_ACCESS(RwReg  , 0x4006000CU) /**< \brief (GLOC) Truth Register 1 */
#define REG_GLOC_PARAMETER        REG_ACCESS(RoReg  , 0x40060038U) /**< \brief (GLOC) Parameter Register */ 
#define REG_GLOC_VERSION          REG_ACCESS(RoReg  , 0x4006003CU) /**< \brief (GLOC) Version Register */ 
/* ========== Register definition for ABDACB peripheral ========== */
#define REG_ABDACB_CR             REG_ACCESS(RwReg  , 0x40064000U) /**< \brief (ABDACB) Control Register */ 
#define REG_ABDACB_SDR0           REG_ACCESS(RwReg  , 0x40064004U) /**< \brief (ABDACB) Sample Data Register 0 */ 
#define REG_ABDACB_SDR1           REG_ACCESS(RwReg  , 0x40064008U) /**< \brief (ABDACB) Sample Data Register 1 */ 
#define REG_ABDACB_VCR0           REG_ACCESS(RwReg  , 0x4006400CU) /**< \brief (ABDACB) Volume Control Register 0 */ 
#define REG_ABDACB_VCR1           REG_ACCESS(RwReg  , 0x40064010U) /**< \brief (ABDACB) Volume Control Register 1 */ 
#define REG_ABDACB_IER            REG_ACCESS(WoReg  , 0x40064014U) /**< \brief (ABDACB) Interrupt Enable Register */ 
#define REG_ABDACB_IDR            REG_ACCESS(WoReg  , 0x40064018U) /**< \brief (ABDACB) Interupt Disable Register */ 
#define REG_ABDACB_IMR            REG_ACCESS(RoReg  , 0x4006401CU) /**< \brief (ABDACB) Interrupt Mask Register */ 
#define REG_ABDACB_SR             REG_ACCESS(RoReg  , 0x40064020U) /**< \brief (ABDACB) Status Register */ 
#define REG_ABDACB_SCR            REG_ACCESS(WoReg  , 0x40064024U) /**< \brief (ABDACB) Status Clear Register */ 
#define REG_ABDACB_PARAMETER      REG_ACCESS(RoReg  , 0x40064028U) /**< \brief (ABDACB) Parameter Register */ 
#define REG_ABDACB_VERSION        REG_ACCESS(RoReg  , 0x4006402CU) /**< \brief (ABDACB) Version Register */ 
/* ========== Register definition for TRNG peripheral ========== */
#define REG_TRNG_CR               REG_ACCESS(WoReg  , 0x40068000U) /**< \brief (TRNG) Control Register */ 
#define REG_TRNG_IER              REG_ACCESS(WoReg  , 0x40068010U) /**< \brief (TRNG) Interrupt Enable Register */ 
#define REG_TRNG_IDR              REG_ACCESS(WoReg  , 0x40068014U) /**< \brief (TRNG) Interrupt Disable Register */ 
#define REG_TRNG_IMR              REG_ACCESS(RoReg  , 0x40068018U) /**< \brief (TRNG) Interrupt Mask Register */ 
#define REG_TRNG_ISR              REG_ACCESS(RoReg  , 0x4006801CU) /**< \brief (TRNG) Interrupt Status Register */ 
#define REG_TRNG_ODATA            REG_ACCESS(RoReg  , 0x40068050U) /**< \brief (TRNG) Output Data Register */ 
#define REG_TRNG_VERSION          REG_ACCESS(RoReg  , 0x400680FCU) /**< \brief (TRNG) Version Register */ 
/* ========== Register definition for PARC peripheral ========== */
#define REG_PARC_CFG              REG_ACCESS(RwReg  , 0x4006C000U) /**< \brief (PARC) Configuration Register */ 
#define REG_PARC_CR               REG_ACCESS(RwReg  , 0x4006C004U) /**< \brief (PARC) Control Register */ 
#define REG_PARC_IER              REG_ACCESS(WoReg  , 0x4006C008U) /**< \brief (PARC) Interrupt Enable Register */ 
#define REG_PARC_IDR              REG_ACCESS(WoReg  , 0x4006C00CU) /**< \brief (PARC) Interrupt Disable Register */ 
#define REG_PARC_IMR              REG_ACCESS(RoReg  , 0x4006C010U) /**< \brief (PARC) Interrupt Mask Register */ 
#define REG_PARC_SR               REG_ACCESS(RoReg  , 0x4006C014U) /**< \brief (PARC) Status Register */ 
#define REG_PARC_ICR              REG_ACCESS(WoReg  , 0x4006C018U) /**< \brief (PARC) Interrupt Status Clear Register */ 
#define REG_PARC_RHR              REG_ACCESS(RoReg  , 0x4006C01CU) /**< \brief (PARC) Receive Holding Register */ 
#define REG_PARC_VERSION          REG_ACCESS(RoReg  , 0x4006C020U) /**< \brief (PARC) Version Register */ 
/* ========== Register definition for CATB peripheral ========== */
#define REG_CATB_CR               REG_ACCESS(RwReg  , 0x40070000U) /**< \brief (CATB) Control Register */ 
#define REG_CATB_CNTCR            REG_ACCESS(RwReg  , 0x40070004U) /**< \brief (CATB) Counter Control Register */ 
#define REG_CATB_IDLE             REG_ACCESS(RwReg  , 0x40070008U) /**< \brief (CATB) Sensor Idle Level */ 
#define REG_CATB_LEVEL            REG_ACCESS(RoReg  , 0x4007000CU) /**< \brief (CATB) Sensor Relative Level */ 
#define REG_CATB_RAW              REG_ACCESS(RoReg  , 0x40070010U) /**< \brief (CATB) Sensor Raw Value */ 
#define REG_CATB_TIMING           REG_ACCESS(RwReg  , 0x40070014U) /**< \brief (CATB) Filter Timing Register */ 
#define REG_CATB_THRESH           REG_ACCESS(RwReg  , 0x40070018U) /**< \brief (CATB) Threshold Register */ 
#define REG_CATB_PINSEL           REG_ACCESS(RwReg  , 0x4007001CU) /**< \brief (CATB) Pin Selection Register */ 
#define REG_CATB_DMA              REG_ACCESS(RwReg  , 0x40070020U) /**< \brief (CATB) Direct Memory Access Register */ 
#define REG_CATB_ISR              REG_ACCESS(RoReg  , 0x40070024U) /**< \brief (CATB) Interrupt Status Register */ 
#define REG_CATB_IER              REG_ACCESS(WoReg  , 0x40070028U) /**< \brief (CATB) Interrupt Enable Register */ 
#define REG_CATB_IDR              REG_ACCESS(WoReg  , 0x4007002CU) /**< \brief (CATB) Interrupt Disable Register */ 
#define REG_CATB_IMR              REG_ACCESS(RoReg  , 0x40070030U) /**< \brief (CATB) Interrupt Mask Register */ 
#define REG_CATB_SCR              REG_ACCESS(WoReg  , 0x40070034U) /**< \brief (CATB) Status Clear Register */ 
#define REG_CATB_INTCH0           REG_ACCESS(RoReg  , 0x40070040U) /**< \brief (CATB) In-Touch Status Register 0 0 */
#define REG_CATB_INTCHCLR0        REG_ACCESS(WoReg  , 0x40070050U) /**< \brief (CATB) In-Touch Status Clear Register 0 0 */
#define REG_CATB_OUTTCH0          REG_ACCESS(RoReg  , 0x40070060U) /**< \brief (CATB) Out-of-Touch Status Register 0 0 */
#define REG_CATB_OUTTCHCLR0       REG_ACCESS(WoReg  , 0x40070070U) /**< \brief (CATB) Out-of-Touch Status Clear Register 0 0 */
#define REG_CATB_PARAMETER        REG_ACCESS(RoReg  , 0x400700F8U) /**< \brief (CATB) Parameter Register */ 
#define REG_CATB_VERSION          REG_ACCESS(RoReg  , 0x400700FCU) /**< \brief (CATB) Version Register */ 
/* ========== Register definition for PTC peripheral ========== */
#define REG_PTC_DMA               REG_ACCESS(RoReg  , 0x400740FCU) /**< \brief (PTC)  */ 
/* ========== Register definition for TWIM2 peripheral ========== */
#define REG_TWIM2_CR              REG_ACCESS(WoReg  , 0x40078000U) /**< \brief (TWIM2) Control Register */ 
#define REG_TWIM2_CWGR            REG_ACCESS(RwReg  , 0x40078004U) /**< \brief (TWIM2) Clock Waveform Generator Register */ 
#define REG_TWIM2_SMBTR           REG_ACCESS(RwReg  , 0x40078008U) /**< \brief (TWIM2) SMBus Timing Register */ 
#define REG_TWIM2_CMDR            REG_ACCESS(RwReg  , 0x4007800CU) /**< \brief (TWIM2) Command Register */ 
#define REG_TWIM2_NCMDR           REG_ACCESS(RwReg  , 0x40078010U) /**< \brief (TWIM2) Next Command Register */ 
#define REG_TWIM2_RHR             REG_ACCESS(RoReg  , 0x40078014U) /**< \brief (TWIM2) Receive Holding Register */ 
#define REG_TWIM2_THR             REG_ACCESS(WoReg  , 0x40078018U) /**< \brief (TWIM2) Transmit Holding Register */ 
#define REG_TWIM2_SR              REG_ACCESS(RoReg  , 0x4007801CU) /**< \brief (TWIM2) Status Register */ 
#define REG_TWIM2_IER             REG_ACCESS(WoReg  , 0x40078020U) /**< \brief (TWIM2) Interrupt Enable Register */ 
#define REG_TWIM2_IDR             REG_ACCESS(WoReg  , 0x40078024U) /**< \brief (TWIM2) Interrupt Disable Register */ 
#define REG_TWIM2_IMR             REG_ACCESS(RoReg  , 0x40078028U) /**< \brief (TWIM2) Interrupt Mask Register */ 
#define REG_TWIM2_SCR             REG_ACCESS(WoReg  , 0x4007802CU) /**< \brief (TWIM2) Status Clear Register */ 
#define REG_TWIM2_PR              REG_ACCESS(RoReg  , 0x40078030U) /**< \brief (TWIM2) Parameter Register */ 
#define REG_TWIM2_VR              REG_ACCESS(RoReg  , 0x40078034U) /**< \brief (TWIM2) Version Register */ 
#define REG_TWIM2_HSCWGR          REG_ACCESS(RwReg  , 0x40078038U) /**< \brief (TWIM2) HS-mode Clock Waveform Generator */ 
#define REG_TWIM2_SRR             REG_ACCESS(RwReg  , 0x4007803CU) /**< \brief (TWIM2) Slew Rate Register */ 
#define REG_TWIM2_HSSRR           REG_ACCESS(RwReg  , 0x40078040U) /**< \brief (TWIM2) HS-mode Slew Rate Register */ 
/* ========== Register definition for TWIM3 peripheral ========== */
#define REG_TWIM3_CR              REG_ACCESS(WoReg  , 0x4007C000U) /**< \brief (TWIM3) Control Register */ 
#define REG_TWIM3_CWGR            REG_ACCESS(RwReg  , 0x4007C004U) /**< \brief (TWIM3) Clock Waveform Generator Register */ 
#define REG_TWIM3_SMBTR           REG_ACCESS(RwReg  , 0x4007C008U) /**< \brief (TWIM3) SMBus Timing Register */ 
#define REG_TWIM3_CMDR            REG_ACCESS(RwReg  , 0x4007C00CU) /**< \brief (TWIM3) Command Register */ 
#define REG_TWIM3_NCMDR           REG_ACCESS(RwReg  , 0x4007C010U) /**< \brief (TWIM3) Next Command Register */ 
#define REG_TWIM3_RHR             REG_ACCESS(RoReg  , 0x4007C014U) /**< \brief (TWIM3) Receive Holding Register */ 
#define REG_TWIM3_THR             REG_ACCESS(WoReg  , 0x4007C018U) /**< \brief (TWIM3) Transmit Holding Register */ 
#define REG_TWIM3_SR              REG_ACCESS(RoReg  , 0x4007C01CU) /**< \brief (TWIM3) Status Register */ 
#define REG_TWIM3_IER             REG_ACCESS(WoReg  , 0x4007C020U) /**< \brief (TWIM3) Interrupt Enable Register */ 
#define REG_TWIM3_IDR             REG_ACCESS(WoReg  , 0x4007C024U) /**< \brief (TWIM3) Interrupt Disable Register */ 
#define REG_TWIM3_IMR             REG_ACCESS(RoReg  , 0x4007C028U) /**< \brief (TWIM3) Interrupt Mask Register */ 
#define REG_TWIM3_SCR             REG_ACCESS(WoReg  , 0x4007C02CU) /**< \brief (TWIM3) Status Clear Register */ 
