Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_TWIM3_PR              REG_ACCESS(RoReg  , 0x4007C030U) /**< \brief (TWIM3) Parameter Register */ 
#define REG_TWIM3_VR              REG_ACCESS(RoReg  , 0x4007C034U) /**< \brief (TWIM3) Version Register */ 
#define REG_TWIM3_HSCWGR          REG_ACCESS(RwReg  , 0x4007C038U) /**< \brief (TWIM3) HS-mode Clock Waveform Generator */ 
#define REG_TWIM3_SRR             REG_ACCESS(RwReg  , 0x4007C03CU) /**< \brief (TWIM3) Slew Rate Register */ 
#define REG_TWIM3_HSSRR           REG_ACCESS(RwReg  , 0x4007C040U) /**< \brief (TWIM3) HS-mode Slew Rate Register */ 
/* ========== Register definition for LCDCA peripheral ========== */
#define REG_LCDCA_CR              REG_ACCESS(WoReg  , 0x40080000U) /**< \brief (LCDCA) Control Register */ 
#define REG_LCDCA_CFG             REG_ACCESS(RwReg  , 0x40080004U) /**< \brief (LCDCA) Configuration Register */ 
#define REG_LCDCA_TIM             REG_ACCESS(RwReg  , 0x40080008U) /**< \brief (LCDCA) Timing Register */ 
#define REG_LCDCA_SR              REG_ACCESS(RoReg  , 0x4008000CU) /**< \brief (LCDCA) Status Register */ 
#define REG_LCDCA_SCR             REG_ACCESS(WoReg  , 0x40080010U) /**< \brief (LCDCA) Status Clear Register */ 
#define REG_LCDCA_DRL0            REG_ACCESS(RwReg  , 0x40080014U) /**< \brief (LCDCA) Data Register Low 0 */ 
#define REG_LCDCA_DRH0            REG_ACCESS(RwReg  , 0x40080018U) /**< \brief (LCDCA) Data Register High 0 */ 
#define REG_LCDCA_DRL1            REG_ACCESS(RwReg  , 0x4008001CU) /**< \brief (LCDCA) Data Register Low 1 */ 
#define REG_LCDCA_DRH1            REG_ACCESS(RwReg  , 0x40080020U) /**< \brief (LCDCA) Data Register High 1 */ 
#define REG_LCDCA_DRL2            REG_ACCESS(RwReg  , 0x40080024U) /**< \brief (LCDCA) Data Register Low 2 */ 
#define REG_LCDCA_DRH2            REG_ACCESS(RwReg  , 0x40080028U) /**< \brief (LCDCA) Data Register High 2 */ 
#define REG_LCDCA_DRL3            REG_ACCESS(RwReg  , 0x4008002CU) /**< \brief (LCDCA) Data Register Low 3 */ 
#define REG_LCDCA_DRH3            REG_ACCESS(RwReg  , 0x40080030U) /**< \brief (LCDCA) Data Register High 3 */ 
#define REG_LCDCA_IADR            REG_ACCESS(WoReg  , 0x40080034U) /**< \brief (LCDCA) Indirect Access Data Register */ 
#define REG_LCDCA_BCFG            REG_ACCESS(RwReg  , 0x40080038U) /**< \brief (LCDCA) Blink Configuration Register */ 
#define REG_LCDCA_CSRCFG          REG_ACCESS(RwReg  , 0x4008003CU) /**< \brief (LCDCA) Circular Shift Register Configuration */ 
#define REG_LCDCA_CMCFG           REG_ACCESS(RwReg  , 0x40080040U) /**< \brief (LCDCA) Character Mapping Configuration Register */ 
#define REG_LCDCA_CMDR            REG_ACCESS(WoReg  , 0x40080044U) /**< \brief (LCDCA) Character Mapping Data Register */ 
#define REG_LCDCA_ACMCFG          REG_ACCESS(RwReg  , 0x40080048U) /**< \brief (LCDCA) Automated Character Mapping Configuration Register */ 
#define REG_LCDCA_ACMDR           REG_ACCESS(WoReg  , 0x4008004CU) /**< \brief (LCDCA) Automated Character Mapping Data Register */ 
#define REG_LCDCA_ABMCFG          REG_ACCESS(RwReg  , 0x40080050U) /**< \brief (LCDCA) Automated Bit Mapping Configuration Register */ 
#define REG_LCDCA_ABMDR           REG_ACCESS(WoReg  , 0x40080054U) /**< \brief (LCDCA) Automated Bit Mapping Data Register */ 
#define REG_LCDCA_IER             REG_ACCESS(WoReg  , 0x40080058U) /**< \brief (LCDCA) Interrupt Enable Register */ 
#define REG_LCDCA_IDR             REG_ACCESS(WoReg  , 0x4008005CU) /**< \brief (LCDCA) Interrupt Disable Register */ 
#define REG_LCDCA_IMR             REG_ACCESS(RoReg  , 0x40080060U) /**< \brief (LCDCA) Interrupt Mask Register */ 
#define REG_LCDCA_VERSION         REG_ACCESS(RoReg  , 0x40080064U) /**< \brief (LCDCA) Version Register */ 
/* ========== Register definition for HFLASHC peripheral ========== */
#define REG_HFLASHC_FCR           REG_ACCESS(RwReg  , 0x400A0000U) /**< \brief (HFLASHC) Flash Controller Control Register */ 
#define REG_HFLASHC_FCMD          REG_ACCESS(RwReg  , 0x400A0004U) /**< \brief (HFLASHC) Flash Controller Command Register */ 
#define REG_HFLASHC_FSR           REG_ACCESS(RwReg  , 0x400A0008U) /**< \brief (HFLASHC) Flash Controller Status Register */ 
#define REG_HFLASHC_FPR           REG_ACCESS(RoReg  , 0x400A000CU) /**< \brief (HFLASHC) Flash Controller Parameter Register */ 
#define REG_HFLASHC_VERSION       REG_ACCESS(RoReg  , 0x400A0010U) /**< \brief (HFLASHC) Flash Controller Version Register */ 
#define REG_HFLASHC_FGPFRHI       REG_ACCESS(RwReg  , 0x400A0014U) /**< \brief (HFLASHC) Flash Controller General Purpose Fuse Register High */ 
#define REG_HFLASHC_FGPFRLO       REG_ACCESS(RwReg  , 0x400A0018U) /**< \brief (HFLASHC) Flash Controller General Purpose Fuse Register Low */ 
/* ========== Register definition for HCACHE peripheral ========== */
#define REG_HCACHE_CTRL           REG_ACCESS(WoReg  , 0x400A0408U) /**< \brief (HCACHE) Control Register */ 
#define REG_HCACHE_SR             REG_ACCESS(RwReg  , 0x400A040CU) /**< \brief (HCACHE) Status Register */ 
#define REG_HCACHE_MAINT0         REG_ACCESS(WoReg  , 0x400A0420U) /**< \brief (HCACHE) Maintenance Register 0 */ 
#define REG_HCACHE_MAINT1         REG_ACCESS(WoReg  , 0x400A0424U) /**< \brief (HCACHE) Maintenance Register 1 */ 
#define REG_HCACHE_MCFG           REG_ACCESS(RwReg  , 0x400A0428U) /**< \brief (HCACHE) Monitor Configuration Register */ 
#define REG_HCACHE_MEN            REG_ACCESS(RwReg  , 0x400A042CU) /**< \brief (HCACHE) Monitor Enable Register */ 
#define REG_HCACHE_MCTRL          REG_ACCESS(WoReg  , 0x400A0430U) /**< \brief (HCACHE) Monitor Control Register */ 
#define REG_HCACHE_MSR            REG_ACCESS(RoReg  , 0x400A0434U) /**< \brief (HCACHE) Monitor Status Register */ 
#define REG_HCACHE_VERSION        REG_ACCESS(RoReg  , 0x400A04FCU) /**< \brief (HCACHE) Version Register */ 
/* ========== Register definition for HMATRIX peripheral ========== */
#define REG_HMATRIX_MCFG0         REG_ACCESS(RwReg  , 0x400A1000U) /**< \brief (HMATRIX) Master Configuration Register 0 0 */
#define REG_HMATRIX_MCFG1         REG_ACCESS(RwReg  , 0x400A1004U) /**< \brief (HMATRIX) Master Configuration Register 0 1 */
#define REG_HMATRIX_MCFG2         REG_ACCESS(RwReg  , 0x400A1008U) /**< \brief (HMATRIX) Master Configuration Register 0 2 */
#define REG_HMATRIX_MCFG3         REG_ACCESS(RwReg  , 0x400A100CU) /**< \brief (HMATRIX) Master Configuration Register 0 3 */
#define REG_HMATRIX_MCFG4         REG_ACCESS(RwReg  , 0x400A1010U) /**< \brief (HMATRIX) Master Configuration Register 0 4 */
#define REG_HMATRIX_MCFG5         REG_ACCESS(RwReg  , 0x400A1014U) /**< \brief (HMATRIX) Master Configuration Register 0 5 */
#define REG_HMATRIX_MCFG6         REG_ACCESS(RwReg  , 0x400A1018U) /**< \brief (HMATRIX) Master Configuration Register 0 6 */
#define REG_HMATRIX_MCFG7         REG_ACCESS(RwReg  , 0x400A101CU) /**< \brief (HMATRIX) Master Configuration Register 0 7 */
#define REG_HMATRIX_MCFG8         REG_ACCESS(RwReg  , 0x400A1020U) /**< \brief (HMATRIX) Master Configuration Register 0 8 */
#define REG_HMATRIX_MCFG9         REG_ACCESS(RwReg  , 0x400A1024U) /**< \brief (HMATRIX) Master Configuration Register 0 9 */
#define REG_HMATRIX_MCFG10        REG_ACCESS(RwReg  , 0x400A1028U) /**< \brief (HMATRIX) Master Configuration Register 0 10 */
#define REG_HMATRIX_MCFG11        REG_ACCESS(RwReg  , 0x400A102CU) /**< \brief (HMATRIX) Master Configuration Register 0 11 */
#define REG_HMATRIX_MCFG12        REG_ACCESS(RwReg  , 0x400A1030U) /**< \brief (HMATRIX) Master Configuration Register 0 12 */
#define REG_HMATRIX_MCFG13        REG_ACCESS(RwReg  , 0x400A1034U) /**< \brief (HMATRIX) Master Configuration Register 0 13 */
#define REG_HMATRIX_MCFG14        REG_ACCESS(RwReg  , 0x400A1038U) /**< \brief (HMATRIX) Master Configuration Register 0 14 */
#define REG_HMATRIX_MCFG15        REG_ACCESS(RwReg  , 0x400A103CU) /**< \brief (HMATRIX) Master Configuration Register 0 15 */
#define REG_HMATRIX_SCFG0         REG_ACCESS(RwReg  , 0x400A1040U) /**< \brief (HMATRIX) Slave Configuration Register 0 0 */
#define REG_HMATRIX_SCFG1         REG_ACCESS(RwReg  , 0x400A1044U) /**< \brief (HMATRIX) Slave Configuration Register 0 1 */
#define REG_HMATRIX_SCFG2         REG_ACCESS(RwReg  , 0x400A1048U) /**< \brief (HMATRIX) Slave Configuration Register 0 2 */
#define REG_HMATRIX_SCFG3         REG_ACCESS(RwReg  , 0x400A104CU) /**< \brief (HMATRIX) Slave Configuration Register 0 3 */
#define REG_HMATRIX_SCFG4         REG_ACCESS(RwReg  , 0x400A1050U) /**< \brief (HMATRIX) Slave Configuration Register 0 4 */
#define REG_HMATRIX_SCFG5         REG_ACCESS(RwReg  , 0x400A1054U) /**< \brief (HMATRIX) Slave Configuration Register 0 5 */
#define REG_HMATRIX_SCFG6         REG_ACCESS(RwReg  , 0x400A1058U) /**< \brief (HMATRIX) Slave Configuration Register 0 6 */
#define REG_HMATRIX_SCFG7         REG_ACCESS(RwReg  , 0x400A105CU) /**< \brief (HMATRIX) Slave Configuration Register 0 7 */
#define REG_HMATRIX_SCFG8         REG_ACCESS(RwReg  , 0x400A1060U) /**< \brief (HMATRIX) Slave Configuration Register 0 8 */
#define REG_HMATRIX_SCFG9         REG_ACCESS(RwReg  , 0x400A1064U) /**< \brief (HMATRIX) Slave Configuration Register 0 9 */
#define REG_HMATRIX_SCFG10        REG_ACCESS(RwReg  , 0x400A1068U) /**< \brief (HMATRIX) Slave Configuration Register 0 10 */
#define REG_HMATRIX_SCFG11        REG_ACCESS(RwReg  , 0x400A106CU) /**< \brief (HMATRIX) Slave Configuration Register 0 11 */
#define REG_HMATRIX_SCFG12        REG_ACCESS(RwReg  , 0x400A1070U) /**< \brief (HMATRIX) Slave Configuration Register 0 12 */
#define REG_HMATRIX_SCFG13        REG_ACCESS(RwReg  , 0x400A1074U) /**< \brief (HMATRIX) Slave Configuration Register 0 13 */
#define REG_HMATRIX_SCFG14        REG_ACCESS(RwReg  , 0x400A1078U) /**< \brief (HMATRIX) Slave Configuration Register 0 14 */
#define REG_HMATRIX_SCFG15        REG_ACCESS(RwReg  , 0x400A107CU) /**< \brief (HMATRIX) Slave Configuration Register 0 15 */
#define REG_HMATRIX_PRAS0         REG_ACCESS(RwReg  , 0x400A1080U) /**< \brief (HMATRIX) Priority Register A for Slave 0 0 */
#define REG_HMATRIX_PRBS0         REG_ACCESS(RwReg  , 0x400A1084U) /**< \brief (HMATRIX) Priority Register B for Slave 0 0 */
#define REG_HMATRIX_PRAS1         REG_ACCESS(RwReg  , 0x400A1088U) /**< \brief (HMATRIX) Priority Register A for Slave 0 1 */
#define REG_HMATRIX_PRBS1         REG_ACCESS(RwReg  , 0x400A108CU) /**< \brief (HMATRIX) Priority Register B for Slave 0 1 */
#define REG_HMATRIX_PRAS2         REG_ACCESS(RwReg  , 0x400A1090U) /**< \brief (HMATRIX) Priority Register A for Slave 0 2 */
#define REG_HMATRIX_PRBS2         REG_ACCESS(RwReg  , 0x400A1094U) /**< \brief (HMATRIX) Priority Register B for Slave 0 2 */
#define REG_HMATRIX_PRAS3         REG_ACCESS(RwReg  , 0x400A1098U) /**< \brief (HMATRIX) Priority Register A for Slave 0 3 */
#define REG_HMATRIX_PRBS3         REG_ACCESS(RwReg  , 0x400A109CU) /**< \brief (HMATRIX) Priority Register B for Slave 0 3 */
#define REG_HMATRIX_PRAS4         REG_ACCESS(RwReg  , 0x400A10A0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 4 */
#define REG_HMATRIX_PRBS4         REG_ACCESS(RwReg  , 0x400A10A4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 4 */
#define REG_HMATRIX_PRAS5         REG_ACCESS(RwReg  , 0x400A10A8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 5 */
#define REG_HMATRIX_PRBS5         REG_ACCESS(RwReg  , 0x400A10ACU) /**< \brief (HMATRIX) Priority Register B for Slave 0 5 */
#define REG_HMATRIX_PRAS6         REG_ACCESS(RwReg  , 0x400A10B0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 6 */
#define REG_HMATRIX_PRBS6         REG_ACCESS(RwReg  , 0x400A10B4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 6 */
#define REG_HMATRIX_PRAS7         REG_ACCESS(RwReg  , 0x400A10B8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 7 */
#define REG_HMATRIX_PRBS7         REG_ACCESS(RwReg  , 0x400A10BCU) /**< \brief (HMATRIX) Priority Register B for Slave 0 7 */
#define REG_HMATRIX_PRAS8         REG_ACCESS(RwReg  , 0x400A10C0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 8 */
#define REG_HMATRIX_PRBS8         REG_ACCESS(RwReg  , 0x400A10C4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 8 */
#define REG_HMATRIX_PRAS9         REG_ACCESS(RwReg  , 0x400A10C8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 9 */
#define REG_HMATRIX_PRBS9         REG_ACCESS(RwReg  , 0x400A10CCU) /**< \brief (HMATRIX) Priority Register B for Slave 0 9 */
#define REG_HMATRIX_PRAS10        REG_ACCESS(RwReg  , 0x400A10D0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 10 */
#define REG_HMATRIX_PRBS10        REG_ACCESS(RwReg  , 0x400A10D4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 10 */
#define REG_HMATRIX_PRAS11        REG_ACCESS(RwReg  , 0x400A10D8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 11 */
#define REG_HMATRIX_PRBS11        REG_ACCESS(RwReg  , 0x400A10DCU) /**< \brief (HMATRIX) Priority Register B for Slave 0 11 */
#define REG_HMATRIX_PRAS12        REG_ACCESS(RwReg  , 0x400A10E0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 12 */
#define REG_HMATRIX_PRBS12        REG_ACCESS(RwReg  , 0x400A10E4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 12 */
#define REG_HMATRIX_PRAS13        REG_ACCESS(RwReg  , 0x400A10E8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 13 */
#define REG_HMATRIX_PRBS13        REG_ACCESS(RwReg  , 0x400A10ECU) /**< \brief (HMATRIX) Priority Register B for Slave 0 13 */
#define REG_HMATRIX_PRAS14        REG_ACCESS(RwReg  , 0x400A10F0U) /**< \brief (HMATRIX) Priority Register A for Slave 0 14 */
#define REG_HMATRIX_PRBS14        REG_ACCESS(RwReg  , 0x400A10F4U) /**< \brief (HMATRIX) Priority Register B for Slave 0 14 */
#define REG_HMATRIX_PRAS15        REG_ACCESS(RwReg  , 0x400A10F8U) /**< \brief (HMATRIX) Priority Register A for Slave 0 15 */
#define REG_HMATRIX_PRBS15        REG_ACCESS(RwReg  , 0x400A10FCU) /**< \brief (HMATRIX) Priority Register B for Slave 0 15 */
#define REG_HMATRIX_MRCR          REG_ACCESS(RwReg  , 0x400A1100U) /**< \brief (HMATRIX) Master Remap Control Register */ 
#define REG_HMATRIX_SFR0          REG_ACCESS(RwReg  , 0x400A1110U) /**< \brief (HMATRIX) Special Function Register 0 0 */
#define REG_HMATRIX_SFR1          REG_ACCESS(RwReg  , 0x400A1114U) /**< \brief (HMATRIX) Special Function Register 0 1 */
#define REG_HMATRIX_SFR2          REG_ACCESS(RwReg  , 0x400A1118U) /**< \brief (HMATRIX) Special Function Register 0 2 */
#define REG_HMATRIX_SFR3          REG_ACCESS(RwReg  , 0x400A111CU) /**< \brief (HMATRIX) Special Function Register 0 3 */
#define REG_HMATRIX_SFR4          REG_ACCESS(RwReg  , 0x400A1120U) /**< \brief (HMATRIX) Special Function Register 0 4 */
#define REG_HMATRIX_SFR5          REG_ACCESS(RwReg  , 0x400A1124U) /**< \brief (HMATRIX) Special Function Register 0 5 */
#define REG_HMATRIX_SFR6          REG_ACCESS(RwReg  , 0x400A1128U) /**< \brief (HMATRIX) Special Function Register 0 6 */
#define REG_HMATRIX_SFR7          REG_ACCESS(RwReg  , 0x400A112CU) /**< \brief (HMATRIX) Special Function Register 0 7 */
#define REG_HMATRIX_SFR8          REG_ACCESS(RwReg  , 0x400A1130U) /**< \brief (HMATRIX) Special Function Register 0 8 */
#define REG_HMATRIX_SFR9          REG_ACCESS(RwReg  , 0x400A1134U) /**< \brief (HMATRIX) Special Function Register 0 9 */
#define REG_HMATRIX_SFR10         REG_ACCESS(RwReg  , 0x400A1138U) /**< \brief (HMATRIX) Special Function Register 0 10 */
#define REG_HMATRIX_SFR11         REG_ACCESS(RwReg  , 0x400A113CU) /**< \brief (HMATRIX) Special Function Register 0 11 */
#define REG_HMATRIX_SFR12         REG_ACCESS(RwReg  , 0x400A1140U) /**< \brief (HMATRIX) Special Function Register 0 12 */
#define REG_HMATRIX_SFR13         REG_ACCESS(RwReg  , 0x400A1144U) /**< \brief (HMATRIX) Special Function Register 0 13 */
#define REG_HMATRIX_SFR14         REG_ACCESS(RwReg  , 0x400A1148U) /**< \brief (HMATRIX) Special Function Register 0 14 */
#define REG_HMATRIX_SFR15         REG_ACCESS(RwReg  , 0x400A114CU) /**< \brief (HMATRIX) Special Function Register 0 15 */
/* ========== Register definition for PDCA peripheral ========== */
#define REG_PDCA_MAR0             REG_ACCESS(RwReg  , 0x400A2000U) /**< \brief (PDCA) Memory Address Register 0 */
#define REG_PDCA_PSR0             REG_ACCESS(RwReg  , 0x400A2004U) /**< \brief (PDCA) Peripheral Select Register 0 */
#define REG_PDCA_TCR0             REG_ACCESS(RwReg  , 0x400A2008U) /**< \brief (PDCA) Transfer Counter Register 0 */
#define REG_PDCA_MARR0            REG_ACCESS(RwReg  , 0x400A200CU) /**< \brief (PDCA) Memory Address Reload Register 0 */
#define REG_PDCA_TCRR0            REG_ACCESS(RwReg  , 0x400A2010U) /**< \brief (PDCA) Transfer Counter Reload Register 0 */
#define REG_PDCA_CR0              REG_ACCESS(WoReg  , 0x400A2014U) /**< \brief (PDCA) Control Register 0 */
#define REG_PDCA_MR0              REG_ACCESS(RwReg  , 0x400A2018U) /**< \brief (PDCA) Mode Register 0 */
#define REG_PDCA_SR0              REG_ACCESS(RoReg  , 0x400A201CU) /**< \brief (PDCA) Status Register 0 */
#define REG_PDCA_IER0             REG_ACCESS(WoReg  , 0x400A2020U) /**< \brief (PDCA) Interrupt Enable Register 0 */
#define REG_PDCA_IDR0             REG_ACCESS(WoReg  , 0x400A2024U) /**< \brief (PDCA) Interrupt Disable Register 0 */
#define REG_PDCA_IMR0             REG_ACCESS(RoReg  , 0x400A2028U) /**< \brief (PDCA) Interrupt Mask Register 0 */
#define REG_PDCA_ISR0             REG_ACCESS(RoReg  , 0x400A202CU) /**< \brief (PDCA) Interrupt Status Register 0 */
#define REG_PDCA_MAR1             REG_ACCESS(RwReg  , 0x400A2040U) /**< \brief (PDCA) Memory Address Register 1 */
#define REG_PDCA_PSR1             REG_ACCESS(RwReg  , 0x400A2044U) /**< \brief (PDCA) Peripheral Select Register 1 */
#define REG_PDCA_TCR1             REG_ACCESS(RwReg  , 0x400A2048U) /**< \brief (PDCA) Transfer Counter Register 1 */
#define REG_PDCA_MARR1            REG_ACCESS(RwReg  , 0x400A204CU) /**< \brief (PDCA) Memory Address Reload Register 1 */
#define REG_PDCA_TCRR1            REG_ACCESS(RwReg  , 0x400A2050U) /**< \brief (PDCA) Transfer Counter Reload Register 1 */
#define REG_PDCA_CR1              REG_ACCESS(WoReg  , 0x400A2054U) /**< \brief (PDCA) Control Register 1 */
#define REG_PDCA_MR1              REG_ACCESS(RwReg  , 0x400A2058U) /**< \brief (PDCA) Mode Register 1 */
#define REG_PDCA_SR1              REG_ACCESS(RoReg  , 0x400A205CU) /**< \brief (PDCA) Status Register 1 */
#define REG_PDCA_IER1             REG_ACCESS(WoReg  , 0x400A2060U) /**< \brief (PDCA) Interrupt Enable Register 1 */
#define REG_PDCA_IDR1             REG_ACCESS(WoReg  , 0x400A2064U) /**< \brief (PDCA) Interrupt Disable Register 1 */
#define REG_PDCA_IMR1             REG_ACCESS(RoReg  , 0x400A2068U) /**< \brief (PDCA) Interrupt Mask Register 1 */
#define REG_PDCA_ISR1             REG_ACCESS(RoReg  , 0x400A206CU) /**< \brief (PDCA) Interrupt Status Register 1 */
#define REG_PDCA_MAR2             REG_ACCESS(RwReg  , 0x400A2080U) /**< \brief (PDCA) Memory Address Register 2 */
#define REG_PDCA_PSR2             REG_ACCESS(RwReg  , 0x400A2084U) /**< \brief (PDCA) Peripheral Select Register 2 */
#define REG_PDCA_TCR2             REG_ACCESS(RwReg  , 0x400A2088U) /**< \brief (PDCA) Transfer Counter Register 2 */
#define REG_PDCA_MARR2            REG_ACCESS(RwReg  , 0x400A208CU) /**< \brief (PDCA) Memory Address Reload Register 2 */
#define REG_PDCA_TCRR2            REG_ACCESS(RwReg  , 0x400A2090U) /**< \brief (PDCA) Transfer Counter Reload Register 2 */
#define REG_PDCA_CR2              REG_ACCESS(WoReg  , 0x400A2094U) /**< \brief (PDCA) Control Register 2 */
#define REG_PDCA_MR2              REG_ACCESS(RwReg  , 0x400A2098U) /**< \brief (PDCA) Mode Register 2 */
#define REG_PDCA_SR2              REG_ACCESS(RoReg  , 0x400A209CU) /**< \brief (PDCA) Status Register 2 */
#define REG_PDCA_IER2             REG_ACCESS(WoReg  , 0x400A20A0U) /**< \brief (PDCA) Interrupt Enable Register 2 */
#define REG_PDCA_IDR2             REG_ACCESS(WoReg  , 0x400A20A4U) /**< \brief (PDCA) Interrupt Disable Register 2 */
#define REG_PDCA_IMR2             REG_ACCESS(RoReg  , 0x400A20A8U) /**< \brief (PDCA) Interrupt Mask Register 2 */
#define REG_PDCA_ISR2             REG_ACCESS(RoReg  , 0x400A20ACU) /**< \brief (PDCA) Interrupt Status Register 2 */
#define REG_PDCA_MAR3             REG_ACCESS(RwReg  , 0x400A20C0U) /**< \brief (PDCA) Memory Address Register 3 */
#define REG_PDCA_PSR3             REG_ACCESS(RwReg  , 0x400A20C4U) /**< \brief (PDCA) Peripheral Select Register 3 */
#define REG_PDCA_TCR3             REG_ACCESS(RwReg  , 0x400A20C8U) /**< \brief (PDCA) Transfer Counter Register 3 */
#define REG_PDCA_MARR3            REG_ACCESS(RwReg  , 0x400A20CCU) /**< \brief (PDCA) Memory Address Reload Register 3 */
#define REG_PDCA_TCRR3            REG_ACCESS(RwReg  , 0x400A20D0U) /**< \brief (PDCA) Transfer Counter Reload Register 3 */
#define REG_PDCA_CR3              REG_ACCESS(WoReg  , 0x400A20D4U) /**< \brief (PDCA) Control Register 3 */
#define REG_PDCA_MR3              REG_ACCESS(RwReg  , 0x400A20D8U) /**< \brief (PDCA) Mode Register 3 */
#define REG_PDCA_SR3              REG_ACCESS(RoReg  , 0x400A20DCU) /**< \brief (PDCA) Status Register 3 */
#define REG_PDCA_IER3             REG_ACCESS(WoReg  , 0x400A20E0U) /**< \brief (PDCA) Interrupt Enable Register 3 */
#define REG_PDCA_IDR3             REG_ACCESS(WoReg  , 0x400A20E4U) /**< \brief (PDCA) Interrupt Disable Register 3 */
#define REG_PDCA_IMR3             REG_ACCESS(RoReg  , 0x400A20E8U) /**< \brief (PDCA) Interrupt Mask Register 3 */
#define REG_PDCA_ISR3             REG_ACCESS(RoReg  , 0x400A20ECU) /**< \brief (PDCA) Interrupt Status Register 3 */
#define REG_PDCA_MAR4             REG_ACCESS(RwReg  , 0x400A2100U) /**< \brief (PDCA) Memory Address Register 4 */
#define REG_PDCA_PSR4             REG_ACCESS(RwReg  , 0x400A2104U) /**< \brief (PDCA) Peripheral Select Register 4 */
#define REG_PDCA_TCR4             REG_ACCESS(RwReg  , 0x400A2108U) /**< \brief (PDCA) Transfer Counter Register 4 */
#define REG_PDCA_MARR4            REG_ACCESS(RwReg  , 0x400A210CU) /**< \brief (PDCA) Memory Address Reload Register 4 */
#define REG_PDCA_TCRR4            REG_ACCESS(RwReg  , 0x400A2110U) /**< \brief (PDCA) Transfer Counter Reload Register 4 */
#define REG_PDCA_CR4              REG_ACCESS(WoReg  , 0x400A2114U) /**< \brief (PDCA) Control Register 4 */
#define REG_PDCA_MR4              REG_ACCESS(RwReg  , 0x400A2118U) /**< \brief (PDCA) Mode Register 4 */
#define REG_PDCA_SR4              REG_ACCESS(RoReg  , 0x400A211CU) /**< \brief (PDCA) Status Register 4 */
#define REG_PDCA_IER4             REG_ACCESS(WoReg  , 0x400A2120U) /**< \brief (PDCA) Interrupt Enable Register 4 */
#define REG_PDCA_IDR4             REG_ACCESS(WoReg  , 0x400A2124U) /**< \brief (PDCA) Interrupt Disable Register 4 */
#define REG_PDCA_IMR4             REG_ACCESS(RoReg  , 0x400A2128U) /**< \brief (PDCA) Interrupt Mask Register 4 */
#define REG_PDCA_ISR4             REG_ACCESS(RoReg  , 0x400A212CU) /**< \brief (PDCA) Interrupt Status Register 4 */
#define REG_PDCA_MAR5             REG_ACCESS(RwReg  , 0x400A2140U) /**< \brief (PDCA) Memory Address Register 5 */
#define REG_PDCA_PSR5             REG_ACCESS(RwReg  , 0x400A2144U) /**< \brief (PDCA) Peripheral Select Register 5 */
#define REG_PDCA_TCR5             REG_ACCESS(RwReg  , 0x400A2148U) /**< \brief (PDCA) Transfer Counter Register 5 */
#define REG_PDCA_MARR5            REG_ACCESS(RwReg  , 0x400A214CU) /**< \brief (PDCA) Memory Address Reload Register 5 */
#define REG_PDCA_TCRR5            REG_ACCESS(RwReg  , 0x400A2150U) /**< \brief (PDCA) Transfer Counter Reload Register 5 */
#define REG_PDCA_CR5              REG_ACCESS(WoReg  , 0x400A2154U) /**< \brief (PDCA) Control Register 5 */
