Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_PDCA_MR5              REG_ACCESS(RwReg  , 0x400A2158U) /**< \brief (PDCA) Mode Register 5 */
#define REG_PDCA_SR5              REG_ACCESS(RoReg  , 0x400A215CU) /**< \brief (PDCA) Status Register 5 */
#define REG_PDCA_IER5             REG_ACCESS(WoReg  , 0x400A2160U) /**< \brief (PDCA) Interrupt Enable Register 5 */
#define REG_PDCA_IDR5             REG_ACCESS(WoReg  , 0x400A2164U) /**< \brief (PDCA) Interrupt Disable Register 5 */
#define REG_PDCA_IMR5             REG_ACCESS(RoReg  , 0x400A2168U) /**< \brief (PDCA) Interrupt Mask Register 5 */
#define REG_PDCA_ISR5             REG_ACCESS(RoReg  , 0x400A216CU) /**< \brief (PDCA) Interrupt Status Register 5 */
#define REG_PDCA_MAR6             REG_ACCESS(RwReg  , 0x400A2180U) /**< \brief (PDCA) Memory Address Register 6 */
#define REG_PDCA_PSR6             REG_ACCESS(RwReg  , 0x400A2184U) /**< \brief (PDCA) Peripheral Select Register 6 */
#define REG_PDCA_TCR6             REG_ACCESS(RwReg  , 0x400A2188U) /**< \brief (PDCA) Transfer Counter Register 6 */
#define REG_PDCA_MARR6            REG_ACCESS(RwReg  , 0x400A218CU) /**< \brief (PDCA) Memory Address Reload Register 6 */
#define REG_PDCA_TCRR6            REG_ACCESS(RwReg  , 0x400A2190U) /**< \brief (PDCA) Transfer Counter Reload Register 6 */
#define REG_PDCA_CR6              REG_ACCESS(WoReg  , 0x400A2194U) /**< \brief (PDCA) Control Register 6 */
#define REG_PDCA_MR6              REG_ACCESS(RwReg  , 0x400A2198U) /**< \brief (PDCA) Mode Register 6 */
#define REG_PDCA_SR6              REG_ACCESS(RoReg  , 0x400A219CU) /**< \brief (PDCA) Status Register 6 */
#define REG_PDCA_IER6             REG_ACCESS(WoReg  , 0x400A21A0U) /**< \brief (PDCA) Interrupt Enable Register 6 */
#define REG_PDCA_IDR6             REG_ACCESS(WoReg  , 0x400A21A4U) /**< \brief (PDCA) Interrupt Disable Register 6 */
#define REG_PDCA_IMR6             REG_ACCESS(RoReg  , 0x400A21A8U) /**< \brief (PDCA) Interrupt Mask Register 6 */
#define REG_PDCA_ISR6             REG_ACCESS(RoReg  , 0x400A21ACU) /**< \brief (PDCA) Interrupt Status Register 6 */
#define REG_PDCA_MAR7             REG_ACCESS(RwReg  , 0x400A21C0U) /**< \brief (PDCA) Memory Address Register 7 */
#define REG_PDCA_PSR7             REG_ACCESS(RwReg  , 0x400A21C4U) /**< \brief (PDCA) Peripheral Select Register 7 */
#define REG_PDCA_TCR7             REG_ACCESS(RwReg  , 0x400A21C8U) /**< \brief (PDCA) Transfer Counter Register 7 */
#define REG_PDCA_MARR7            REG_ACCESS(RwReg  , 0x400A21CCU) /**< \brief (PDCA) Memory Address Reload Register 7 */
#define REG_PDCA_TCRR7            REG_ACCESS(RwReg  , 0x400A21D0U) /**< \brief (PDCA) Transfer Counter Reload Register 7 */
#define REG_PDCA_CR7              REG_ACCESS(WoReg  , 0x400A21D4U) /**< \brief (PDCA) Control Register 7 */
#define REG_PDCA_MR7              REG_ACCESS(RwReg  , 0x400A21D8U) /**< \brief (PDCA) Mode Register 7 */
#define REG_PDCA_SR7              REG_ACCESS(RoReg  , 0x400A21DCU) /**< \brief (PDCA) Status Register 7 */
#define REG_PDCA_IER7             REG_ACCESS(WoReg  , 0x400A21E0U) /**< \brief (PDCA) Interrupt Enable Register 7 */
#define REG_PDCA_IDR7             REG_ACCESS(WoReg  , 0x400A21E4U) /**< \brief (PDCA) Interrupt Disable Register 7 */
#define REG_PDCA_IMR7             REG_ACCESS(RoReg  , 0x400A21E8U) /**< \brief (PDCA) Interrupt Mask Register 7 */
#define REG_PDCA_ISR7             REG_ACCESS(RoReg  , 0x400A21ECU) /**< \brief (PDCA) Interrupt Status Register 7 */
#define REG_PDCA_MAR8             REG_ACCESS(RwReg  , 0x400A2200U) /**< \brief (PDCA) Memory Address Register 8 */
#define REG_PDCA_PSR8             REG_ACCESS(RwReg  , 0x400A2204U) /**< \brief (PDCA) Peripheral Select Register 8 */
#define REG_PDCA_TCR8             REG_ACCESS(RwReg  , 0x400A2208U) /**< \brief (PDCA) Transfer Counter Register 8 */
#define REG_PDCA_MARR8            REG_ACCESS(RwReg  , 0x400A220CU) /**< \brief (PDCA) Memory Address Reload Register 8 */
#define REG_PDCA_TCRR8            REG_ACCESS(RwReg  , 0x400A2210U) /**< \brief (PDCA) Transfer Counter Reload Register 8 */
#define REG_PDCA_CR8              REG_ACCESS(WoReg  , 0x400A2214U) /**< \brief (PDCA) Control Register 8 */
#define REG_PDCA_MR8              REG_ACCESS(RwReg  , 0x400A2218U) /**< \brief (PDCA) Mode Register 8 */
#define REG_PDCA_SR8              REG_ACCESS(RoReg  , 0x400A221CU) /**< \brief (PDCA) Status Register 8 */
#define REG_PDCA_IER8             REG_ACCESS(WoReg  , 0x400A2220U) /**< \brief (PDCA) Interrupt Enable Register 8 */
#define REG_PDCA_IDR8             REG_ACCESS(WoReg  , 0x400A2224U) /**< \brief (PDCA) Interrupt Disable Register 8 */
#define REG_PDCA_IMR8             REG_ACCESS(RoReg  , 0x400A2228U) /**< \brief (PDCA) Interrupt Mask Register 8 */
#define REG_PDCA_ISR8             REG_ACCESS(RoReg  , 0x400A222CU) /**< \brief (PDCA) Interrupt Status Register 8 */
#define REG_PDCA_MAR9             REG_ACCESS(RwReg  , 0x400A2240U) /**< \brief (PDCA) Memory Address Register 9 */
#define REG_PDCA_PSR9             REG_ACCESS(RwReg  , 0x400A2244U) /**< \brief (PDCA) Peripheral Select Register 9 */
#define REG_PDCA_TCR9             REG_ACCESS(RwReg  , 0x400A2248U) /**< \brief (PDCA) Transfer Counter Register 9 */
#define REG_PDCA_MARR9            REG_ACCESS(RwReg  , 0x400A224CU) /**< \brief (PDCA) Memory Address Reload Register 9 */
#define REG_PDCA_TCRR9            REG_ACCESS(RwReg  , 0x400A2250U) /**< \brief (PDCA) Transfer Counter Reload Register 9 */
#define REG_PDCA_CR9              REG_ACCESS(WoReg  , 0x400A2254U) /**< \brief (PDCA) Control Register 9 */
#define REG_PDCA_MR9              REG_ACCESS(RwReg  , 0x400A2258U) /**< \brief (PDCA) Mode Register 9 */
#define REG_PDCA_SR9              REG_ACCESS(RoReg  , 0x400A225CU) /**< \brief (PDCA) Status Register 9 */
#define REG_PDCA_IER9             REG_ACCESS(WoReg  , 0x400A2260U) /**< \brief (PDCA) Interrupt Enable Register 9 */
#define REG_PDCA_IDR9             REG_ACCESS(WoReg  , 0x400A2264U) /**< \brief (PDCA) Interrupt Disable Register 9 */
#define REG_PDCA_IMR9             REG_ACCESS(RoReg  , 0x400A2268U) /**< \brief (PDCA) Interrupt Mask Register 9 */
#define REG_PDCA_ISR9             REG_ACCESS(RoReg  , 0x400A226CU) /**< \brief (PDCA) Interrupt Status Register 9 */
#define REG_PDCA_MAR10            REG_ACCESS(RwReg  , 0x400A2280U) /**< \brief (PDCA) Memory Address Register 10 */
#define REG_PDCA_PSR10            REG_ACCESS(RwReg  , 0x400A2284U) /**< \brief (PDCA) Peripheral Select Register 10 */
#define REG_PDCA_TCR10            REG_ACCESS(RwReg  , 0x400A2288U) /**< \brief (PDCA) Transfer Counter Register 10 */
#define REG_PDCA_MARR10           REG_ACCESS(RwReg  , 0x400A228CU) /**< \brief (PDCA) Memory Address Reload Register 10 */
#define REG_PDCA_TCRR10           REG_ACCESS(RwReg  , 0x400A2290U) /**< \brief (PDCA) Transfer Counter Reload Register 10 */
#define REG_PDCA_CR10             REG_ACCESS(WoReg  , 0x400A2294U) /**< \brief (PDCA) Control Register 10 */
#define REG_PDCA_MR10             REG_ACCESS(RwReg  , 0x400A2298U) /**< \brief (PDCA) Mode Register 10 */
#define REG_PDCA_SR10             REG_ACCESS(RoReg  , 0x400A229CU) /**< \brief (PDCA) Status Register 10 */
#define REG_PDCA_IER10            REG_ACCESS(WoReg  , 0x400A22A0U) /**< \brief (PDCA) Interrupt Enable Register 10 */
#define REG_PDCA_IDR10            REG_ACCESS(WoReg  , 0x400A22A4U) /**< \brief (PDCA) Interrupt Disable Register 10 */
#define REG_PDCA_IMR10            REG_ACCESS(RoReg  , 0x400A22A8U) /**< \brief (PDCA) Interrupt Mask Register 10 */
#define REG_PDCA_ISR10            REG_ACCESS(RoReg  , 0x400A22ACU) /**< \brief (PDCA) Interrupt Status Register 10 */
#define REG_PDCA_MAR11            REG_ACCESS(RwReg  , 0x400A22C0U) /**< \brief (PDCA) Memory Address Register 11 */
#define REG_PDCA_PSR11            REG_ACCESS(RwReg  , 0x400A22C4U) /**< \brief (PDCA) Peripheral Select Register 11 */
#define REG_PDCA_TCR11            REG_ACCESS(RwReg  , 0x400A22C8U) /**< \brief (PDCA) Transfer Counter Register 11 */
#define REG_PDCA_MARR11           REG_ACCESS(RwReg  , 0x400A22CCU) /**< \brief (PDCA) Memory Address Reload Register 11 */
#define REG_PDCA_TCRR11           REG_ACCESS(RwReg  , 0x400A22D0U) /**< \brief (PDCA) Transfer Counter Reload Register 11 */
#define REG_PDCA_CR11             REG_ACCESS(WoReg  , 0x400A22D4U) /**< \brief (PDCA) Control Register 11 */
#define REG_PDCA_MR11             REG_ACCESS(RwReg  , 0x400A22D8U) /**< \brief (PDCA) Mode Register 11 */
#define REG_PDCA_SR11             REG_ACCESS(RoReg  , 0x400A22DCU) /**< \brief (PDCA) Status Register 11 */
#define REG_PDCA_IER11            REG_ACCESS(WoReg  , 0x400A22E0U) /**< \brief (PDCA) Interrupt Enable Register 11 */
#define REG_PDCA_IDR11            REG_ACCESS(WoReg  , 0x400A22E4U) /**< \brief (PDCA) Interrupt Disable Register 11 */
#define REG_PDCA_IMR11            REG_ACCESS(RoReg  , 0x400A22E8U) /**< \brief (PDCA) Interrupt Mask Register 11 */
#define REG_PDCA_ISR11            REG_ACCESS(RoReg  , 0x400A22ECU) /**< \brief (PDCA) Interrupt Status Register 11 */
#define REG_PDCA_MAR12            REG_ACCESS(RwReg  , 0x400A2300U) /**< \brief (PDCA) Memory Address Register 12 */
#define REG_PDCA_PSR12            REG_ACCESS(RwReg  , 0x400A2304U) /**< \brief (PDCA) Peripheral Select Register 12 */
#define REG_PDCA_TCR12            REG_ACCESS(RwReg  , 0x400A2308U) /**< \brief (PDCA) Transfer Counter Register 12 */
#define REG_PDCA_MARR12           REG_ACCESS(RwReg  , 0x400A230CU) /**< \brief (PDCA) Memory Address Reload Register 12 */
#define REG_PDCA_TCRR12           REG_ACCESS(RwReg  , 0x400A2310U) /**< \brief (PDCA) Transfer Counter Reload Register 12 */
#define REG_PDCA_CR12             REG_ACCESS(WoReg  , 0x400A2314U) /**< \brief (PDCA) Control Register 12 */
#define REG_PDCA_MR12             REG_ACCESS(RwReg  , 0x400A2318U) /**< \brief (PDCA) Mode Register 12 */
#define REG_PDCA_SR12             REG_ACCESS(RoReg  , 0x400A231CU) /**< \brief (PDCA) Status Register 12 */
#define REG_PDCA_IER12            REG_ACCESS(WoReg  , 0x400A2320U) /**< \brief (PDCA) Interrupt Enable Register 12 */
#define REG_PDCA_IDR12            REG_ACCESS(WoReg  , 0x400A2324U) /**< \brief (PDCA) Interrupt Disable Register 12 */
#define REG_PDCA_IMR12            REG_ACCESS(RoReg  , 0x400A2328U) /**< \brief (PDCA) Interrupt Mask Register 12 */
#define REG_PDCA_ISR12            REG_ACCESS(RoReg  , 0x400A232CU) /**< \brief (PDCA) Interrupt Status Register 12 */
#define REG_PDCA_MAR13            REG_ACCESS(RwReg  , 0x400A2340U) /**< \brief (PDCA) Memory Address Register 13 */
#define REG_PDCA_PSR13            REG_ACCESS(RwReg  , 0x400A2344U) /**< \brief (PDCA) Peripheral Select Register 13 */
#define REG_PDCA_TCR13            REG_ACCESS(RwReg  , 0x400A2348U) /**< \brief (PDCA) Transfer Counter Register 13 */
#define REG_PDCA_MARR13           REG_ACCESS(RwReg  , 0x400A234CU) /**< \brief (PDCA) Memory Address Reload Register 13 */
#define REG_PDCA_TCRR13           REG_ACCESS(RwReg  , 0x400A2350U) /**< \brief (PDCA) Transfer Counter Reload Register 13 */
#define REG_PDCA_CR13             REG_ACCESS(WoReg  , 0x400A2354U) /**< \brief (PDCA) Control Register 13 */
#define REG_PDCA_MR13             REG_ACCESS(RwReg  , 0x400A2358U) /**< \brief (PDCA) Mode Register 13 */
#define REG_PDCA_SR13             REG_ACCESS(RoReg  , 0x400A235CU) /**< \brief (PDCA) Status Register 13 */
#define REG_PDCA_IER13            REG_ACCESS(WoReg  , 0x400A2360U) /**< \brief (PDCA) Interrupt Enable Register 13 */
#define REG_PDCA_IDR13            REG_ACCESS(WoReg  , 0x400A2364U) /**< \brief (PDCA) Interrupt Disable Register 13 */
#define REG_PDCA_IMR13            REG_ACCESS(RoReg  , 0x400A2368U) /**< \brief (PDCA) Interrupt Mask Register 13 */
#define REG_PDCA_ISR13            REG_ACCESS(RoReg  , 0x400A236CU) /**< \brief (PDCA) Interrupt Status Register 13 */
#define REG_PDCA_MAR14            REG_ACCESS(RwReg  , 0x400A2380U) /**< \brief (PDCA) Memory Address Register 14 */
#define REG_PDCA_PSR14            REG_ACCESS(RwReg  , 0x400A2384U) /**< \brief (PDCA) Peripheral Select Register 14 */
#define REG_PDCA_TCR14            REG_ACCESS(RwReg  , 0x400A2388U) /**< \brief (PDCA) Transfer Counter Register 14 */
#define REG_PDCA_MARR14           REG_ACCESS(RwReg  , 0x400A238CU) /**< \brief (PDCA) Memory Address Reload Register 14 */
#define REG_PDCA_TCRR14           REG_ACCESS(RwReg  , 0x400A2390U) /**< \brief (PDCA) Transfer Counter Reload Register 14 */
#define REG_PDCA_CR14             REG_ACCESS(WoReg  , 0x400A2394U) /**< \brief (PDCA) Control Register 14 */
#define REG_PDCA_MR14             REG_ACCESS(RwReg  , 0x400A2398U) /**< \brief (PDCA) Mode Register 14 */
#define REG_PDCA_SR14             REG_ACCESS(RoReg  , 0x400A239CU) /**< \brief (PDCA) Status Register 14 */
#define REG_PDCA_IER14            REG_ACCESS(WoReg  , 0x400A23A0U) /**< \brief (PDCA) Interrupt Enable Register 14 */
#define REG_PDCA_IDR14            REG_ACCESS(WoReg  , 0x400A23A4U) /**< \brief (PDCA) Interrupt Disable Register 14 */
#define REG_PDCA_IMR14            REG_ACCESS(RoReg  , 0x400A23A8U) /**< \brief (PDCA) Interrupt Mask Register 14 */
#define REG_PDCA_ISR14            REG_ACCESS(RoReg  , 0x400A23ACU) /**< \brief (PDCA) Interrupt Status Register 14 */
#define REG_PDCA_MAR15            REG_ACCESS(RwReg  , 0x400A23C0U) /**< \brief (PDCA) Memory Address Register 15 */
#define REG_PDCA_PSR15            REG_ACCESS(RwReg  , 0x400A23C4U) /**< \brief (PDCA) Peripheral Select Register 15 */
#define REG_PDCA_TCR15            REG_ACCESS(RwReg  , 0x400A23C8U) /**< \brief (PDCA) Transfer Counter Register 15 */
#define REG_PDCA_MARR15           REG_ACCESS(RwReg  , 0x400A23CCU) /**< \brief (PDCA) Memory Address Reload Register 15 */
#define REG_PDCA_TCRR15           REG_ACCESS(RwReg  , 0x400A23D0U) /**< \brief (PDCA) Transfer Counter Reload Register 15 */
#define REG_PDCA_CR15             REG_ACCESS(WoReg  , 0x400A23D4U) /**< \brief (PDCA) Control Register 15 */
#define REG_PDCA_MR15             REG_ACCESS(RwReg  , 0x400A23D8U) /**< \brief (PDCA) Mode Register 15 */
#define REG_PDCA_SR15             REG_ACCESS(RoReg  , 0x400A23DCU) /**< \brief (PDCA) Status Register 15 */
#define REG_PDCA_IER15            REG_ACCESS(WoReg  , 0x400A23E0U) /**< \brief (PDCA) Interrupt Enable Register 15 */
#define REG_PDCA_IDR15            REG_ACCESS(WoReg  , 0x400A23E4U) /**< \brief (PDCA) Interrupt Disable Register 15 */
#define REG_PDCA_IMR15            REG_ACCESS(RoReg  , 0x400A23E8U) /**< \brief (PDCA) Interrupt Mask Register 15 */
#define REG_PDCA_ISR15            REG_ACCESS(RoReg  , 0x400A23ECU) /**< \brief (PDCA) Interrupt Status Register 15 */
#define REG_PDCA_PCONTROL         REG_ACCESS(RwReg  , 0x400A2800U) /**< \brief (PDCA) Performance Control Register */ 
#define REG_PDCA_PRDATA0          REG_ACCESS(RoReg  , 0x400A2804U) /**< \brief (PDCA) Channel 0 Read Data Cycles */ 
#define REG_PDCA_PRSTALL0         REG_ACCESS(RoReg  , 0x400A2808U) /**< \brief (PDCA) Channel 0 Read Stall Cycles */ 
#define REG_PDCA_PRLAT0           REG_ACCESS(RoReg  , 0x400A280CU) /**< \brief (PDCA) Channel 0 Read Max Latency */ 
#define REG_PDCA_PWDATA0          REG_ACCESS(RoReg  , 0x400A2810U) /**< \brief (PDCA) Channel 0 Write Data Cycles */ 
#define REG_PDCA_PWSTALL0         REG_ACCESS(RoReg  , 0x400A2814U) /**< \brief (PDCA) Channel 0 Write Stall Cycles */ 
#define REG_PDCA_PWLAT0           REG_ACCESS(RoReg  , 0x400A2818U) /**< \brief (PDCA) Channel0 Write Max Latency */ 
#define REG_PDCA_PRDATA1          REG_ACCESS(RoReg  , 0x400A281CU) /**< \brief (PDCA) Channel 1 Read Data Cycles */ 
#define REG_PDCA_PRSTALL1         REG_ACCESS(RoReg  , 0x400A2820U) /**< \brief (PDCA) Channel Read Stall Cycles */ 
#define REG_PDCA_PRLAT1           REG_ACCESS(RoReg  , 0x400A2824U) /**< \brief (PDCA) Channel 1 Read Max Latency */ 
#define REG_PDCA_PWDATA1          REG_ACCESS(RoReg  , 0x400A2828U) /**< \brief (PDCA) Channel 1 Write Data Cycles */ 
#define REG_PDCA_PWSTALL1         REG_ACCESS(RoReg  , 0x400A282CU) /**< \brief (PDCA) Channel 1 Write stall Cycles */ 
#define REG_PDCA_PWLAT1           REG_ACCESS(RoReg  , 0x400A2830U) /**< \brief (PDCA) Channel 1 Read Max Latency */ 
#define REG_PDCA_VERSION          REG_ACCESS(RoReg  , 0x400A2834U) /**< \brief (PDCA) Version Register */ 
/* ========== Register definition for SMAP peripheral ========== */
#define REG_SMAP_CR               REG_ACCESS(WoReg  , 0x400A3000U) /**< \brief (SMAP) Control Register */ 
#define REG_SMAP_SR               REG_ACCESS(RoReg  , 0x400A3004U) /**< \brief (SMAP) Status Register */ 
#define REG_SMAP_SCR              REG_ACCESS(WoReg  , 0x400A3008U) /**< \brief (SMAP) Status Clear Register */ 
#define REG_SMAP_ADDR             REG_ACCESS(RwReg  , 0x400A300CU) /**< \brief (SMAP) Address Register */ 
#define REG_SMAP_LENGTH           REG_ACCESS(RwReg  , 0x400A3010U) /**< \brief (SMAP) Length Register */ 
#define REG_SMAP_DATA             REG_ACCESS(RwReg  , 0x400A3014U) /**< \brief (SMAP) Data Register */ 
#define REG_SMAP_VERSION          REG_ACCESS(RoReg  , 0x400A3028U) /**< \brief (SMAP) VERSION register */ 
#define REG_SMAP_CIDR             REG_ACCESS(RoReg  , 0x400A30F0U) /**< \brief (SMAP) Chip ID Register */ 
#define REG_SMAP_EXID             REG_ACCESS(RoReg  , 0x400A30F4U) /**< \brief (SMAP) Chip ID Extension Register */ 
#define REG_SMAP_IDR              REG_ACCESS(RoReg  , 0x400A30FCU) /**< \brief (SMAP) AP Identification register */ 
/* ========== Register definition for CRCCU peripheral ========== */
#define REG_CRCCU_DSCR            REG_ACCESS(RwReg  , 0x400A4000U) /**< \brief (CRCCU) Descriptor Base Register */ 
#define REG_CRCCU_DMAEN           REG_ACCESS(WoReg  , 0x400A4008U) /**< \brief (CRCCU) DMA Enable Register */ 
#define REG_CRCCU_DMADIS          REG_ACCESS(WoReg  , 0x400A400CU) /**< \brief (CRCCU) DMA Disable Register */ 
#define REG_CRCCU_DMASR           REG_ACCESS(RoReg  , 0x400A4010U) /**< \brief (CRCCU) DMA Status Register */ 
#define REG_CRCCU_DMAIER          REG_ACCESS(WoReg  , 0x400A4014U) /**< \brief (CRCCU) DMA Interrupt Enable Register */ 
#define REG_CRCCU_DMAIDR          REG_ACCESS(WoReg  , 0x400A4018U) /**< \brief (CRCCU) DMA Interrupt Disable Register */ 
#define REG_CRCCU_DMAIMR          REG_ACCESS(RoReg  , 0x400A401CU) /**< \brief (CRCCU) DMA Interrupt Mask Register */ 
#define REG_CRCCU_DMAISR          REG_ACCESS(RoReg  , 0x400A4020U) /**< \brief (CRCCU) DMA Interrupt Status Register */ 
#define REG_CRCCU_CR              REG_ACCESS(WoReg  , 0x400A4034U) /**< \brief (CRCCU) Control Register */ 
#define REG_CRCCU_MR              REG_ACCESS(RwReg  , 0x400A4038U) /**< \brief (CRCCU) Mode Register */ 
#define REG_CRCCU_SR              REG_ACCESS(RoReg  , 0x400A403CU) /**< \brief (CRCCU) Status Register */ 
#define REG_CRCCU_IER             REG_ACCESS(WoReg  , 0x400A4040U) /**< \brief (CRCCU) Interrupt Enable Register */ 
#define REG_CRCCU_IDR             REG_ACCESS(WoReg  , 0x400A4044U) /**< \brief (CRCCU) Interrupt Disable Register */ 
#define REG_CRCCU_IMR             REG_ACCESS(RoReg  , 0x400A4048U) /**< \brief (CRCCU) Interrupt Mask Register */ 
#define REG_CRCCU_ISR             REG_ACCESS(RoReg  , 0x400A404CU) /**< \brief (CRCCU) Interrupt Status Register */ 
#define REG_CRCCU_VERSION         REG_ACCESS(RoReg  , 0x400A40FCU) /**< \brief (CRCCU) Version Register */ 
/* ========== Register definition for USBC peripheral ========== */
#define REG_USBC_UDCON            REG_ACCESS(RwReg  , 0x400A5000U) /**< \brief (USBC) Device General Control Register */ 
#define REG_USBC_UDINT            REG_ACCESS(RoReg  , 0x400A5004U) /**< \brief (USBC) Device Global Interupt Register */ 
#define REG_USBC_UDINTCLR         REG_ACCESS(WoReg  , 0x400A5008U) /**< \brief (USBC) Device Global Interrupt Clear Register */ 
#define REG_USBC_UDINTSET         REG_ACCESS(WoReg  , 0x400A500CU) /**< \brief (USBC) Device Global Interrupt Set Regsiter */ 
#define REG_USBC_UDINTE           REG_ACCESS(RoReg  , 0x400A5010U) /**< \brief (USBC) Device Global Interrupt Enable Register */ 
#define REG_USBC_UDINTECLR        REG_ACCESS(WoReg  , 0x400A5014U) /**< \brief (USBC) Device Global Interrupt Enable Clear Register */ 
#define REG_USBC_UDINTESET        REG_ACCESS(WoReg  , 0x400A5018U) /**< \brief (USBC) Device Global Interrupt Enable Set Register */ 
#define REG_USBC_UERST            REG_ACCESS(RwReg  , 0x400A501CU) /**< \brief (USBC) Endpoint Enable/Reset Register */ 
#define REG_USBC_UDFNUM           REG_ACCESS(RoReg  , 0x400A5020U) /**< \brief (USBC) Device Frame Number Register */ 
#define REG_USBC_UECFG0           REG_ACCESS(RwReg  , 0x400A5100U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG1           REG_ACCESS(RwReg  , 0x400A5104U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG2           REG_ACCESS(RwReg  , 0x400A5108U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG3           REG_ACCESS(RwReg  , 0x400A510CU) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG4           REG_ACCESS(RwReg  , 0x400A5110U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG5           REG_ACCESS(RwReg  , 0x400A5114U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG6           REG_ACCESS(RwReg  , 0x400A5118U) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UECFG7           REG_ACCESS(RwReg  , 0x400A511CU) /**< \brief (USBC) Endpoint Configuration Register */ 
#define REG_USBC_UESTA0           REG_ACCESS(RoReg  , 0x400A5130U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA1           REG_ACCESS(RoReg  , 0x400A5134U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA2           REG_ACCESS(RoReg  , 0x400A5138U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA3           REG_ACCESS(RoReg  , 0x400A513CU) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA4           REG_ACCESS(RoReg  , 0x400A5140U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA5           REG_ACCESS(RoReg  , 0x400A5144U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA6           REG_ACCESS(RoReg  , 0x400A5148U) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA7           REG_ACCESS(RoReg  , 0x400A514CU) /**< \brief (USBC) Endpoint Status Register */ 
#define REG_USBC_UESTA0CLR        REG_ACCESS(WoReg  , 0x400A5160U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA1CLR        REG_ACCESS(WoReg  , 0x400A5164U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA2CLR        REG_ACCESS(WoReg  , 0x400A5168U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA3CLR        REG_ACCESS(WoReg  , 0x400A516CU) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA4CLR        REG_ACCESS(WoReg  , 0x400A5170U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA5CLR        REG_ACCESS(WoReg  , 0x400A5174U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA6CLR        REG_ACCESS(WoReg  , 0x400A5178U) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA7CLR        REG_ACCESS(WoReg  , 0x400A517CU) /**< \brief (USBC) Endpoint Status Clear Register */ 
#define REG_USBC_UESTA0SET        REG_ACCESS(WoReg  , 0x400A5190U) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA1SET        REG_ACCESS(WoReg  , 0x400A5194U) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA2SET        REG_ACCESS(WoReg  , 0x400A5198U) /**< \brief (USBC) Endpoint Status Set Register */ 
