Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_USBC_UESTA3SET        REG_ACCESS(WoReg  , 0x400A519CU) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA4SET        REG_ACCESS(WoReg  , 0x400A51A0U) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA5SET        REG_ACCESS(WoReg  , 0x400A51A4U) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA6SET        REG_ACCESS(WoReg  , 0x400A51A8U) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UESTA7SET        REG_ACCESS(WoReg  , 0x400A51ACU) /**< \brief (USBC) Endpoint Status Set Register */ 
#define REG_USBC_UECON0           REG_ACCESS(RoReg  , 0x400A51C0U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON1           REG_ACCESS(RoReg  , 0x400A51C4U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON2           REG_ACCESS(RoReg  , 0x400A51C8U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON3           REG_ACCESS(RoReg  , 0x400A51CCU) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON4           REG_ACCESS(RoReg  , 0x400A51D0U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON5           REG_ACCESS(RoReg  , 0x400A51D4U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON6           REG_ACCESS(RoReg  , 0x400A51D8U) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON7           REG_ACCESS(RoReg  , 0x400A51DCU) /**< \brief (USBC) Endpoint Control Register */ 
#define REG_USBC_UECON0SET        REG_ACCESS(WoReg  , 0x400A51F0U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON1SET        REG_ACCESS(WoReg  , 0x400A51F4U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON2SET        REG_ACCESS(WoReg  , 0x400A51F8U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON3SET        REG_ACCESS(WoReg  , 0x400A51FCU) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON4SET        REG_ACCESS(WoReg  , 0x400A5200U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON5SET        REG_ACCESS(WoReg  , 0x400A5204U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON6SET        REG_ACCESS(WoReg  , 0x400A5208U) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON7SET        REG_ACCESS(WoReg  , 0x400A520CU) /**< \brief (USBC) Endpoint Control Set Register */ 
#define REG_USBC_UECON0CLR        REG_ACCESS(WoReg  , 0x400A5220U) /**< \brief (USBC) Endpoint Control Clear Register */ 
#define REG_USBC_UECON1CLR        REG_ACCESS(WoReg  , 0x400A5224U) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON2CLR        REG_ACCESS(WoReg  , 0x400A5228U) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON3CLR        REG_ACCESS(WoReg  , 0x400A522CU) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON4CLR        REG_ACCESS(WoReg  , 0x400A5230U) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON5CLR        REG_ACCESS(WoReg  , 0x400A5234U) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON6CLR        REG_ACCESS(WoReg  , 0x400A5238U) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UECON7CLR        REG_ACCESS(WoReg  , 0x400A523CU) /**< \brief (USBC) TXINE Clear */ 
#define REG_USBC_UHCON            REG_ACCESS(RwReg  , 0x400A5400U) /**< \brief (USBC) Host General Control Register */ 
#define REG_USBC_UHINT            REG_ACCESS(RoReg  , 0x400A5404U) /**< \brief (USBC) Host Global Interrupt Register */ 
#define REG_USBC_UHINTCLR         REG_ACCESS(WoReg  , 0x400A5408U) /**< \brief (USBC) Host Global Interrrupt Clear Register */ 
#define REG_USBC_UHINTSET         REG_ACCESS(WoReg  , 0x400A540CU) /**< \brief (USBC) Host Global Interrupt Set Register */ 
#define REG_USBC_UHINTE           REG_ACCESS(RoReg  , 0x400A5410U) /**< \brief (USBC) Host Global Interrupt Enable Register */ 
#define REG_USBC_UHINTECLR        REG_ACCESS(WoReg  , 0x400A5414U) /**< \brief (USBC) Host Global Interrupt Enable Clear Register */ 
#define REG_USBC_UHINTESET        REG_ACCESS(WoReg  , 0x400A5418U) /**< \brief (USBC) Host Global Interrupt Enable Set Register */ 
#define REG_USBC_UPRST            REG_ACCESS(RwReg  , 0x400A541CU) /**< \brief (USBC) Pipe Reset Register */ 
#define REG_USBC_UHFNUM           REG_ACCESS(RwReg  , 0x400A5420U) /**< \brief (USBC) Host Frame Number Register */ 
#define REG_USBC_UHSOFC           REG_ACCESS(RwReg  , 0x400A5424U) /**< \brief (USBC) Host Start of Frame Control Register */ 
#define REG_USBC_UPCFG0           REG_ACCESS(RwReg  , 0x400A5500U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG1           REG_ACCESS(RwReg  , 0x400A5504U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG2           REG_ACCESS(RwReg  , 0x400A5508U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG3           REG_ACCESS(RwReg  , 0x400A550CU) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG4           REG_ACCESS(RwReg  , 0x400A5510U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG5           REG_ACCESS(RwReg  , 0x400A5514U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG6           REG_ACCESS(RwReg  , 0x400A5518U) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPCFG7           REG_ACCESS(RwReg  , 0x400A551CU) /**< \brief (USBC) Pipe Configuration Register */ 
#define REG_USBC_UPSTA0           REG_ACCESS(RoReg  , 0x400A5530U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA1           REG_ACCESS(RoReg  , 0x400A5534U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA2           REG_ACCESS(RoReg  , 0x400A5538U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA3           REG_ACCESS(RoReg  , 0x400A553CU) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA4           REG_ACCESS(RoReg  , 0x400A5540U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA5           REG_ACCESS(RoReg  , 0x400A5544U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA6           REG_ACCESS(RoReg  , 0x400A5548U) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA7           REG_ACCESS(RoReg  , 0x400A554CU) /**< \brief (USBC) Pipe Status Register */ 
#define REG_USBC_UPSTA0CLR        REG_ACCESS(WoReg  , 0x400A5560U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA1CLR        REG_ACCESS(WoReg  , 0x400A5564U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA2CLR        REG_ACCESS(WoReg  , 0x400A5568U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA3CLR        REG_ACCESS(WoReg  , 0x400A556CU) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA4CLR        REG_ACCESS(WoReg  , 0x400A5570U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA5CLR        REG_ACCESS(WoReg  , 0x400A5574U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA6CLR        REG_ACCESS(WoReg  , 0x400A5578U) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA7CLR        REG_ACCESS(WoReg  , 0x400A557CU) /**< \brief (USBC) Pipe Status Clear Register */ 
#define REG_USBC_UPSTA0SET        REG_ACCESS(WoReg  , 0x400A5590U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA1SET        REG_ACCESS(WoReg  , 0x400A5594U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA2SET        REG_ACCESS(WoReg  , 0x400A5598U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA3SET        REG_ACCESS(WoReg  , 0x400A559CU) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA4SET        REG_ACCESS(WoReg  , 0x400A55A0U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA5SET        REG_ACCESS(WoReg  , 0x400A55A4U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA6SET        REG_ACCESS(WoReg  , 0x400A55A8U) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPSTA7SET        REG_ACCESS(WoReg  , 0x400A55ACU) /**< \brief (USBC) Pipe Status Set Register */ 
#define REG_USBC_UPCON0           REG_ACCESS(RoReg  , 0x400A55C0U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON1           REG_ACCESS(RoReg  , 0x400A55C4U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON2           REG_ACCESS(RoReg  , 0x400A55C8U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON3           REG_ACCESS(RoReg  , 0x400A55CCU) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON4           REG_ACCESS(RoReg  , 0x400A55D0U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON5           REG_ACCESS(RoReg  , 0x400A55D4U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON6           REG_ACCESS(RoReg  , 0x400A55D8U) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON7           REG_ACCESS(RoReg  , 0x400A55DCU) /**< \brief (USBC) Pipe Control Register */ 
#define REG_USBC_UPCON0SET        REG_ACCESS(WoReg  , 0x400A55F0U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON1SET        REG_ACCESS(WoReg  , 0x400A55F4U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON2SET        REG_ACCESS(WoReg  , 0x400A55F8U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON3SET        REG_ACCESS(WoReg  , 0x400A55FCU) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON4SET        REG_ACCESS(WoReg  , 0x400A5600U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON5SET        REG_ACCESS(WoReg  , 0x400A5604U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON6SET        REG_ACCESS(WoReg  , 0x400A5608U) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON7SET        REG_ACCESS(WoReg  , 0x400A560CU) /**< \brief (USBC) Pipe Control Set Register */ 
#define REG_USBC_UPCON0CLR        REG_ACCESS(WoReg  , 0x400A5620U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON1CLR        REG_ACCESS(WoReg  , 0x400A5624U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON2CLR        REG_ACCESS(WoReg  , 0x400A5628U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON3CLR        REG_ACCESS(WoReg  , 0x400A562CU) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON4CLR        REG_ACCESS(WoReg  , 0x400A5630U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON5CLR        REG_ACCESS(WoReg  , 0x400A5634U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON6CLR        REG_ACCESS(WoReg  , 0x400A5638U) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPCON7CLR        REG_ACCESS(WoReg  , 0x400A563CU) /**< \brief (USBC) Pipe Control Clear Register */ 
#define REG_USBC_UPINRQ0          REG_ACCESS(RwReg  , 0x400A5650U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ1          REG_ACCESS(RwReg  , 0x400A5654U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ2          REG_ACCESS(RwReg  , 0x400A5658U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ3          REG_ACCESS(RwReg  , 0x400A565CU) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ4          REG_ACCESS(RwReg  , 0x400A5660U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ5          REG_ACCESS(RwReg  , 0x400A5664U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ6          REG_ACCESS(RwReg  , 0x400A5668U) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_UPINRQ7          REG_ACCESS(RwReg  , 0x400A566CU) /**< \brief (USBC) Pipe In Request */ 
#define REG_USBC_USBCON           REG_ACCESS(RwReg  , 0x400A5800U) /**< \brief (USBC) General Control Register */ 
#define REG_USBC_USBSTA           REG_ACCESS(RoReg  , 0x400A5804U) /**< \brief (USBC) General Status Register */ 
#define REG_USBC_USBSTACLR        REG_ACCESS(WoReg  , 0x400A5808U) /**< \brief (USBC) General Status Clear Register */ 
#define REG_USBC_USBSTASET        REG_ACCESS(WoReg  , 0x400A580CU) /**< \brief (USBC) General Status Set Register */ 
#define REG_USBC_UVERS            REG_ACCESS(RoReg  , 0x400A5818U) /**< \brief (USBC) IP Version Register */ 
#define REG_USBC_UFEATURES        REG_ACCESS(RoReg  , 0x400A581CU) /**< \brief (USBC) IP Features Register */ 
#define REG_USBC_UADDRSIZE        REG_ACCESS(RoReg  , 0x400A5820U) /**< \brief (USBC) IP PB address size Register */ 
#define REG_USBC_UNAME1           REG_ACCESS(RoReg  , 0x400A5824U) /**< \brief (USBC) IP Name Part One: HUSB */ 
#define REG_USBC_UNAME2           REG_ACCESS(RoReg  , 0x400A5828U) /**< \brief (USBC) IP Name Part Two: HOST */ 
#define REG_USBC_USBFSM           REG_ACCESS(RoReg  , 0x400A582CU) /**< \brief (USBC) USB internal finite state machine */ 
#define REG_USBC_UDESC            REG_ACCESS(RwReg  , 0x400A5830U) /**< \brief (USBC) Endpoint descriptor table */ 
/* ========== Register definition for PEVC peripheral ========== */
#define REG_PEVC_CHSR             REG_ACCESS(RoReg  , 0x400A6000U) /**< \brief (PEVC) Channel Status Register */ 
#define REG_PEVC_CHER             REG_ACCESS(WoReg  , 0x400A6004U) /**< \brief (PEVC) Channel Enable Register */ 
#define REG_PEVC_CHDR             REG_ACCESS(WoReg  , 0x400A6008U) /**< \brief (PEVC) Channel Disable Register */ 
#define REG_PEVC_SEV              REG_ACCESS(WoReg  , 0x400A6010U) /**< \brief (PEVC) Software Event */ 
#define REG_PEVC_BUSY             REG_ACCESS(RoReg  , 0x400A6014U) /**< \brief (PEVC) Channel / User Busy */ 
#define REG_PEVC_TRIER            REG_ACCESS(WoReg  , 0x400A6020U) /**< \brief (PEVC) Trigger Interrupt Mask Enable Register */ 
#define REG_PEVC_TRIDR            REG_ACCESS(WoReg  , 0x400A6024U) /**< \brief (PEVC) Trigger Interrupt Mask Disable Register */ 
#define REG_PEVC_TRIMR            REG_ACCESS(RoReg  , 0x400A6028U) /**< \brief (PEVC) Trigger Interrupt Mask Register */ 
#define REG_PEVC_TRSR             REG_ACCESS(RoReg  , 0x400A6030U) /**< \brief (PEVC) Trigger Status Register */ 
#define REG_PEVC_TRSCR            REG_ACCESS(WoReg  , 0x400A6034U) /**< \brief (PEVC) Trigger Status Clear Register */ 
#define REG_PEVC_OVIER            REG_ACCESS(WoReg  , 0x400A6040U) /**< \brief (PEVC) Overrun Interrupt Mask Enable Register */ 
#define REG_PEVC_OVIDR            REG_ACCESS(WoReg  , 0x400A6044U) /**< \brief (PEVC) Overrun Interrupt Mask Disable Register */ 
#define REG_PEVC_OVIMR            REG_ACCESS(RoReg  , 0x400A6048U) /**< \brief (PEVC) Overrun Interrupt Mask Register */ 
#define REG_PEVC_OVSR             REG_ACCESS(RoReg  , 0x400A6050U) /**< \brief (PEVC) Overrun Status Register */ 
#define REG_PEVC_OVSCR            REG_ACCESS(WoReg  , 0x400A6054U) /**< \brief (PEVC) Overrun Status Clear Register */ 
#define REG_PEVC_CHMX0            REG_ACCESS(RwReg  , 0x400A6100U) /**< \brief (PEVC) Channel Multiplexer 0 0 */
#define REG_PEVC_CHMX1            REG_ACCESS(RwReg  , 0x400A6104U) /**< \brief (PEVC) Channel Multiplexer 0 1 */
#define REG_PEVC_CHMX2            REG_ACCESS(RwReg  , 0x400A6108U) /**< \brief (PEVC) Channel Multiplexer 0 2 */
#define REG_PEVC_CHMX3            REG_ACCESS(RwReg  , 0x400A610CU) /**< \brief (PEVC) Channel Multiplexer 0 3 */
#define REG_PEVC_CHMX4            REG_ACCESS(RwReg  , 0x400A6110U) /**< \brief (PEVC) Channel Multiplexer 0 4 */
#define REG_PEVC_CHMX5            REG_ACCESS(RwReg  , 0x400A6114U) /**< \brief (PEVC) Channel Multiplexer 0 5 */
#define REG_PEVC_CHMX6            REG_ACCESS(RwReg  , 0x400A6118U) /**< \brief (PEVC) Channel Multiplexer 0 6 */
#define REG_PEVC_CHMX7            REG_ACCESS(RwReg  , 0x400A611CU) /**< \brief (PEVC) Channel Multiplexer 0 7 */
#define REG_PEVC_CHMX8            REG_ACCESS(RwReg  , 0x400A6120U) /**< \brief (PEVC) Channel Multiplexer 0 8 */
#define REG_PEVC_CHMX9            REG_ACCESS(RwReg  , 0x400A6124U) /**< \brief (PEVC) Channel Multiplexer 0 9 */
#define REG_PEVC_CHMX10           REG_ACCESS(RwReg  , 0x400A6128U) /**< \brief (PEVC) Channel Multiplexer 0 10 */
#define REG_PEVC_CHMX11           REG_ACCESS(RwReg  , 0x400A612CU) /**< \brief (PEVC) Channel Multiplexer 0 11 */
#define REG_PEVC_CHMX12           REG_ACCESS(RwReg  , 0x400A6130U) /**< \brief (PEVC) Channel Multiplexer 0 12 */
#define REG_PEVC_CHMX13           REG_ACCESS(RwReg  , 0x400A6134U) /**< \brief (PEVC) Channel Multiplexer 0 13 */
#define REG_PEVC_CHMX14           REG_ACCESS(RwReg  , 0x400A6138U) /**< \brief (PEVC) Channel Multiplexer 0 14 */
#define REG_PEVC_CHMX15           REG_ACCESS(RwReg  , 0x400A613CU) /**< \brief (PEVC) Channel Multiplexer 0 15 */
#define REG_PEVC_CHMX16           REG_ACCESS(RwReg  , 0x400A6140U) /**< \brief (PEVC) Channel Multiplexer 0 16 */
#define REG_PEVC_CHMX17           REG_ACCESS(RwReg  , 0x400A6144U) /**< \brief (PEVC) Channel Multiplexer 0 17 */
#define REG_PEVC_CHMX18           REG_ACCESS(RwReg  , 0x400A6148U) /**< \brief (PEVC) Channel Multiplexer 0 18 */
#define REG_PEVC_EVS0             REG_ACCESS(RwReg  , 0x400A6200U) /**< \brief (PEVC) Event Shaper 0 0 */
#define REG_PEVC_EVS1             REG_ACCESS(RwReg  , 0x400A6204U) /**< \brief (PEVC) Event Shaper 0 1 */
#define REG_PEVC_EVS2             REG_ACCESS(RwReg  , 0x400A6208U) /**< \brief (PEVC) Event Shaper 0 2 */
#define REG_PEVC_EVS3             REG_ACCESS(RwReg  , 0x400A620CU) /**< \brief (PEVC) Event Shaper 0 3 */
#define REG_PEVC_EVS4             REG_ACCESS(RwReg  , 0x400A6210U) /**< \brief (PEVC) Event Shaper 0 4 */
#define REG_PEVC_EVS5             REG_ACCESS(RwReg  , 0x400A6214U) /**< \brief (PEVC) Event Shaper 0 5 */
#define REG_PEVC_EVS6             REG_ACCESS(RwReg  , 0x400A6218U) /**< \brief (PEVC) Event Shaper 0 6 */
#define REG_PEVC_EVS7             REG_ACCESS(RwReg  , 0x400A621CU) /**< \brief (PEVC) Event Shaper 0 7 */
#define REG_PEVC_EVS8             REG_ACCESS(RwReg  , 0x400A6220U) /**< \brief (PEVC) Event Shaper 0 8 */
#define REG_PEVC_EVS9             REG_ACCESS(RwReg  , 0x400A6224U) /**< \brief (PEVC) Event Shaper 0 9 */
#define REG_PEVC_EVS10            REG_ACCESS(RwReg  , 0x400A6228U) /**< \brief (PEVC) Event Shaper 0 10 */
#define REG_PEVC_EVS11            REG_ACCESS(RwReg  , 0x400A622CU) /**< \brief (PEVC) Event Shaper 0 11 */
#define REG_PEVC_EVS12            REG_ACCESS(RwReg  , 0x400A6230U) /**< \brief (PEVC) Event Shaper 0 12 */
#define REG_PEVC_EVS13            REG_ACCESS(RwReg  , 0x400A6234U) /**< \brief (PEVC) Event Shaper 0 13 */
#define REG_PEVC_EVS14            REG_ACCESS(RwReg  , 0x400A6238U) /**< \brief (PEVC) Event Shaper 0 14 */
#define REG_PEVC_EVS15            REG_ACCESS(RwReg  , 0x400A623CU) /**< \brief (PEVC) Event Shaper 0 15 */
#define REG_PEVC_EVS16            REG_ACCESS(RwReg  , 0x400A6240U) /**< \brief (PEVC) Event Shaper 0 16 */
#define REG_PEVC_EVS17            REG_ACCESS(RwReg  , 0x400A6244U) /**< \brief (PEVC) Event Shaper 0 17 */
#define REG_PEVC_EVS18            REG_ACCESS(RwReg  , 0x400A6248U) /**< \brief (PEVC) Event Shaper 0 18 */
#define REG_PEVC_EVS19            REG_ACCESS(RwReg  , 0x400A624CU) /**< \brief (PEVC) Event Shaper 0 19 */
#define REG_PEVC_EVS20            REG_ACCESS(RwReg  , 0x400A6250U) /**< \brief (PEVC) Event Shaper 0 20 */
#define REG_PEVC_EVS21            REG_ACCESS(RwReg  , 0x400A6254U) /**< \brief (PEVC) Event Shaper 0 21 */
#define REG_PEVC_EVS22            REG_ACCESS(RwReg  , 0x400A6258U) /**< \brief (PEVC) Event Shaper 0 22 */
#define REG_PEVC_EVS23            REG_ACCESS(RwReg  , 0x400A625CU) /**< \brief (PEVC) Event Shaper 0 23 */
#define REG_PEVC_EVS24            REG_ACCESS(RwReg  , 0x400A6260U) /**< \brief (PEVC) Event Shaper 0 24 */
#define REG_PEVC_EVS25            REG_ACCESS(RwReg  , 0x400A6264U) /**< \brief (PEVC) Event Shaper 0 25 */
#define REG_PEVC_EVS26            REG_ACCESS(RwReg  , 0x400A6268U) /**< \brief (PEVC) Event Shaper 0 26 */
#define REG_PEVC_EVS27            REG_ACCESS(RwReg  , 0x400A626CU) /**< \brief (PEVC) Event Shaper 0 27 */
#define REG_PEVC_EVS28            REG_ACCESS(RwReg  , 0x400A6270U) /**< \brief (PEVC) Event Shaper 0 28 */
#define REG_PEVC_EVS29            REG_ACCESS(RwReg  , 0x400A6274U) /**< \brief (PEVC) Event Shaper 0 29 */
#define REG_PEVC_EVS30            REG_ACCESS(RwReg  , 0x400A6278U) /**< \brief (PEVC) Event Shaper 0 30 */
#define REG_PEVC_IGFDR            REG_ACCESS(RwReg  , 0x400A6300U) /**< \brief (PEVC) Input Glitch Filter Divider Register */ 
#define REG_PEVC_PARAMETER        REG_ACCESS(RoReg  , 0x400A63F8U) /**< \brief (PEVC) Parameter */ 
#define REG_PEVC_VERSION          REG_ACCESS(RoReg  , 0x400A63FCU) /**< \brief (PEVC) Version */ 
/* ========== Register definition for AESA peripheral ========== */
#define REG_AESA_CTRL             REG_ACCESS(RwReg  , 0x400B0000U) /**< \brief (AESA) Control Register */ 
#define REG_AESA_MODE             REG_ACCESS(RwReg  , 0x400B0004U) /**< \brief (AESA) Mode Register */ 
#define REG_AESA_DATABUFPTR       REG_ACCESS(RwReg  , 0x400B0008U) /**< \brief (AESA) Data Buffer Pointer Register */ 
#define REG_AESA_SR               REG_ACCESS(RoReg  , 0x400B000CU) /**< \brief (AESA) Status Register */ 
#define REG_AESA_IER              REG_ACCESS(WoReg  , 0x400B0010U) /**< \brief (AESA) Interrupt Enable Register */ 
#define REG_AESA_IDR              REG_ACCESS(WoReg  , 0x400B0014U) /**< \brief (AESA) Interrupt Disable Register */ 
#define REG_AESA_IMR              REG_ACCESS(RoReg  , 0x400B0018U) /**< \brief (AESA) Interrupt Mask Register */ 
#define REG_AESA_KEY0             REG_ACCESS(WoReg  , 0x400B0020U) /**< \brief (AESA) Key Register 0 0 */
#define REG_AESA_KEY1             REG_ACCESS(WoReg  , 0x400B0024U) /**< \brief (AESA) Key Register 0 1 */
#define REG_AESA_KEY2             REG_ACCESS(WoReg  , 0x400B0028U) /**< \brief (AESA) Key Register 0 2 */
#define REG_AESA_KEY3             REG_ACCESS(WoReg  , 0x400B002CU) /**< \brief (AESA) Key Register 0 3 */
#define REG_AESA_KEY4             REG_ACCESS(WoReg  , 0x400B0030U) /**< \brief (AESA) Key Register 0 4 */
#define REG_AESA_KEY5             REG_ACCESS(WoReg  , 0x400B0034U) /**< \brief (AESA) Key Register 0 5 */
#define REG_AESA_KEY6             REG_ACCESS(WoReg  , 0x400B0038U) /**< \brief (AESA) Key Register 0 6 */
#define REG_AESA_KEY7             REG_ACCESS(WoReg  , 0x400B003CU) /**< \brief (AESA) Key Register 0 7 */
#define REG_AESA_INITVECT0        REG_ACCESS(WoReg  , 0x400B0040U) /**< \brief (AESA) Initialization Vector Register 0 0 */
#define REG_AESA_INITVECT1        REG_ACCESS(WoReg  , 0x400B0044U) /**< \brief (AESA) Initialization Vector Register 0 1 */
#define REG_AESA_INITVECT2        REG_ACCESS(WoReg  , 0x400B0048U) /**< \brief (AESA) Initialization Vector Register 0 2 */
#define REG_AESA_INITVECT3        REG_ACCESS(WoReg  , 0x400B004CU) /**< \brief (AESA) Initialization Vector Register 0 3 */
#define REG_AESA_IDATA            REG_ACCESS(WoReg  , 0x400B0050U) /**< \brief (AESA) Input Data Register */ 
#define REG_AESA_ODATA            REG_ACCESS(RoReg  , 0x400B0060U) /**< \brief (AESA) Output Data Register */ 
#define REG_AESA_DRNGSEED         REG_ACCESS(WoReg  , 0x400B0070U) /**< \brief (AESA) DRNG Seed Register */ 
#define REG_AESA_PARAMETER        REG_ACCESS(RoReg  , 0x400B00F8U) /**< \brief (AESA) Parameter Register */ 
#define REG_AESA_VERSION          REG_ACCESS(RoReg  , 0x400B00FCU) /**< \brief (AESA) Version Register */ 
/* ========== Register definition for PM peripheral ========== */
#define REG_PM_MCCTRL             REG_ACCESS(RwReg  , 0x400E0000U) /**< \brief (PM) Main Clock Control */ 
