Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_PM_CPUSEL             REG_ACCESS(RwReg  , 0x400E0004U) /**< \brief (PM) CPU Clock Select */ 
#define REG_PM_PBASEL             REG_ACCESS(RwReg  , 0x400E000CU) /**< \brief (PM) PBA Clock Select */ 
#define REG_PM_PBBSEL             REG_ACCESS(RwReg  , 0x400E0010U) /**< \brief (PM) PBB Clock Select */ 
#define REG_PM_PBCSEL             REG_ACCESS(RwReg  , 0x400E0014U) /**< \brief (PM) PBC Clock Select */ 
#define REG_PM_PBDSEL             REG_ACCESS(RwReg  , 0x400E0018U) /**< \brief (PM) PBD Clock Select */ 
#define REG_PM_CPUMASK            REG_ACCESS(RwReg  , 0x400E0020U) /**< \brief (PM) CPU Mask */ 
#define REG_PM_HSBMASK            REG_ACCESS(RwReg  , 0x400E0024U) /**< \brief (PM) HSB Mask */ 
#define REG_PM_PBAMASK            REG_ACCESS(RwReg  , 0x400E0028U) /**< \brief (PM) PBA Mask */ 
#define REG_PM_PBBMASK            REG_ACCESS(RwReg  , 0x400E002CU) /**< \brief (PM) PBB Mask */ 
#define REG_PM_PBCMASK            REG_ACCESS(RwReg  , 0x400E0030U) /**< \brief (PM) PBC Mask */ 
#define REG_PM_PBDMASK            REG_ACCESS(RwReg  , 0x400E0034U) /**< \brief (PM) PBD Mask */ 
#define REG_PM_PBADIVMASK         REG_ACCESS(RwReg  , 0x400E0040U) /**< \brief (PM) PBA Divided Clock Mask */ 
#define REG_PM_CFDCTRL            REG_ACCESS(RwReg  , 0x400E0054U) /**< \brief (PM) Clock Failure Detector Control */ 
#define REG_PM_UNLOCK             REG_ACCESS(WoReg  , 0x400E0058U) /**< \brief (PM) Unlock Register */ 
#define REG_PM_IER                REG_ACCESS(WoReg  , 0x400E00C0U) /**< \brief (PM) Interrupt Enable Register */ 
#define REG_PM_IDR                REG_ACCESS(WoReg  , 0x400E00C4U) /**< \brief (PM) Interrupt Disable Register */ 
#define REG_PM_IMR                REG_ACCESS(RoReg  , 0x400E00C8U) /**< \brief (PM) Interrupt Mask Register */ 
#define REG_PM_ISR                REG_ACCESS(RoReg  , 0x400E00CCU) /**< \brief (PM) Interrupt Status Register */ 
#define REG_PM_ICR                REG_ACCESS(WoReg  , 0x400E00D0U) /**< \brief (PM) Interrupt Clear Register */ 
#define REG_PM_SR                 REG_ACCESS(RoReg  , 0x400E00D4U) /**< \brief (PM) Status Register */ 
#define REG_PM_PPCR               REG_ACCESS(RwReg  , 0x400E0160U) /**< \brief (PM) Peripheral Power Control Register */ 
#define REG_PM_RCAUSE             REG_ACCESS(RoReg  , 0x400E0180U) /**< \brief (PM) Reset Cause Register */ 
#define REG_PM_WCAUSE             REG_ACCESS(RoReg  , 0x400E0184U) /**< \brief (PM) Wake Cause Register */ 
#define REG_PM_AWEN               REG_ACCESS(RwReg  , 0x400E0188U) /**< \brief (PM) Asynchronous Wake Enable */ 
#define REG_PM_OBS                REG_ACCESS(RwReg  , 0x400E0190U) /**< \brief (PM) Obsvervability */ 
#define REG_PM_FASTSLEEP          REG_ACCESS(RwReg  , 0x400E0194U) /**< \brief (PM) Fast Sleep Register */ 
#define REG_PM_CONFIG             REG_ACCESS(RoReg  , 0x400E03F8U) /**< \brief (PM) Configuration Register */ 
#define REG_PM_VERSION            REG_ACCESS(RoReg  , 0x400E03FCU) /**< \brief (PM) Version Register */ 
/* ========== Register definition for CHIPID peripheral ========== */
#define REG_CHIPID_CIDR           REG_ACCESS(RoReg  , 0x400E0740U) /**< \brief (CHIPID) Chip ID Register */ 
#define REG_CHIPID_EXID           REG_ACCESS(RoReg  , 0x400E0744U) /**< \brief (CHIPID) Chip ID Extension Register */ 
/* ========== Register definition for SCIF peripheral ========== */
#define REG_SCIF_IER              REG_ACCESS(WoReg  , 0x400E0800U) /**< \brief (SCIF) Interrupt Enable Register */ 
#define REG_SCIF_IDR              REG_ACCESS(WoReg  , 0x400E0804U) /**< \brief (SCIF) Interrupt Disable Register */ 
#define REG_SCIF_IMR              REG_ACCESS(RoReg  , 0x400E0808U) /**< \brief (SCIF) Interrupt Mask Register */ 
#define REG_SCIF_ISR              REG_ACCESS(RoReg  , 0x400E080CU) /**< \brief (SCIF) Interrupt Status Register */ 
#define REG_SCIF_ICR              REG_ACCESS(WoReg  , 0x400E0810U) /**< \brief (SCIF) Interrupt Clear Register */ 
#define REG_SCIF_PCLKSR           REG_ACCESS(RoReg  , 0x400E0814U) /**< \brief (SCIF) Power and Clocks Status Register */ 
#define REG_SCIF_UNLOCK           REG_ACCESS(WoReg  , 0x400E0818U) /**< \brief (SCIF) Unlock Register */ 
#define REG_SCIF_CSCR             REG_ACCESS(RwReg  , 0x400E081CU) /**< \brief (SCIF) Chip Specific Configuration Register */ 
#define REG_SCIF_OSCCTRL0         REG_ACCESS(RwReg  , 0x400E0820U) /**< \brief (SCIF) Oscillator Control Register */ 
#define REG_SCIF_PLL0             REG_ACCESS(RwReg  , 0x400E0824U) /**< \brief (SCIF) PLL0 Control Register 0 */
#define REG_SCIF_DFLL0CONF        REG_ACCESS(RwReg  , 0x400E0828U) /**< \brief (SCIF) DFLL0 Config Register */ 
#define REG_SCIF_DFLL0VAL         REG_ACCESS(RwReg  , 0x400E082CU) /**< \brief (SCIF) DFLL Value Register */ 
#define REG_SCIF_DFLL0MUL         REG_ACCESS(RwReg  , 0x400E0830U) /**< \brief (SCIF) DFLL0 Multiplier Register */ 
#define REG_SCIF_DFLL0STEP        REG_ACCESS(RwReg  , 0x400E0834U) /**< \brief (SCIF) DFLL0 Step Register */ 
#define REG_SCIF_DFLL0SSG         REG_ACCESS(RwReg  , 0x400E0838U) /**< \brief (SCIF) DFLL0 Spread Spectrum Generator Control Register */ 
#define REG_SCIF_DFLL0RATIO       REG_ACCESS(RoReg  , 0x400E083CU) /**< \brief (SCIF) DFLL0 Ratio Registe */ 
#define REG_SCIF_DFLL0SYNC        REG_ACCESS(WoReg  , 0x400E0840U) /**< \brief (SCIF) DFLL0 Synchronization Register */ 
#define REG_SCIF_RCCR             REG_ACCESS(RwReg  , 0x400E0844U) /**< \brief (SCIF) System RC Oscillator Calibration Register */ 
#define REG_SCIF_RCFASTCFG        REG_ACCESS(RwReg  , 0x400E0848U) /**< \brief (SCIF) 4/8/12 MHz RC Oscillator Configuration
Register */ 
#define REG_SCIF_RCFASTSR         REG_ACCESS(RwReg  , 0x400E084CU) /**< \brief (SCIF) 4/8/12 MHz RC Oscillator Status Register */ 
#define REG_SCIF_RC80MCR          REG_ACCESS(RwReg  , 0x400E0850U) /**< \brief (SCIF) 80 MHz RC Oscillator Register */ 
#define REG_SCIF_HRPCR            REG_ACCESS(RwReg  , 0x400E0864U) /**< \brief (SCIF) High Resolution Prescaler Control Register */ 
#define REG_SCIF_FPCR             REG_ACCESS(RwReg  , 0x400E0868U) /**< \brief (SCIF) Fractional Prescaler Control Register */ 
#define REG_SCIF_FPMUL            REG_ACCESS(RwReg  , 0x400E086CU) /**< \brief (SCIF) Fractional Prescaler Multiplier Register */ 
#define REG_SCIF_FPDIV            REG_ACCESS(RwReg  , 0x400E0870U) /**< \brief (SCIF) Fractional Prescaler DIVIDER Register */ 
#define REG_SCIF_GCCTRL0          REG_ACCESS(RwReg  , 0x400E0874U) /**< \brief (SCIF) Generic Clock Control 0 */
#define REG_SCIF_GCCTRL1          REG_ACCESS(RwReg  , 0x400E0878U) /**< \brief (SCIF) Generic Clock Control 1 */
#define REG_SCIF_GCCTRL2          REG_ACCESS(RwReg  , 0x400E087CU) /**< \brief (SCIF) Generic Clock Control 2 */
#define REG_SCIF_GCCTRL3          REG_ACCESS(RwReg  , 0x400E0880U) /**< \brief (SCIF) Generic Clock Control 3 */
#define REG_SCIF_GCCTRL4          REG_ACCESS(RwReg  , 0x400E0884U) /**< \brief (SCIF) Generic Clock Control 4 */
#define REG_SCIF_GCCTRL5          REG_ACCESS(RwReg  , 0x400E0888U) /**< \brief (SCIF) Generic Clock Control 5 */
#define REG_SCIF_GCCTRL6          REG_ACCESS(RwReg  , 0x400E088CU) /**< \brief (SCIF) Generic Clock Control 6 */
#define REG_SCIF_GCCTRL7          REG_ACCESS(RwReg  , 0x400E0890U) /**< \brief (SCIF) Generic Clock Control 7 */
#define REG_SCIF_GCCTRL8          REG_ACCESS(RwReg  , 0x400E0894U) /**< \brief (SCIF) Generic Clock Control 8 */
#define REG_SCIF_GCCTRL9          REG_ACCESS(RwReg  , 0x400E0898U) /**< \brief (SCIF) Generic Clock Control 9 */
#define REG_SCIF_GCCTRL10         REG_ACCESS(RwReg  , 0x400E089CU) /**< \brief (SCIF) Generic Clock Control 10 */
#define REG_SCIF_GCCTRL11         REG_ACCESS(RwReg  , 0x400E08A0U) /**< \brief (SCIF) Generic Clock Control 11 */
#define REG_SCIF_RCFASTVERSION    REG_ACCESS(RoReg  , 0x400E0BD8U) /**< \brief (SCIF) 4/8/12 MHz RC Oscillator Version Register */ 
#define REG_SCIF_GCLKPRESCVERSION REG_ACCESS(RoReg  , 0x400E0BDCU) /**< \brief (SCIF) Generic Clock Prescaler Version Register */ 
#define REG_SCIF_PLLIFAVERSION    REG_ACCESS(RoReg  , 0x400E0BE0U) /**< \brief (SCIF) PLL Version Register */ 
#define REG_SCIF_OSCIFAVERSION    REG_ACCESS(RoReg  , 0x400E0BE4U) /**< \brief (SCIF) Oscillator 0 Version Register */ 
#define REG_SCIF_DFLLIFBVERSION   REG_ACCESS(RoReg  , 0x400E0BE8U) /**< \brief (SCIF) DFLL Version Register */ 
#define REG_SCIF_RCOSCIFAVERSION  REG_ACCESS(RoReg  , 0x400E0BECU) /**< \brief (SCIF) System RC Oscillator Version Register */ 
#define REG_SCIF_FLOVERSION       REG_ACCESS(RoReg  , 0x400E0BF0U) /**< \brief (SCIF) Frequency Locked Oscillator Version Register */ 
#define REG_SCIF_RC80MVERSION     REG_ACCESS(RoReg  , 0x400E0BF4U) /**< \brief (SCIF) 80MHz RC Oscillator Version Register */ 
#define REG_SCIF_GCLKIFVERSION    REG_ACCESS(RoReg  , 0x400E0BF8U) /**< \brief (SCIF) Generic Clock Version Register */ 
#define REG_SCIF_VERSION          REG_ACCESS(RoReg  , 0x400E0BFCU) /**< \brief (SCIF) SCIF Version Register */ 
/* ========== Register definition for FREQM peripheral ========== */
#define REG_FREQM_CTRL            REG_ACCESS(WoReg  , 0x400E0C00U) /**< \brief (FREQM) Control register */ 
#define REG_FREQM_MODE            REG_ACCESS(RwReg  , 0x400E0C04U) /**< \brief (FREQM) Mode  register */ 
#define REG_FREQM_STATUS          REG_ACCESS(RoReg  , 0x400E0C08U) /**< \brief (FREQM) Status  register */ 
#define REG_FREQM_VALUE           REG_ACCESS(RoReg  , 0x400E0C0CU) /**< \brief (FREQM) Value register */ 
#define REG_FREQM_IER             REG_ACCESS(WoReg  , 0x400E0C10U) /**< \brief (FREQM) Interrupt Enable Register */ 
#define REG_FREQM_IDR             REG_ACCESS(WoReg  , 0x400E0C14U) /**< \brief (FREQM) Interrupt Diable Register */ 
#define REG_FREQM_IMR             REG_ACCESS(RoReg  , 0x400E0C18U) /**< \brief (FREQM) Interrupt Mask Register */ 
#define REG_FREQM_ISR             REG_ACCESS(RoReg  , 0x400E0C1CU) /**< \brief (FREQM) Interrupt Status Register */ 
#define REG_FREQM_ICR             REG_ACCESS(WoReg  , 0x400E0C20U) /**< \brief (FREQM) Interrupt Clear Register */ 
#define REG_FREQM_VERSION         REG_ACCESS(RoReg  , 0x400E0FFCU) /**< \brief (FREQM) Version Register */ 
/* ========== Register definition for GPIO peripheral ========== */
#define REG_GPIO_GPER0            REG_ACCESS(RwReg  , 0x400E1000U) /**< \brief (GPIO) GPIO Enable Register 0 */
#define REG_GPIO_GPERS0           REG_ACCESS(WoReg  , 0x400E1004U) /**< \brief (GPIO) GPIO Enable Register - Set 0 */
#define REG_GPIO_GPERC0           REG_ACCESS(WoReg  , 0x400E1008U) /**< \brief (GPIO) GPIO Enable Register - Clear 0 */
#define REG_GPIO_GPERT0           REG_ACCESS(WoReg  , 0x400E100CU) /**< \brief (GPIO) GPIO Enable Register - Toggle 0 */
#define REG_GPIO_PMR00            REG_ACCESS(RwReg  , 0x400E1010U) /**< \brief (GPIO) Peripheral Mux Register 0 0 */
#define REG_GPIO_PMR0S0           REG_ACCESS(WoReg  , 0x400E1014U) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 0 */
#define REG_GPIO_PMR0C0           REG_ACCESS(WoReg  , 0x400E1018U) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 0 */
#define REG_GPIO_PMR0T0           REG_ACCESS(WoReg  , 0x400E101CU) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 0 */
#define REG_GPIO_PMR10            REG_ACCESS(RwReg  , 0x400E1020U) /**< \brief (GPIO) Peripheral Mux Register 1 0 */
#define REG_GPIO_PMR1S0           REG_ACCESS(WoReg  , 0x400E1024U) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 0 */
#define REG_GPIO_PMR1C0           REG_ACCESS(WoReg  , 0x400E1028U) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 0 */
#define REG_GPIO_PMR1T0           REG_ACCESS(WoReg  , 0x400E102CU) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 0 */
#define REG_GPIO_PMR20            REG_ACCESS(RwReg  , 0x400E1030U) /**< \brief (GPIO) Peripheral Mux Register 2 0 */
#define REG_GPIO_PMR2S0           REG_ACCESS(WoReg  , 0x400E1034U) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 0 */
#define REG_GPIO_PMR2C0           REG_ACCESS(WoReg  , 0x400E1038U) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 0 */
#define REG_GPIO_PMR2T0           REG_ACCESS(WoReg  , 0x400E103CU) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 0 */
#define REG_GPIO_ODER0            REG_ACCESS(RwReg  , 0x400E1040U) /**< \brief (GPIO) Output Driver Enable Register 0 */
#define REG_GPIO_ODERS0           REG_ACCESS(WoReg  , 0x400E1044U) /**< \brief (GPIO) Output Driver Enable Register - Set 0 */
#define REG_GPIO_ODERC0           REG_ACCESS(WoReg  , 0x400E1048U) /**< \brief (GPIO) Output Driver Enable Register - Clear 0 */
#define REG_GPIO_ODERT0           REG_ACCESS(WoReg  , 0x400E104CU) /**< \brief (GPIO) Output Driver Enable Register - Toggle 0 */
#define REG_GPIO_OVR0             REG_ACCESS(RwReg  , 0x400E1050U) /**< \brief (GPIO) Output Value Register 0 */
#define REG_GPIO_OVRS0            REG_ACCESS(WoReg  , 0x400E1054U) /**< \brief (GPIO) Output Value Register - Set 0 */
#define REG_GPIO_OVRC0            REG_ACCESS(WoReg  , 0x400E1058U) /**< \brief (GPIO) Output Value Register - Clear 0 */
#define REG_GPIO_OVRT0            REG_ACCESS(WoReg  , 0x400E105CU) /**< \brief (GPIO) Output Value Register - Toggle 0 */
#define REG_GPIO_PVR0             REG_ACCESS(RoReg  , 0x400E1060U) /**< \brief (GPIO) Pin Value Register 0 */
#define REG_GPIO_PUER0            REG_ACCESS(RwReg  , 0x400E1070U) /**< \brief (GPIO) Pull-up Enable Register 0 */
#define REG_GPIO_PUERS0           REG_ACCESS(WoReg  , 0x400E1074U) /**< \brief (GPIO) Pull-up Enable Register - Set 0 */
#define REG_GPIO_PUERC0           REG_ACCESS(WoReg  , 0x400E1078U) /**< \brief (GPIO) Pull-up Enable Register - Clear 0 */
#define REG_GPIO_PUERT0           REG_ACCESS(WoReg  , 0x400E107CU) /**< \brief (GPIO) Pull-up Enable Register - Toggle 0 */
#define REG_GPIO_PDER0            REG_ACCESS(RwReg  , 0x400E1080U) /**< \brief (GPIO) Pull-down Enable Register 0 */
#define REG_GPIO_PDERS0           REG_ACCESS(WoReg  , 0x400E1084U) /**< \brief (GPIO) Pull-down Enable Register - Set 0 */
#define REG_GPIO_PDERC0           REG_ACCESS(WoReg  , 0x400E1088U) /**< \brief (GPIO) Pull-down Enable Register - Clear 0 */
#define REG_GPIO_PDERT0           REG_ACCESS(WoReg  , 0x400E108CU) /**< \brief (GPIO) Pull-down Enable Register - Toggle 0 */
#define REG_GPIO_IER0             REG_ACCESS(RwReg  , 0x400E1090U) /**< \brief (GPIO) Interrupt Enable Register 0 */
#define REG_GPIO_IERS0            REG_ACCESS(WoReg  , 0x400E1094U) /**< \brief (GPIO) Interrupt Enable Register - Set 0 */
#define REG_GPIO_IERC0            REG_ACCESS(WoReg  , 0x400E1098U) /**< \brief (GPIO) Interrupt Enable Register - Clear 0 */
#define REG_GPIO_IERT0            REG_ACCESS(WoReg  , 0x400E109CU) /**< \brief (GPIO) Interrupt Enable Register - Toggle 0 */
#define REG_GPIO_IMR00            REG_ACCESS(RwReg  , 0x400E10A0U) /**< \brief (GPIO) Interrupt Mode Register 0 0 */
#define REG_GPIO_IMR0S0           REG_ACCESS(WoReg  , 0x400E10A4U) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 0 */
#define REG_GPIO_IMR0C0           REG_ACCESS(WoReg  , 0x400E10A8U) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 0 */
#define REG_GPIO_IMR0T0           REG_ACCESS(WoReg  , 0x400E10ACU) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 0 */
#define REG_GPIO_IMR10            REG_ACCESS(RwReg  , 0x400E10B0U) /**< \brief (GPIO) Interrupt Mode Register 1 0 */
#define REG_GPIO_IMR1S0           REG_ACCESS(WoReg  , 0x400E10B4U) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 0 */
#define REG_GPIO_IMR1C0           REG_ACCESS(WoReg  , 0x400E10B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 0 */
#define REG_GPIO_IMR1T0           REG_ACCESS(WoReg  , 0x400E10BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 0 */
#define REG_GPIO_GFER0            REG_ACCESS(RwReg  , 0x400E10C0U) /**< \brief (GPIO) Glitch Filter Enable Register 0 */
#define REG_GPIO_GFERS0           REG_ACCESS(WoReg  , 0x400E10C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 0 */
#define REG_GPIO_GFERC0           REG_ACCESS(WoReg  , 0x400E10C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 0 */
#define REG_GPIO_GFERT0           REG_ACCESS(WoReg  , 0x400E10CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 0 */
#define REG_GPIO_IFR0             REG_ACCESS(RoReg  , 0x400E10D0U) /**< \brief (GPIO) Interrupt Flag Register 0 */
#define REG_GPIO_IFRC0            REG_ACCESS(WoReg  , 0x400E10D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 0 */
#define REG_GPIO_ODMER0           REG_ACCESS(RwReg  , 0x400E10E0U) /**< \brief (GPIO) Open Drain Mode Register 0 */
#define REG_GPIO_ODMERS0          REG_ACCESS(WoReg  , 0x400E10E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 0 */
#define REG_GPIO_ODMERC0          REG_ACCESS(WoReg  , 0x400E10E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 0 */
#define REG_GPIO_ODMERT0          REG_ACCESS(WoReg  , 0x400E10ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 0 */
#define REG_GPIO_ODCR00           REG_ACCESS(RwReg  , 0x400E1100U) /**< \brief (GPIO) Output Driving Capability Register 0 0 */
#define REG_GPIO_ODCR0S0          REG_ACCESS(RwReg  , 0x400E1104U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 0 */
#define REG_GPIO_ODCR0C0          REG_ACCESS(RwReg  , 0x400E1108U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 0 */
#define REG_GPIO_ODCR0T0          REG_ACCESS(RwReg  , 0x400E110CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 0 */
#define REG_GPIO_ODCR10           REG_ACCESS(RwReg  , 0x400E1110U) /**< \brief (GPIO) Output Driving Capability Register 1 0 */
#define REG_GPIO_ODCR1S0          REG_ACCESS(RwReg  , 0x400E1114U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 0 */
#define REG_GPIO_ODCR1C0          REG_ACCESS(RwReg  , 0x400E1118U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 0 */
#define REG_GPIO_ODCR1T0          REG_ACCESS(RwReg  , 0x400E111CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 0 */
#define REG_GPIO_OSRR00           REG_ACCESS(RwReg  , 0x400E1130U) /**< \brief (GPIO) Output Slew Rate Register 0 0 */
#define REG_GPIO_OSRR0S0          REG_ACCESS(RwReg  , 0x400E1134U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 0 */
#define REG_GPIO_OSRR0C0          REG_ACCESS(RwReg  , 0x400E1138U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 0 */
#define REG_GPIO_OSRR0T0          REG_ACCESS(RwReg  , 0x400E113CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 0 */
#define REG_GPIO_STER0            REG_ACCESS(RwReg  , 0x400E1160U) /**< \brief (GPIO) Schmitt Trigger Enable Register 0 */
#define REG_GPIO_STERS0           REG_ACCESS(RwReg  , 0x400E1164U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 0 */
#define REG_GPIO_STERC0           REG_ACCESS(RwReg  , 0x400E1168U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 0 */
#define REG_GPIO_STERT0           REG_ACCESS(RwReg  , 0x400E116CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 0 */
#define REG_GPIO_EVER0            REG_ACCESS(RwReg  , 0x400E1180U) /**< \brief (GPIO) Event Enable Register 0 */
#define REG_GPIO_EVERS0           REG_ACCESS(WoReg  , 0x400E1184U) /**< \brief (GPIO) Event Enable Register - Set 0 */
#define REG_GPIO_EVERC0           REG_ACCESS(WoReg  , 0x400E1188U) /**< \brief (GPIO) Event Enable Register - Clear 0 */
#define REG_GPIO_EVERT0           REG_ACCESS(WoReg  , 0x400E118CU) /**< \brief (GPIO) Event Enable Register - Toggle 0 */
#define REG_GPIO_LOCK0            REG_ACCESS(RwReg  , 0x400E11A0U) /**< \brief (GPIO) Lock Register 0 */
#define REG_GPIO_LOCKS0           REG_ACCESS(WoReg  , 0x400E11A4U) /**< \brief (GPIO) Lock Register - Set 0 */
#define REG_GPIO_LOCKC0           REG_ACCESS(WoReg  , 0x400E11A8U) /**< \brief (GPIO) Lock Register - Clear 0 */
#define REG_GPIO_LOCKT0           REG_ACCESS(WoReg  , 0x400E11ACU) /**< \brief (GPIO) Lock Register - Toggle 0 */
#define REG_GPIO_UNLOCK0          REG_ACCESS(WoReg  , 0x400E11E0U) /**< \brief (GPIO) Unlock Register 0 */
#define REG_GPIO_ASR0             REG_ACCESS(RwReg  , 0x400E11E4U) /**< \brief (GPIO) Access Status Register 0 */
#define REG_GPIO_PARAMETER0       REG_ACCESS(RoReg  , 0x400E11F8U) /**< \brief (GPIO) Parameter Register 0 */
#define REG_GPIO_VERSION0         REG_ACCESS(RoReg  , 0x400E11FCU) /**< \brief (GPIO) Version Register 0 */
#define REG_GPIO_GPER1            REG_ACCESS(RwReg  , 0x400E1200U) /**< \brief (GPIO) GPIO Enable Register 1 */
#define REG_GPIO_GPERS1           REG_ACCESS(WoReg  , 0x400E1204U) /**< \brief (GPIO) GPIO Enable Register - Set 1 */
#define REG_GPIO_GPERC1           REG_ACCESS(WoReg  , 0x400E1208U) /**< \brief (GPIO) GPIO Enable Register - Clear 1 */
#define REG_GPIO_GPERT1           REG_ACCESS(WoReg  , 0x400E120CU) /**< \brief (GPIO) GPIO Enable Register - Toggle 1 */
#define REG_GPIO_PMR01            REG_ACCESS(RwReg  , 0x400E1210U) /**< \brief (GPIO) Peripheral Mux Register 0 1 */
#define REG_GPIO_PMR0S1           REG_ACCESS(WoReg  , 0x400E1214U) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 1 */
#define REG_GPIO_PMR0C1           REG_ACCESS(WoReg  , 0x400E1218U) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 1 */
#define REG_GPIO_PMR0T1           REG_ACCESS(WoReg  , 0x400E121CU) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 1 */
#define REG_GPIO_PMR11            REG_ACCESS(RwReg  , 0x400E1220U) /**< \brief (GPIO) Peripheral Mux Register 1 1 */
#define REG_GPIO_PMR1S1           REG_ACCESS(WoReg  , 0x400E1224U) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 1 */
#define REG_GPIO_PMR1C1           REG_ACCESS(WoReg  , 0x400E1228U) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 1 */
#define REG_GPIO_PMR1T1           REG_ACCESS(WoReg  , 0x400E122CU) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 1 */
#define REG_GPIO_PMR21            REG_ACCESS(RwReg  , 0x400E1230U) /**< \brief (GPIO) Peripheral Mux Register 2 1 */
#define REG_GPIO_PMR2S1           REG_ACCESS(WoReg  , 0x400E1234U) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 1 */
#define REG_GPIO_PMR2C1           REG_ACCESS(WoReg  , 0x400E1238U) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 1 */
#define REG_GPIO_PMR2T1           REG_ACCESS(WoReg  , 0x400E123CU) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 1 */
#define REG_GPIO_ODER1            REG_ACCESS(RwReg  , 0x400E1240U) /**< \brief (GPIO) Output Driver Enable Register 1 */
#define REG_GPIO_ODERS1           REG_ACCESS(WoReg  , 0x400E1244U) /**< \brief (GPIO) Output Driver Enable Register - Set 1 */
#define REG_GPIO_ODERC1           REG_ACCESS(WoReg  , 0x400E1248U) /**< \brief (GPIO) Output Driver Enable Register - Clear 1 */
#define REG_GPIO_ODERT1           REG_ACCESS(WoReg  , 0x400E124CU) /**< \brief (GPIO) Output Driver Enable Register - Toggle 1 */
#define REG_GPIO_OVR1             REG_ACCESS(RwReg  , 0x400E1250U) /**< \brief (GPIO) Output Value Register 1 */
#define REG_GPIO_OVRS1            REG_ACCESS(WoReg  , 0x400E1254U) /**< \brief (GPIO) Output Value Register - Set 1 */
#define REG_GPIO_OVRC1            REG_ACCESS(WoReg  , 0x400E1258U) /**< \brief (GPIO) Output Value Register - Clear 1 */
#define REG_GPIO_OVRT1            REG_ACCESS(WoReg  , 0x400E125CU) /**< \brief (GPIO) Output Value Register - Toggle 1 */
#define REG_GPIO_PVR1             REG_ACCESS(RoReg  , 0x400E1260U) /**< \brief (GPIO) Pin Value Register 1 */
#define REG_GPIO_PUER1            REG_ACCESS(RwReg  , 0x400E1270U) /**< \brief (GPIO) Pull-up Enable Register 1 */
#define REG_GPIO_PUERS1           REG_ACCESS(WoReg  , 0x400E1274U) /**< \brief (GPIO) Pull-up Enable Register - Set 1 */
#define REG_GPIO_PUERC1           REG_ACCESS(WoReg  , 0x400E1278U) /**< \brief (GPIO) Pull-up Enable Register - Clear 1 */
