Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_GPIO_PUERT1           REG_ACCESS(WoReg  , 0x400E127CU) /**< \brief (GPIO) Pull-up Enable Register - Toggle 1 */
#define REG_GPIO_PDER1            REG_ACCESS(RwReg  , 0x400E1280U) /**< \brief (GPIO) Pull-down Enable Register 1 */
#define REG_GPIO_PDERS1           REG_ACCESS(WoReg  , 0x400E1284U) /**< \brief (GPIO) Pull-down Enable Register - Set 1 */
#define REG_GPIO_PDERC1           REG_ACCESS(WoReg  , 0x400E1288U) /**< \brief (GPIO) Pull-down Enable Register - Clear 1 */
#define REG_GPIO_PDERT1           REG_ACCESS(WoReg  , 0x400E128CU) /**< \brief (GPIO) Pull-down Enable Register - Toggle 1 */
#define REG_GPIO_IER1             REG_ACCESS(RwReg  , 0x400E1290U) /**< \brief (GPIO) Interrupt Enable Register 1 */
#define REG_GPIO_IERS1            REG_ACCESS(WoReg  , 0x400E1294U) /**< \brief (GPIO) Interrupt Enable Register - Set 1 */
#define REG_GPIO_IERC1            REG_ACCESS(WoReg  , 0x400E1298U) /**< \brief (GPIO) Interrupt Enable Register - Clear 1 */
#define REG_GPIO_IERT1            REG_ACCESS(WoReg  , 0x400E129CU) /**< \brief (GPIO) Interrupt Enable Register - Toggle 1 */
#define REG_GPIO_IMR01            REG_ACCESS(RwReg  , 0x400E12A0U) /**< \brief (GPIO) Interrupt Mode Register 0 1 */
#define REG_GPIO_IMR0S1           REG_ACCESS(WoReg  , 0x400E12A4U) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 1 */
#define REG_GPIO_IMR0C1           REG_ACCESS(WoReg  , 0x400E12A8U) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 1 */
#define REG_GPIO_IMR0T1           REG_ACCESS(WoReg  , 0x400E12ACU) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 1 */
#define REG_GPIO_IMR11            REG_ACCESS(RwReg  , 0x400E12B0U) /**< \brief (GPIO) Interrupt Mode Register 1 1 */
#define REG_GPIO_IMR1S1           REG_ACCESS(WoReg  , 0x400E12B4U) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 1 */
#define REG_GPIO_IMR1C1           REG_ACCESS(WoReg  , 0x400E12B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 1 */
#define REG_GPIO_IMR1T1           REG_ACCESS(WoReg  , 0x400E12BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 1 */
#define REG_GPIO_GFER1            REG_ACCESS(RwReg  , 0x400E12C0U) /**< \brief (GPIO) Glitch Filter Enable Register 1 */
#define REG_GPIO_GFERS1           REG_ACCESS(WoReg  , 0x400E12C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 1 */
#define REG_GPIO_GFERC1           REG_ACCESS(WoReg  , 0x400E12C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 1 */
#define REG_GPIO_GFERT1           REG_ACCESS(WoReg  , 0x400E12CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 1 */
#define REG_GPIO_IFR1             REG_ACCESS(RoReg  , 0x400E12D0U) /**< \brief (GPIO) Interrupt Flag Register 1 */
#define REG_GPIO_IFRC1            REG_ACCESS(WoReg  , 0x400E12D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 1 */
#define REG_GPIO_ODMER1           REG_ACCESS(RwReg  , 0x400E12E0U) /**< \brief (GPIO) Open Drain Mode Register 1 */
#define REG_GPIO_ODMERS1          REG_ACCESS(WoReg  , 0x400E12E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 1 */
#define REG_GPIO_ODMERC1          REG_ACCESS(WoReg  , 0x400E12E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 1 */
#define REG_GPIO_ODMERT1          REG_ACCESS(WoReg  , 0x400E12ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 1 */
#define REG_GPIO_ODCR01           REG_ACCESS(RwReg  , 0x400E1300U) /**< \brief (GPIO) Output Driving Capability Register 0 1 */
#define REG_GPIO_ODCR0S1          REG_ACCESS(RwReg  , 0x400E1304U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 1 */
#define REG_GPIO_ODCR0C1          REG_ACCESS(RwReg  , 0x400E1308U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 1 */
#define REG_GPIO_ODCR0T1          REG_ACCESS(RwReg  , 0x400E130CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 1 */
#define REG_GPIO_ODCR11           REG_ACCESS(RwReg  , 0x400E1310U) /**< \brief (GPIO) Output Driving Capability Register 1 1 */
#define REG_GPIO_ODCR1S1          REG_ACCESS(RwReg  , 0x400E1314U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 1 */
#define REG_GPIO_ODCR1C1          REG_ACCESS(RwReg  , 0x400E1318U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 1 */
#define REG_GPIO_ODCR1T1          REG_ACCESS(RwReg  , 0x400E131CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 1 */
#define REG_GPIO_OSRR01           REG_ACCESS(RwReg  , 0x400E1330U) /**< \brief (GPIO) Output Slew Rate Register 0 1 */
#define REG_GPIO_OSRR0S1          REG_ACCESS(RwReg  , 0x400E1334U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 1 */
#define REG_GPIO_OSRR0C1          REG_ACCESS(RwReg  , 0x400E1338U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 1 */
#define REG_GPIO_OSRR0T1          REG_ACCESS(RwReg  , 0x400E133CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 1 */
#define REG_GPIO_STER1            REG_ACCESS(RwReg  , 0x400E1360U) /**< \brief (GPIO) Schmitt Trigger Enable Register 1 */
#define REG_GPIO_STERS1           REG_ACCESS(RwReg  , 0x400E1364U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 1 */
#define REG_GPIO_STERC1           REG_ACCESS(RwReg  , 0x400E1368U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 1 */
#define REG_GPIO_STERT1           REG_ACCESS(RwReg  , 0x400E136CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 1 */
#define REG_GPIO_EVER1            REG_ACCESS(RwReg  , 0x400E1380U) /**< \brief (GPIO) Event Enable Register 1 */
#define REG_GPIO_EVERS1           REG_ACCESS(WoReg  , 0x400E1384U) /**< \brief (GPIO) Event Enable Register - Set 1 */
#define REG_GPIO_EVERC1           REG_ACCESS(WoReg  , 0x400E1388U) /**< \brief (GPIO) Event Enable Register - Clear 1 */
#define REG_GPIO_EVERT1           REG_ACCESS(WoReg  , 0x400E138CU) /**< \brief (GPIO) Event Enable Register - Toggle 1 */
#define REG_GPIO_LOCK1            REG_ACCESS(RwReg  , 0x400E13A0U) /**< \brief (GPIO) Lock Register 1 */
#define REG_GPIO_LOCKS1           REG_ACCESS(WoReg  , 0x400E13A4U) /**< \brief (GPIO) Lock Register - Set 1 */
#define REG_GPIO_LOCKC1           REG_ACCESS(WoReg  , 0x400E13A8U) /**< \brief (GPIO) Lock Register - Clear 1 */
#define REG_GPIO_LOCKT1           REG_ACCESS(WoReg  , 0x400E13ACU) /**< \brief (GPIO) Lock Register - Toggle 1 */
#define REG_GPIO_UNLOCK1          REG_ACCESS(WoReg  , 0x400E13E0U) /**< \brief (GPIO) Unlock Register 1 */
#define REG_GPIO_ASR1             REG_ACCESS(RwReg  , 0x400E13E4U) /**< \brief (GPIO) Access Status Register 1 */
#define REG_GPIO_PARAMETER1       REG_ACCESS(RoReg  , 0x400E13F8U) /**< \brief (GPIO) Parameter Register 1 */
#define REG_GPIO_VERSION1         REG_ACCESS(RoReg  , 0x400E13FCU) /**< \brief (GPIO) Version Register 1 */
#define REG_GPIO_GPER2            REG_ACCESS(RwReg  , 0x400E1400U) /**< \brief (GPIO) GPIO Enable Register 2 */
#define REG_GPIO_GPERS2           REG_ACCESS(WoReg  , 0x400E1404U) /**< \brief (GPIO) GPIO Enable Register - Set 2 */
#define REG_GPIO_GPERC2           REG_ACCESS(WoReg  , 0x400E1408U) /**< \brief (GPIO) GPIO Enable Register - Clear 2 */
#define REG_GPIO_GPERT2           REG_ACCESS(WoReg  , 0x400E140CU) /**< \brief (GPIO) GPIO Enable Register - Toggle 2 */
#define REG_GPIO_PMR02            REG_ACCESS(RwReg  , 0x400E1410U) /**< \brief (GPIO) Peripheral Mux Register 0 2 */
#define REG_GPIO_PMR0S2           REG_ACCESS(WoReg  , 0x400E1414U) /**< \brief (GPIO) Peripheral Mux Register 0 - Set 2 */
#define REG_GPIO_PMR0C2           REG_ACCESS(WoReg  , 0x400E1418U) /**< \brief (GPIO) Peripheral Mux Register 0 - Clear 2 */
#define REG_GPIO_PMR0T2           REG_ACCESS(WoReg  , 0x400E141CU) /**< \brief (GPIO) Peripheral Mux Register 0 - Toggle 2 */
#define REG_GPIO_PMR12            REG_ACCESS(RwReg  , 0x400E1420U) /**< \brief (GPIO) Peripheral Mux Register 1 2 */
#define REG_GPIO_PMR1S2           REG_ACCESS(WoReg  , 0x400E1424U) /**< \brief (GPIO) Peripheral Mux Register 1 - Set 2 */
#define REG_GPIO_PMR1C2           REG_ACCESS(WoReg  , 0x400E1428U) /**< \brief (GPIO) Peripheral Mux Register 1 - Clear 2 */
#define REG_GPIO_PMR1T2           REG_ACCESS(WoReg  , 0x400E142CU) /**< \brief (GPIO) Peripheral Mux Register 1 - Toggle 2 */
#define REG_GPIO_PMR22            REG_ACCESS(RwReg  , 0x400E1430U) /**< \brief (GPIO) Peripheral Mux Register 2 2 */
#define REG_GPIO_PMR2S2           REG_ACCESS(WoReg  , 0x400E1434U) /**< \brief (GPIO) Peripheral Mux Register 2 - Set 2 */
#define REG_GPIO_PMR2C2           REG_ACCESS(WoReg  , 0x400E1438U) /**< \brief (GPIO) Peripheral Mux Register 2 - Clear 2 */
#define REG_GPIO_PMR2T2           REG_ACCESS(WoReg  , 0x400E143CU) /**< \brief (GPIO) Peripheral Mux Register 2 - Toggle 2 */
#define REG_GPIO_ODER2            REG_ACCESS(RwReg  , 0x400E1440U) /**< \brief (GPIO) Output Driver Enable Register 2 */
#define REG_GPIO_ODERS2           REG_ACCESS(WoReg  , 0x400E1444U) /**< \brief (GPIO) Output Driver Enable Register - Set 2 */
#define REG_GPIO_ODERC2           REG_ACCESS(WoReg  , 0x400E1448U) /**< \brief (GPIO) Output Driver Enable Register - Clear 2 */
#define REG_GPIO_ODERT2           REG_ACCESS(WoReg  , 0x400E144CU) /**< \brief (GPIO) Output Driver Enable Register - Toggle 2 */
#define REG_GPIO_OVR2             REG_ACCESS(RwReg  , 0x400E1450U) /**< \brief (GPIO) Output Value Register 2 */
#define REG_GPIO_OVRS2            REG_ACCESS(WoReg  , 0x400E1454U) /**< \brief (GPIO) Output Value Register - Set 2 */
#define REG_GPIO_OVRC2            REG_ACCESS(WoReg  , 0x400E1458U) /**< \brief (GPIO) Output Value Register - Clear 2 */
#define REG_GPIO_OVRT2            REG_ACCESS(WoReg  , 0x400E145CU) /**< \brief (GPIO) Output Value Register - Toggle 2 */
#define REG_GPIO_PVR2             REG_ACCESS(RoReg  , 0x400E1460U) /**< \brief (GPIO) Pin Value Register 2 */
#define REG_GPIO_PUER2            REG_ACCESS(RwReg  , 0x400E1470U) /**< \brief (GPIO) Pull-up Enable Register 2 */
#define REG_GPIO_PUERS2           REG_ACCESS(WoReg  , 0x400E1474U) /**< \brief (GPIO) Pull-up Enable Register - Set 2 */
#define REG_GPIO_PUERC2           REG_ACCESS(WoReg  , 0x400E1478U) /**< \brief (GPIO) Pull-up Enable Register - Clear 2 */
#define REG_GPIO_PUERT2           REG_ACCESS(WoReg  , 0x400E147CU) /**< \brief (GPIO) Pull-up Enable Register - Toggle 2 */
#define REG_GPIO_PDER2            REG_ACCESS(RwReg  , 0x400E1480U) /**< \brief (GPIO) Pull-down Enable Register 2 */
#define REG_GPIO_PDERS2           REG_ACCESS(WoReg  , 0x400E1484U) /**< \brief (GPIO) Pull-down Enable Register - Set 2 */
#define REG_GPIO_PDERC2           REG_ACCESS(WoReg  , 0x400E1488U) /**< \brief (GPIO) Pull-down Enable Register - Clear 2 */
#define REG_GPIO_PDERT2           REG_ACCESS(WoReg  , 0x400E148CU) /**< \brief (GPIO) Pull-down Enable Register - Toggle 2 */
#define REG_GPIO_IER2             REG_ACCESS(RwReg  , 0x400E1490U) /**< \brief (GPIO) Interrupt Enable Register 2 */
#define REG_GPIO_IERS2            REG_ACCESS(WoReg  , 0x400E1494U) /**< \brief (GPIO) Interrupt Enable Register - Set 2 */
#define REG_GPIO_IERC2            REG_ACCESS(WoReg  , 0x400E1498U) /**< \brief (GPIO) Interrupt Enable Register - Clear 2 */
#define REG_GPIO_IERT2            REG_ACCESS(WoReg  , 0x400E149CU) /**< \brief (GPIO) Interrupt Enable Register - Toggle 2 */
#define REG_GPIO_IMR02            REG_ACCESS(RwReg  , 0x400E14A0U) /**< \brief (GPIO) Interrupt Mode Register 0 2 */
#define REG_GPIO_IMR0S2           REG_ACCESS(WoReg  , 0x400E14A4U) /**< \brief (GPIO) Interrupt Mode Register 0 - Set 2 */
#define REG_GPIO_IMR0C2           REG_ACCESS(WoReg  , 0x400E14A8U) /**< \brief (GPIO) Interrupt Mode Register 0 - Clear 2 */
#define REG_GPIO_IMR0T2           REG_ACCESS(WoReg  , 0x400E14ACU) /**< \brief (GPIO) Interrupt Mode Register 0 - Toggle 2 */
#define REG_GPIO_IMR12            REG_ACCESS(RwReg  , 0x400E14B0U) /**< \brief (GPIO) Interrupt Mode Register 1 2 */
#define REG_GPIO_IMR1S2           REG_ACCESS(WoReg  , 0x400E14B4U) /**< \brief (GPIO) Interrupt Mode Register 1 - Set 2 */
#define REG_GPIO_IMR1C2           REG_ACCESS(WoReg  , 0x400E14B8U) /**< \brief (GPIO) Interrupt Mode Register 1 - Clear 2 */
#define REG_GPIO_IMR1T2           REG_ACCESS(WoReg  , 0x400E14BCU) /**< \brief (GPIO) Interrupt Mode Register 1 - Toggle 2 */
#define REG_GPIO_GFER2            REG_ACCESS(RwReg  , 0x400E14C0U) /**< \brief (GPIO) Glitch Filter Enable Register 2 */
#define REG_GPIO_GFERS2           REG_ACCESS(WoReg  , 0x400E14C4U) /**< \brief (GPIO) Glitch Filter Enable Register - Set 2 */
#define REG_GPIO_GFERC2           REG_ACCESS(WoReg  , 0x400E14C8U) /**< \brief (GPIO) Glitch Filter Enable Register - Clear 2 */
#define REG_GPIO_GFERT2           REG_ACCESS(WoReg  , 0x400E14CCU) /**< \brief (GPIO) Glitch Filter Enable Register - Toggle 2 */
#define REG_GPIO_IFR2             REG_ACCESS(RoReg  , 0x400E14D0U) /**< \brief (GPIO) Interrupt Flag Register 2 */
#define REG_GPIO_IFRC2            REG_ACCESS(WoReg  , 0x400E14D8U) /**< \brief (GPIO) Interrupt Flag Register - Clear 2 */
#define REG_GPIO_ODMER2           REG_ACCESS(RwReg  , 0x400E14E0U) /**< \brief (GPIO) Open Drain Mode Register 2 */
#define REG_GPIO_ODMERS2          REG_ACCESS(WoReg  , 0x400E14E4U) /**< \brief (GPIO) Open Drain Mode Register - Set 2 */
#define REG_GPIO_ODMERC2          REG_ACCESS(WoReg  , 0x400E14E8U) /**< \brief (GPIO) Open Drain Mode Register - Clear 2 */
#define REG_GPIO_ODMERT2          REG_ACCESS(WoReg  , 0x400E14ECU) /**< \brief (GPIO) Open Drain Mode Register - Toggle 2 */
#define REG_GPIO_ODCR02           REG_ACCESS(RwReg  , 0x400E1500U) /**< \brief (GPIO) Output Driving Capability Register 0 2 */
#define REG_GPIO_ODCR0S2          REG_ACCESS(RwReg  , 0x400E1504U) /**< \brief (GPIO) Output Driving Capability Register 0 - Set 2 */
#define REG_GPIO_ODCR0C2          REG_ACCESS(RwReg  , 0x400E1508U) /**< \brief (GPIO) Output Driving Capability Register 0 - Clear 2 */
#define REG_GPIO_ODCR0T2          REG_ACCESS(RwReg  , 0x400E150CU) /**< \brief (GPIO) Output Driving Capability Register 0 - Toggle 2 */
#define REG_GPIO_ODCR12           REG_ACCESS(RwReg  , 0x400E1510U) /**< \brief (GPIO) Output Driving Capability Register 1 2 */
#define REG_GPIO_ODCR1S2          REG_ACCESS(RwReg  , 0x400E1514U) /**< \brief (GPIO) Output Driving Capability Register 1 - Set 2 */
#define REG_GPIO_ODCR1C2          REG_ACCESS(RwReg  , 0x400E1518U) /**< \brief (GPIO) Output Driving Capability Register 1 - Clear 2 */
#define REG_GPIO_ODCR1T2          REG_ACCESS(RwReg  , 0x400E151CU) /**< \brief (GPIO) Output Driving Capability Register 1 - Toggle 2 */
#define REG_GPIO_OSRR02           REG_ACCESS(RwReg  , 0x400E1530U) /**< \brief (GPIO) Output Slew Rate Register 0 2 */
#define REG_GPIO_OSRR0S2          REG_ACCESS(RwReg  , 0x400E1534U) /**< \brief (GPIO) Output Slew Rate Register 0 - Set 2 */
#define REG_GPIO_OSRR0C2          REG_ACCESS(RwReg  , 0x400E1538U) /**< \brief (GPIO) Output Slew Rate Register 0 - Clear 2 */
#define REG_GPIO_OSRR0T2          REG_ACCESS(RwReg  , 0x400E153CU) /**< \brief (GPIO) Output Slew Rate Register 0 - Toggle 2 */
#define REG_GPIO_STER2            REG_ACCESS(RwReg  , 0x400E1560U) /**< \brief (GPIO) Schmitt Trigger Enable Register 2 */
#define REG_GPIO_STERS2           REG_ACCESS(RwReg  , 0x400E1564U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Set 2 */
#define REG_GPIO_STERC2           REG_ACCESS(RwReg  , 0x400E1568U) /**< \brief (GPIO) Schmitt Trigger Enable Register - Clear 2 */
#define REG_GPIO_STERT2           REG_ACCESS(RwReg  , 0x400E156CU) /**< \brief (GPIO) Schmitt Trigger Enable Register - Toggle 2 */
#define REG_GPIO_EVER2            REG_ACCESS(RwReg  , 0x400E1580U) /**< \brief (GPIO) Event Enable Register 2 */
#define REG_GPIO_EVERS2           REG_ACCESS(WoReg  , 0x400E1584U) /**< \brief (GPIO) Event Enable Register - Set 2 */
#define REG_GPIO_EVERC2           REG_ACCESS(WoReg  , 0x400E1588U) /**< \brief (GPIO) Event Enable Register - Clear 2 */
#define REG_GPIO_EVERT2           REG_ACCESS(WoReg  , 0x400E158CU) /**< \brief (GPIO) Event Enable Register - Toggle 2 */
#define REG_GPIO_LOCK2            REG_ACCESS(RwReg  , 0x400E15A0U) /**< \brief (GPIO) Lock Register 2 */
#define REG_GPIO_LOCKS2           REG_ACCESS(WoReg  , 0x400E15A4U) /**< \brief (GPIO) Lock Register - Set 2 */
#define REG_GPIO_LOCKC2           REG_ACCESS(WoReg  , 0x400E15A8U) /**< \brief (GPIO) Lock Register - Clear 2 */
#define REG_GPIO_LOCKT2           REG_ACCESS(WoReg  , 0x400E15ACU) /**< \brief (GPIO) Lock Register - Toggle 2 */
#define REG_GPIO_UNLOCK2          REG_ACCESS(WoReg  , 0x400E15E0U) /**< \brief (GPIO) Unlock Register 2 */
#define REG_GPIO_ASR2             REG_ACCESS(RwReg  , 0x400E15E4U) /**< \brief (GPIO) Access Status Register 2 */
#define REG_GPIO_PARAMETER2       REG_ACCESS(RoReg  , 0x400E15F8U) /**< \brief (GPIO) Parameter Register 2 */
#define REG_GPIO_VERSION2         REG_ACCESS(RoReg  , 0x400E15FCU) /**< \brief (GPIO) Version Register 2 */
/* ========== Register definition for BPM peripheral ========== */
#define REG_BPM_IER               REG_ACCESS(WoReg  , 0x400F0000U) /**< \brief (BPM) Interrupt Enable Register */ 
#define REG_BPM_IDR               REG_ACCESS(WoReg  , 0x400F0004U) /**< \brief (BPM) Interrupt Disable Register */ 
#define REG_BPM_IMR               REG_ACCESS(RoReg  , 0x400F0008U) /**< \brief (BPM) Interrupt Mask Register */ 
#define REG_BPM_ISR               REG_ACCESS(RoReg  , 0x400F000CU) /**< \brief (BPM) Interrupt Status Register */ 
#define REG_BPM_ICR               REG_ACCESS(WoReg  , 0x400F0010U) /**< \brief (BPM) Interrupt Clear Register */ 
#define REG_BPM_SR                REG_ACCESS(RoReg  , 0x400F0014U) /**< \brief (BPM) Status Register */ 
#define REG_BPM_UNLOCK            REG_ACCESS(WoReg  , 0x400F0018U) /**< \brief (BPM) Unlock Register */ 
#define REG_BPM_PMCON             REG_ACCESS(RwReg  , 0x400F001CU) /**< \brief (BPM) Power Mode Control Register */ 
#define REG_BPM_BKUPWCAUSE        REG_ACCESS(RoReg  , 0x400F0028U) /**< \brief (BPM) Backup Wake up Cause Register */ 
#define REG_BPM_BKUPWEN           REG_ACCESS(RwReg  , 0x400F002CU) /**< \brief (BPM) Backup Wake up Enable Register */ 
#define REG_BPM_BKUPPMUX          REG_ACCESS(RwReg  , 0x400F0030U) /**< \brief (BPM) Backup Pin Muxing Register */ 
#define REG_BPM_IORET             REG_ACCESS(RwReg  , 0x400F0034U) /**< \brief (BPM) Input Output Retention Register */ 
#define REG_BPM_BPR               REG_ACCESS(RwReg  , 0x400F0040U) /**< \brief (BPM) Bypass Register */ 
#define REG_BPM_FWRUNPS           REG_ACCESS(RoReg  , 0x400F0044U) /**< \brief (BPM) Factory Word Run PS Register */ 
#define REG_BPM_FWPSAVEPS         REG_ACCESS(RoReg  , 0x400F0048U) /**< \brief (BPM) Factory Word Power Save PS Register */ 
#define REG_BPM_VERSION           REG_ACCESS(RoReg  , 0x400F00FCU) /**< \brief (BPM) Version Register */ 
/* ========== Register definition for BSCIF peripheral ========== */
#define REG_BSCIF_IER             REG_ACCESS(WoReg  , 0x400F0400U) /**< \brief (BSCIF) Interrupt Enable Register */ 
#define REG_BSCIF_IDR             REG_ACCESS(WoReg  , 0x400F0404U) /**< \brief (BSCIF) Interrupt Disable Register */ 
#define REG_BSCIF_IMR             REG_ACCESS(RoReg  , 0x400F0408U) /**< \brief (BSCIF) Interrupt Mask Register */ 
#define REG_BSCIF_ISR             REG_ACCESS(RoReg  , 0x400F040CU) /**< \brief (BSCIF) Interrupt Status Register */ 
#define REG_BSCIF_ICR             REG_ACCESS(WoReg  , 0x400F0410U) /**< \brief (BSCIF) Interrupt Clear Register */ 
#define REG_BSCIF_PCLKSR          REG_ACCESS(RoReg  , 0x400F0414U) /**< \brief (BSCIF) Power and Clocks Status Register */ 
#define REG_BSCIF_UNLOCK          REG_ACCESS(WoReg  , 0x400F0418U) /**< \brief (BSCIF) Unlock Register */ 
#define REG_BSCIF_CSCR            REG_ACCESS(RwReg  , 0x400F041CU) /**< \brief (BSCIF) Chip Specific Configuration Register */ 
#define REG_BSCIF_OSCCTRL32       REG_ACCESS(RwReg  , 0x400F0420U) /**< \brief (BSCIF) Oscillator 32 Control Register */ 
#define REG_BSCIF_RC32KCR         REG_ACCESS(RwReg  , 0x400F0424U) /**< \brief (BSCIF) 32 kHz RC Oscillator Control Register */ 
#define REG_BSCIF_RC32KTUNE       REG_ACCESS(RwReg  , 0x400F0428U) /**< \brief (BSCIF) 32kHz RC Oscillator Tuning Register */ 
#define REG_BSCIF_BOD33CTRL       REG_ACCESS(RwReg  , 0x400F042CU) /**< \brief (BSCIF) BOD33 Control Register */ 
#define REG_BSCIF_BOD33LEVEL      REG_ACCESS(RwReg  , 0x400F0430U) /**< \brief (BSCIF) BOD33 Level Register */ 
#define REG_BSCIF_BOD33SAMPLING   REG_ACCESS(RwReg  , 0x400F0434U) /**< \brief (BSCIF) BOD33 Sampling Control Register */ 
#define REG_BSCIF_BOD18CTRL       REG_ACCESS(RwReg  , 0x400F0438U) /**< \brief (BSCIF) BOD18 Control Register */ 
#define REG_BSCIF_BOD18LEVEL      REG_ACCESS(RwReg  , 0x400F043CU) /**< \brief (BSCIF) BOD18 Level Register */ 
#define REG_BSCIF_VREGCR          REG_ACCESS(RwReg  , 0x400F0444U) /**< \brief (BSCIF) Voltage Regulator Configuration Register */ 
#define REG_BSCIF_VREGNCSR        REG_ACCESS(RwReg  , 0x400F044CU) /**< \brief (BSCIF) Normal Mode Control and Status Register */ 
#define REG_BSCIF_VREGLPCSR       REG_ACCESS(RwReg  , 0x400F0450U) /**< \brief (BSCIF) LP Mode Control and Status Register */ 
#define REG_BSCIF_RC1MCR          REG_ACCESS(RwReg  , 0x400F0458U) /**< \brief (BSCIF) 1MHz RC Clock Configuration Register */ 
#define REG_BSCIF_BGCR            REG_ACCESS(RwReg  , 0x400F045CU) /**< \brief (BSCIF) Bandgap Calibration Register */ 
#define REG_BSCIF_BGCTRL          REG_ACCESS(RwReg  , 0x400F0460U) /**< \brief (BSCIF) Bandgap Control Register */ 
#define REG_BSCIF_BGSR            REG_ACCESS(RoReg  , 0x400F0464U) /**< \brief (BSCIF) Bandgap Status Register */ 
#define REG_BSCIF_BR0             REG_ACCESS(RwReg  , 0x400F0478U) /**< \brief (BSCIF) Backup Register 0 */
#define REG_BSCIF_BR1             REG_ACCESS(RwReg  , 0x400F047CU) /**< \brief (BSCIF) Backup Register 1 */
#define REG_BSCIF_BR2             REG_ACCESS(RwReg  , 0x400F0480U) /**< \brief (BSCIF) Backup Register 2 */
#define REG_BSCIF_BR3             REG_ACCESS(RwReg  , 0x400F0484U) /**< \brief (BSCIF) Backup Register 3 */
#define REG_BSCIF_BRIFBVERSION    REG_ACCESS(RoReg  , 0x400F07E4U) /**< \brief (BSCIF) Backup Register Interface Version Register */ 
#define REG_BSCIF_BGREFIFBVERSION REG_ACCESS(RoReg  , 0x400F07E8U) /**< \brief (BSCIF) BGREFIFB Version Register */ 
#define REG_BSCIF_VREGIFGVERSION  REG_ACCESS(RoReg  , 0x400F07ECU) /**< \brief (BSCIF) VREGIFA Version Register */ 
#define REG_BSCIF_BODIFCVERSION   REG_ACCESS(RoReg  , 0x400F07F0U) /**< \brief (BSCIF) BODIFC Version Register */ 
#define REG_BSCIF_RC32KIFBVERSION REG_ACCESS(RoReg  , 0x400F07F4U) /**< \brief (BSCIF) 32 kHz RC Oscillator Version Register */ 
#define REG_BSCIF_OSC32IFAVERSION REG_ACCESS(RoReg  , 0x400F07F8U) /**< \brief (BSCIF) 32 KHz Oscillator Version Register */ 
#define REG_BSCIF_VERSION         REG_ACCESS(RoReg  , 0x400F07FCU) /**< \brief (BSCIF) BSCIF Version Register */ 
/* ========== Register definition for AST peripheral ========== */
#define REG_AST_CR                REG_ACCESS(RwReg  , 0x400F0800U) /**< \brief (AST) Control Register */ 
#define REG_AST_CV                REG_ACCESS(RwReg  , 0x400F0804U) /**< \brief (AST) Counter Value */ 
#define REG_AST_SR                REG_ACCESS(RoReg  , 0x400F0808U) /**< \brief (AST) Status Register */ 
#define REG_AST_SCR               REG_ACCESS(WoReg  , 0x400F080CU) /**< \brief (AST) Status Clear Register */ 
#define REG_AST_IER               REG_ACCESS(WoReg  , 0x400F0810U) /**< \brief (AST) Interrupt Enable Register */ 
#define REG_AST_IDR               REG_ACCESS(WoReg  , 0x400F0814U) /**< \brief (AST) Interrupt Disable Register */ 
#define REG_AST_IMR               REG_ACCESS(RoReg  , 0x400F0818U) /**< \brief (AST) Interrupt Mask Register */ 
