Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define REG_AST_WER               REG_ACCESS(RwReg  , 0x400F081CU) /**< \brief (AST) Wake Enable Register */ 
#define REG_AST_AR0               REG_ACCESS(RwReg  , 0x400F0820U) /**< \brief (AST) Alarm Register 0 */ 
#define REG_AST_AR1               REG_ACCESS(RwReg  , 0x400F0824U) /**< \brief (AST) Alarm Register 1 */ 
#define REG_AST_PIR0              REG_ACCESS(RwReg  , 0x400F0830U) /**< \brief (AST) Periodic Interval Register 0 */ 
#define REG_AST_PIR1              REG_ACCESS(RwReg  , 0x400F0834U) /**< \brief (AST) Periodic Interval Register 1 */ 
#define REG_AST_CLOCK             REG_ACCESS(RwReg  , 0x400F0840U) /**< \brief (AST) Clock Control Register */ 
#define REG_AST_DTR               REG_ACCESS(RwReg  , 0x400F0844U) /**< \brief (AST) Digital Tuner Register */ 
#define REG_AST_EVE               REG_ACCESS(WoReg  , 0x400F0848U) /**< \brief (AST) Event Enable Register */ 
#define REG_AST_EVD               REG_ACCESS(WoReg  , 0x400F084CU) /**< \brief (AST) Event Disable Register */ 
#define REG_AST_EVM               REG_ACCESS(RoReg  , 0x400F0850U) /**< \brief (AST) Event Mask Register */ 
#define REG_AST_CALV              REG_ACCESS(RwReg  , 0x400F0854U) /**< \brief (AST) Calendar Value */ 
#define REG_AST_PARAMETER         REG_ACCESS(RoReg  , 0x400F08F0U) /**< \brief (AST) Parameter Register */ 
#define REG_AST_VERSION           REG_ACCESS(RoReg  , 0x400F08FCU) /**< \brief (AST) Version Register */ 
/* ========== Register definition for WDT peripheral ========== */
#define REG_WDT_CTRL              REG_ACCESS(RwReg  , 0x400F0C00U) /**< \brief (WDT) Control Register */ 
#define REG_WDT_CLR               REG_ACCESS(WoReg  , 0x400F0C04U) /**< \brief (WDT) Clear Register */ 
#define REG_WDT_SR                REG_ACCESS(RoReg  , 0x400F0C08U) /**< \brief (WDT) Status Register */ 
#define REG_WDT_IER               REG_ACCESS(WoReg  , 0x400F0C0CU) /**< \brief (WDT) Interrupt Enable Register */ 
#define REG_WDT_IDR               REG_ACCESS(WoReg  , 0x400F0C10U) /**< \brief (WDT) Interrupt Disable Register */ 
#define REG_WDT_IMR               REG_ACCESS(RoReg  , 0x400F0C14U) /**< \brief (WDT) Interrupt Mask Register */ 
#define REG_WDT_ISR               REG_ACCESS(RoReg  , 0x400F0C18U) /**< \brief (WDT) Interrupt Status Register */ 
#define REG_WDT_ICR               REG_ACCESS(WoReg  , 0x400F0C1CU) /**< \brief (WDT) Interrupt Clear Register */ 
#define REG_WDT_VERSION           REG_ACCESS(RoReg  , 0x400F0FFCU) /**< \brief (WDT) Version Register */ 
/* ========== Register definition for EIC peripheral ========== */
#define REG_EIC_IER               REG_ACCESS(WoReg  , 0x400F1000U) /**< \brief (EIC) Interrupt Enable Register */ 
#define REG_EIC_IDR               REG_ACCESS(WoReg  , 0x400F1004U) /**< \brief (EIC) Interrupt Disable Register */ 
#define REG_EIC_IMR               REG_ACCESS(RoReg  , 0x400F1008U) /**< \brief (EIC) Interrupt Mask Register */ 
#define REG_EIC_ISR               REG_ACCESS(RoReg  , 0x400F100CU) /**< \brief (EIC) Interrupt Status Register */ 
#define REG_EIC_ICR               REG_ACCESS(WoReg  , 0x400F1010U) /**< \brief (EIC) Interrupt Clear Register */ 
#define REG_EIC_MODE              REG_ACCESS(RwReg  , 0x400F1014U) /**< \brief (EIC) Mode Register */ 
#define REG_EIC_EDGE              REG_ACCESS(RwReg  , 0x400F1018U) /**< \brief (EIC) Edge Register */ 
#define REG_EIC_LEVEL             REG_ACCESS(RwReg  , 0x400F101CU) /**< \brief (EIC) Level Register */ 
#define REG_EIC_FILTER            REG_ACCESS(RwReg  , 0x400F1020U) /**< \brief (EIC) Filter Register */ 
#define REG_EIC_ASYNC             REG_ACCESS(RwReg  , 0x400F1028U) /**< \brief (EIC) Asynchronous Register */ 
#define REG_EIC_EN                REG_ACCESS(WoReg  , 0x400F1030U) /**< \brief (EIC) Enable Register */ 
#define REG_EIC_DIS               REG_ACCESS(WoReg  , 0x400F1034U) /**< \brief (EIC) Disable Register */ 
#define REG_EIC_CTRL              REG_ACCESS(RoReg  , 0x400F1038U) /**< \brief (EIC) Control Register */ 
#define REG_EIC_VERSION           REG_ACCESS(RoReg  , 0x400F13FCU) /**< \brief (EIC) Version Register */ 
/* ========== Register definition for PICOUART peripheral ========== */
#define REG_PICOUART_CR           REG_ACCESS(WoReg  , 0x400F1400U) /**< \brief (PICOUART) Control Register */ 
#define REG_PICOUART_CFG          REG_ACCESS(RwReg  , 0x400F1404U) /**< \brief (PICOUART) Configuration Register */ 
#define REG_PICOUART_SR           REG_ACCESS(RoReg  , 0x400F1408U) /**< \brief (PICOUART) Status Register */ 
#define REG_PICOUART_RHR          REG_ACCESS(RoReg  , 0x400F140CU) /**< \brief (PICOUART) Receive Holding Register */ 
#define REG_PICOUART_VERSION      REG_ACCESS(RoReg  , 0x400F1420U) /**< \brief (PICOUART) Version Register */ 
/*@}*/

/* ************************************************************************** */
/**  NUMBER OF PERIPHERAL INSTANCES FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_inst_num Number of Peripheral Instances */
/*@{*/

#define ABDACB_INST_NUM     1 /**< \brief Audio Bitstream DAC instances */
#define ACIFC_INST_NUM      1 /**< \brief Analog Comparator Interface instances */
#define ADCIFE_INST_NUM     1 /**< \brief ADC controller interface instances */
#define AESA_INST_NUM       1 /**< \brief Advanced Encryption Standard instances */
#define AST_INST_NUM        1 /**< \brief Asynchronous Timer instances */
#define BPM_INST_NUM        1 /**< \brief Backup Power Manager instances */
#define BSCIF_INST_NUM      1 /**< \brief Backup System Control Interface instances */
#define CATB_INST_NUM       1 /**< \brief Capacitive Touch Module B instances */
#define CHIPID_INST_NUM     1 /**< \brief Chip ID Registers instances */
#define CRCCU_INST_NUM      1 /**< \brief CRC Calculation Unit instances */
#define DACC_INST_NUM       1 /**< \brief DAC Controller instances */
#define EIC_INST_NUM        1 /**< \brief External Interrupt Controller instances */
#define FLASHCALW_INST_NUM  1 /**< \brief Flash Controller instances */
#define FREQM_INST_NUM      1 /**< \brief Frequency Meter instances */
#define GLOC_INST_NUM       1 /**< \brief Glue Logic Controller instances */
#define GPIO_INST_NUM       1 /**< \brief General-Purpose Input/Output Controller instances */
#define HCACHE_INST_NUM     1 /**< \brief Cortex M I&D Cache Controller instances */
#define HMATRIXB_INST_NUM   1 /**< \brief HSB Matrix instances */
#define IISC_INST_NUM       1 /**< \brief Inter-IC Sound (I2S) Controller instances */
#define LCDCA_INST_NUM      1 /**< \brief LCD Controller instances */
#define PARC_INST_NUM       1 /**< \brief Parallel Capture instances */
#define PDCA_INST_NUM       1 /**< \brief Peripheral DMA Controller instances */
#define PEVC_INST_NUM       1 /**< \brief Peripheral Event Controller instances */
#define PICOUART_INST_NUM   1 /**< \brief Pico UART instances */
#define PM_INST_NUM         1 /**< \brief Power Manager instances */
#define PTC_INST_NUM        1 /**< \brief  instances */
#define SCIF_INST_NUM       1 /**< \brief System Control Interface instances */
#define SMAP_INST_NUM       1 /**< \brief System Manager Access Port instances */
#define SPI_INST_NUM        1 /**< \brief Serial Peripheral Interface instances */
#define TC_INST_NUM         2 /**< \brief Timer/Counter instances */
#define TRNG_INST_NUM       1 /**< \brief True Random Number Generator instances */
#define TWIM_INST_NUM       4 /**< \brief Two-wire Master Interface instances */
#define TWIS_INST_NUM       2 /**< \brief Two-wire Slave Interface instances */
#define USART_INST_NUM      4 /**< \brief Universal Synchronous Asynchronous Receiver Transmitter instances */
#define USBC_INST_NUM       1 /**< \brief USB 2.0 Interface instances */
#define WDT_INST_NUM        1 /**< \brief Watchdog Timer instances */
/*@}*/

/* ************************************************************************** */
/**  PERIPHERAL ID DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_id Peripheral Ids Definitions */
/*@{*/

