Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define ID_IISC       ( 0) /**< \brief Inter-IC Sound (I2S) Controller (IISC) */
#define ID_SPI        ( 1) /**< \brief Serial Peripheral Interface (SPI) */
#define ID_TC0        ( 2) /**< \brief Timer/Counter TC (TC0) */
#define ID_TC1        ( 3) /**< \brief Timer/Counter TC (TC1) */
#define ID_TWIM0      ( 4) /**< \brief Two-wire Master Interface TWIM (TWIM0) */
#define ID_TWIS0      ( 5) /**< \brief Two-wire Slave Interface TWIS (TWIS0) */
#define ID_TWIM1      ( 6) /**< \brief Two-wire Master Interface TWIM (TWIM1) */
#define ID_TWIS1      ( 7) /**< \brief Two-wire Slave Interface TWIS (TWIS1) */
#define ID_USART0     ( 8) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART0) */
#define ID_USART1     ( 9) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART1) */
#define ID_USART2     (10) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART2) */
#define ID_USART3     (11) /**< \brief Universal Synchronous Asynchronous Receiver Transmitter USART (USART3) */
#define ID_ADCIFE     (12) /**< \brief ADC controller interface (ADCIFE) */
#define ID_DACC       (13) /**< \brief DAC Controller (DACC) */
#define ID_ACIFC      (14) /**< \brief Analog Comparator Interface (ACIFC) */
#define ID_GLOC       (15) /**< \brief Glue Logic Controller (GLOC) */
#define ID_ABDACB     (16) /**< \brief Audio Bitstream DAC (ABDACB) */
#define ID_TRNG       (17) /**< \brief True Random Number Generator (TRNG) */
#define ID_PARC       (18) /**< \brief Parallel Capture (PARC) */
#define ID_CATB       (19) /**< \brief Capacitive Touch Module B (CATB) */
#define ID_PTC        (20) /**< \brief  (PTC) */
#define ID_TWIM2      (21) /**< \brief Two-wire Master Interface TWIM (TWIM2) */
#define ID_TWIM3      (22) /**< \brief Two-wire Master Interface TWIM (TWIM3) */
#define ID_LCDCA      (23) /**< \brief LCD Controller (LCDCA) */
#define ID_HFLASHC    (24) /**< \brief Flash Controller (HFLASHC) */
#define ID_HCACHE     (25) /**< \brief Cortex M I&D Cache Controller (HCACHE) */
#define ID_HMATRIX    (26) /**< \brief HSB Matrix (HMATRIX) */
#define ID_PDCA       (27) /**< \brief Peripheral DMA Controller (PDCA) */
#define ID_SMAP       (28) /**< \brief System Manager Access Port (SMAP) */
#define ID_CRCCU      (29) /**< \brief CRC Calculation Unit (CRCCU) */
#define ID_USBC       (30) /**< \brief USB 2.0 Interface (USBC) */
#define ID_PEVC       (31) /**< \brief Peripheral Event Controller (PEVC) */
#define ID_AESA       (32) /**< \brief Advanced Encryption Standard (AESA) */
#define ID_PM         (33) /**< \brief Power Manager (PM) */
#define ID_CHIPID     (34) /**< \brief Chip ID Registers (CHIPID) */
#define ID_SCIF       (35) /**< \brief System Control Interface (SCIF) */
#define ID_FREQM      (36) /**< \brief Frequency Meter (FREQM) */
#define ID_GPIO       (37) /**< \brief General-Purpose Input/Output Controller (GPIO) */
#define ID_BPM        (38) /**< \brief Backup Power Manager (BPM) */
#define ID_BSCIF      (39) /**< \brief Backup System Control Interface (BSCIF) */
#define ID_AST        (40) /**< \brief Asynchronous Timer (AST) */
#define ID_WDT        (41) /**< \brief Watchdog Timer (WDT) */
#define ID_EIC        (42) /**< \brief External Interrupt Controller (EIC) */
#define ID_PICOUART   (43) /**< \brief Pico UART (PICOUART) */
/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_base Peripheral Base Address Definitions */
/*@{*/

#define IISC_ADDR       (0x40004000U)                    /**< \brief (IISC) Base Address */
#define IISC            CAST(Iisc,      IISC_ADDR)      
#define SPI_ADDR        (0x40008000U)                    /**< \brief (SPI) Base Address */
#define SPI             CAST(Spi,       SPI_ADDR)       
#define TC0_ADDR        (0x40010000U)                    /**< \brief (TC0) Base Address */
#define TC0             CAST(Tc,        TC0_ADDR)       
#define TC1_ADDR        (0x40014000U)                    /**< \brief (TC1) Base Address */
#define TC1             CAST(Tc,        TC1_ADDR)       
#define TWIM0_ADDR      (0x40018000U)                    /**< \brief (TWIM0) Base Address */
#define TWIM0           CAST(Twim,      TWIM0_ADDR)     
#define TWIS0_ADDR      (0x40018400U)                    /**< \brief (TWIS0) Base Address */
#define TWIS0           CAST(Twis,      TWIS0_ADDR)     
#define TWIM1_ADDR      (0x4001C000U)                    /**< \brief (TWIM1) Base Address */
#define TWIM1           CAST(Twim,      TWIM1_ADDR)     
#define TWIS1_ADDR      (0x4001C400U)                    /**< \brief (TWIS1) Base Address */
#define TWIS1           CAST(Twis,      TWIS1_ADDR)     
#define USART0_ADDR     (0x40024000U)                    /**< \brief (USART0) Base Address */
#define USART0          CAST(Usart,     USART0_ADDR)    
#define USART1_ADDR     (0x40028000U)                    /**< \brief (USART1) Base Address */
#define USART1          CAST(Usart,     USART1_ADDR)    
#define USART2_ADDR     (0x4002C000U)                    /**< \brief (USART2) Base Address */
#define USART2          CAST(Usart,     USART2_ADDR)    
#define USART3_ADDR     (0x40030000U)                    /**< \brief (USART3) Base Address */
#define USART3          CAST(Usart,     USART3_ADDR)    
#define ADCIFE_ADDR     (0x40038000U)                    /**< \brief (ADCIFE) Base Address */
#define ADCIFE          CAST(Adcife,    ADCIFE_ADDR)    
#define DACC_ADDR       (0x4003C000U)                    /**< \brief (DACC) Base Address */
#define DACC            CAST(Dacc,      DACC_ADDR)      
#define ACIFC_ADDR      (0x40040000U)                    /**< \brief (ACIFC) Base Address */
#define ACIFC           CAST(Acifc,     ACIFC_ADDR)     
#define GLOC_ADDR       (0x40060000U)                    /**< \brief (GLOC) Base Address */
#define GLOC            CAST(Gloc,      GLOC_ADDR)      
#define ABDACB_ADDR     (0x40064000U)                    /**< \brief (ABDACB) Base Address */
#define ABDACB          CAST(Abdacb,    ABDACB_ADDR)    
#define TRNG_ADDR       (0x40068000U)                    /**< \brief (TRNG) Base Address */
#define TRNG            CAST(Trng,      TRNG_ADDR)      
#define PARC_ADDR       (0x4006C000U)                    /**< \brief (PARC) Base Address */
#define PARC            CAST(Parc,      PARC_ADDR)      
#define CATB_ADDR       (0x40070000U)                    /**< \brief (CATB) Base Address */
#define CATB            CAST(Catb,      CATB_ADDR)      
#define PTC_ADDR        (0x40074000U)                    /**< \brief (PTC) Base Address */
#define PTC             CAST(Ptc,       PTC_ADDR)       
#define TWIM2_ADDR      (0x40078000U)                    /**< \brief (TWIM2) Base Address */
#define TWIM2           CAST(Twim,      TWIM2_ADDR)     
#define TWIM3_ADDR      (0x4007C000U)                    /**< \brief (TWIM3) Base Address */
#define TWIM3           CAST(Twim,      TWIM3_ADDR)     
#define LCDCA_ADDR      (0x40080000U)                    /**< \brief (LCDCA) Base Address */
#define LCDCA           CAST(Lcdca,     LCDCA_ADDR)     
#define HFLASHC_ADDR    (0x400A0000U)                    /**< \brief (HFLASHC) Base Address */
#define HFLASHC         CAST(Flashcalw, HFLASHC_ADDR)   
#define HCACHE_ADDR     (0x400A0400U)                    /**< \brief (HCACHE) Base Address */
#define HCACHE          CAST(Hcache,    HCACHE_ADDR)    
#define HMATRIX_ADDR    (0x400A1000U)                    /**< \brief (HMATRIX) Base Address */
#define HMATRIX         CAST(Hmatrixb,  HMATRIX_ADDR)   
#define PDCA_ADDR       (0x400A2000U)                    /**< \brief (PDCA) Base Address */
#define PDCA            CAST(Pdca,      PDCA_ADDR)      
#define SMAP_ADDR       (0x400A3000U)                    /**< \brief (SMAP) Base Address */
#define SMAP            CAST(Smap,      SMAP_ADDR)      
#define CRCCU_ADDR      (0x400A4000U)                    /**< \brief (CRCCU) Base Address */
#define CRCCU           CAST(Crccu,     CRCCU_ADDR)     
#define USBC_ADDR       (0x400A5000U)                    /**< \brief (USBC) Base Address */
#define USBC            CAST(Usbc,      USBC_ADDR)      
#define PEVC_ADDR       (0x400A6000U)                    /**< \brief (PEVC) Base Address */
#define PEVC            CAST(Pevc,      PEVC_ADDR)      
#define AESA_ADDR       (0x400B0000U)                    /**< \brief (AESA) Base Address */
#define AESA            CAST(Aesa,      AESA_ADDR)      
#define PM_ADDR         (0x400E0000U)                    /**< \brief (PM) Base Address */
#define PM              CAST(Pm,        PM_ADDR)        
#define CHIPID_ADDR     (0x400E0400U)                    /**< \brief (CHIPID) Base Address */
#define CHIPID          CAST(Chipid,    CHIPID_ADDR)    
#define SCIF_ADDR       (0x400E0800U)                    /**< \brief (SCIF) Base Address */
#define SCIF            CAST(Scif,      SCIF_ADDR)      
#define FREQM_ADDR      (0x400E0C00U)                    /**< \brief (FREQM) Base Address */
#define FREQM           CAST(Freqm,     FREQM_ADDR)     
#define GPIO_ADDR       (0x400E1000U)                    /**< \brief (GPIO) Base Address */
#define GPIO            CAST(Gpio,      GPIO_ADDR)      
#define BPM_ADDR        (0x400F0000U)                    /**< \brief (BPM) Base Address */
#define BPM             CAST(Bpm,       BPM_ADDR)       
#define BSCIF_ADDR      (0x400F0400U)                    /**< \brief (BSCIF) Base Address */
#define BSCIF           CAST(Bscif,     BSCIF_ADDR)     
#define AST_ADDR        (0x400F0800U)                    /**< \brief (AST) Base Address */
#define AST             CAST(Ast,       AST_ADDR)       
#define WDT_ADDR        (0x400F0C00U)                    /**< \brief (WDT) Base Address */
#define WDT             CAST(Wdt,       WDT_ADDR)       
#define EIC_ADDR        (0x400F1000U)                    /**< \brief (EIC) Base Address */
#define EIC             CAST(Eic,       EIC_ADDR)       
#define PICOUART_ADDR   (0x400F1400U)                    /**< \brief (PICOUART) Base Address */
#define PICOUART        CAST(Picouart,  PICOUART_ADDR)  
/*@}*/

/* ************************************************************************** */
/**  INSTANCE PARAMETERS DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_parameters Instance Parameters Definitions */
/*@{*/

/* ========== Instance parameters for ABDACB peripheral ========== */
#define ABDACB_GCLK_NUM             6
#define ABDACB_PDCA_ID_TX_CH0       31
#define ABDACB_PDCA_ID_TX_CH1       32
/* ========== Instance parameters for ADCIFE peripheral ========== */
#define ADCIFE_CHANNELS             16
#define ADCIFE_CHANNEL_MSB          15
#define ADCIFE_EXT_TRIGGERS_MSB     0
#define ADCIFE_GCLK_NUM             10
#define ADCIFE_PDCA_ID_RX           11
#define ADCIFE_PDCA_ID_TX           29
#define ADCIFE_REG_RX               LCV
#define ADCIFE_REG_TX               CDMA
/* ========== Instance parameters for AESA peripheral ========== */
#define AESA_DMAC_ID_RX             
#define AESA_DMAC_ID_TX             
#define AESA_GCLK_NUM               4
#define AESA_PDCA_ID_RX             17
#define AESA_PDCA_ID_TX             36
/* ========== Instance parameters for AST peripheral ========== */
#define AST_CLK1K                   4
#define AST_CLK32                   1
#define AST_GCLK_NUM                2
#define AST_GENCLK                  3
#define AST_PB                      2
#define AST_RCOSC                   0
/* ========== Instance parameters for BPM peripheral ========== */
#define BPM_BKUPPMUX_MSB            9
#define BPM_BKUPWEN_AST             1
#define BPM_BKUPWEN_BOD18           4
#define BPM_BKUPWEN_BOD33           3
#define BPM_BKUPWEN_EIC             0
#define BPM_BKUPWEN_MSB             5
#define BPM_BKUPWEN_PICOUART        5
#define BPM_BKUPWEN_WDT             2
/* ========== Instance parameters for BSCIF peripheral ========== */
#define BSCIF_BGBUF_NUM             6
#define BSCIF_BOD18_IMPLEMENTED     0
#define BSCIF_BOD33_IMPLEMENTED     0
#define BSCIF_BOD50_IMPLEMENTED     0
#define BSCIF_BR_NUM                4
/* ========== Instance parameters for CATB peripheral ========== */
#define CATB_GCLK_NUM               3
#define CATB_PDCA_ID_RX             12
#define CATB_PDCA_ID_TX             30
#define CATB_SENSORS_MSB            31
#define CATB_STATUS_REG_NUMBER      1
/* ========== Instance parameters for DACC peripheral ========== */
#define DACC_DACC_EXT_TRIG_MSB      0
#define DACC_DAC_RES_MSB            9
#define DACC_PDCA_ID_TX             35
/* ========== Instance parameters for EIC peripheral ========== */
#define EIC_STD_NUM                 8
/* ========== Instance parameters for FREQM peripheral ========== */
#define FREQM_CPU                   0
#define FREQM_CRIPOSC               10
#define FREQM_DFLL0                 9
#define FREQM_FLO_JITTER            27
#define FREQM_GENCLK0               11
#define FREQM_GENCLK1               12
#define FREQM_GENCLK2               13
#define FREQM_GENCLK3               14
#define FREQM_GENCLK4               15
#define FREQM_GENCLK5               16
#define FREQM_GENCLK6               17
#define FREQM_GENCLK7               18
#define FREQM_GENCLK8               19
#define FREQM_GENCLK9               20
#define FREQM_GENCLK10              21
#define FREQM_HSB                   1
#define FREQM_NUM_CLK               28
#define FREQM_NUM_REF_CLK           4
#define FREQM_OSC0                  6
#define FREQM_OSC32                 7
#define FREQM_PBA                   2
#define FREQM_PBB                   3
#define FREQM_PBC                   4
#define FREQM_PLL0                  26
#define FREQM_RCFAST                24
#define FREQM_RCOSC                 8
#define FREQM_RC1M                  25
#define FREQM_RC32K                 7
#define FREQM_RC80M                 23
#define FREQM_REFSEL_BITS           2
#define FREQM_REF_OSC32             1
#define FREQM_REF_RCOSC             0
/* ========== Instance parameters for GLOC peripheral ========== */
#define GLOC_GCLK_NUM               5
#define GLOC_LUTS                   2
/* ========== Instance parameters for GPIO peripheral ========== */
#define GPIO_GPIO_IRQ_MSB           11
#define GPIO_GPIO_MAX_IRQ_MSB       11
#define GPIO_GPIO_PADDR_BITS        11
#define GPIO_GPIO_PINS_MSB          95
#define GPIO_IRQS_PER_GROUP         8
#define GPIO_NUMBER_OF_PINS         96
#define GPIO_PADDR_MSB              10
#define GPIO_PDATA_MSB              31
#define GPIO_PORT_LENGTH            3
/* ========== Instance parameters for HMATRIX ========== */
#define HMATRIX_SLAVE_FLASH             0
#define HMATRIX_SLAVE_HTOP0             1
#define HMATRIX_SLAVE_HTOP1             2
#define HMATRIX_SLAVE_HTOP2             3
#define HMATRIX_SLAVE_HTOP3             4
#define HMATRIX_SLAVE_HRAMC0            5
#define HMATRIX_SLAVE_HRAMC1            6
#define HMATRIX_SLAVE_AESA              7
#define HMATRIX_SLAVE_NUM               8

#define HMATRIX_MASTER_CPU_IDCODE       0
#define HMATRIX_MASTER_CPU_SYS          1
#define HMATRIX_MASTER_SMAP             2
#define HMATRIX_MASTER_PDCA             3
#define HMATRIX_MASTER_USBC_MASTER      4
#define HMATRIX_MASTER_CRCCU            5
#define HMATRIX_MASTER_PTC              6
#define HMATRIX_MASTER_NUM              7
/* ========== Instance parameters for IISC peripheral ========== */
#define IISC_GCLK_NUM               6
#define IISC_PDCA_ID_RX             14
#define IISC_PDCA_ID_RX_1           15
#define IISC_PDCA_ID_TX             33
#define IISC_PDCA_ID_TX_1           34
/* ========== Instance parameters for LCDCA peripheral ========== */
#define LCDCA_PDCA_ID_TX_ABM        38
#define LCDCA_PDCA_ID_TX_ACM        37
/* ========== Instance parameters for PARC peripheral ========== */
#define PARC_PDCA_ID_RX             16
/* ========== Instance parameters for PDCA peripheral ========== */
#define PDCA_CHANNEL_LENGTH         16
#define PDCA_CLK_AHB_ID             0
#define PDCA_MON_CH0_IMPL           0
#define PDCA_MON_CH1_IMPL           0
/* ========== Instance parameters for PEVC peripheral ========== */
#define PEVC_EVIN_BITS              31
#define PEVC_GCLK_NUM_0             8
#define PEVC_GCLK_NUM_1             9
#define PEVC_GCLK_NUM_LSB           8
#define PEVC_GCLK_NUM_MSB           9
#define PEVC_GCLK_NUM_SIZE          2
#define PEVC_PADS_BITS              4
#define PEVC_TRIGOUT_BITS           19

// GENERATORS
#define PEVC_ID_GEN_PAD_0                     0 /* EVS IGF */
#define PEVC_ID_GEN_PAD_1                     1 /* EVS IGF */
#define PEVC_ID_GEN_PAD_2                     2 /* EVS IGF */
#define PEVC_ID_GEN_PAD_3                     3 /* EVS IGF */
#define PEVC_ID_GEN_GCLK_0                    4 /* EVS */
#define PEVC_ID_GEN_GCLK_1                    5 /* EVS */
#define PEVC_ID_GEN_AST_0                     6 /* EVS */
#define PEVC_ID_GEN_AST_1                     7 /* EVS */
#define PEVC_ID_GEN_AST_2                     8 /* EVS */
#define PEVC_ID_GEN_AST_3                     9 /* EVS */
#define PEVC_ID_GEN_AST_4                     10 /* EVS */
#define PEVC_ID_GEN_ACIFC_CHANNEL_POSITIVE_0  11
#define PEVC_ID_GEN_ACIFC_CHANNEL_POSITIVE_1  12
#define PEVC_ID_GEN_ACIFC_CHANNEL_POSITIVE_2  13
#define PEVC_ID_GEN_ACIFC_CHANNEL_POSITIVE_3  14
#define PEVC_ID_GEN_ACIFC_CHANNEL_NEGATIVE_0  15
#define PEVC_ID_GEN_ACIFC_CHANNEL_NEGATIVE_1  16
#define PEVC_ID_GEN_ACIFC_CHANNEL_NEGATIVE_2  17
#define PEVC_ID_GEN_ACIFC_CHANNEL_NEGATIVE_3  18
#define PEVC_ID_GEN_ACIFC_WINDOW_0            19
#define PEVC_ID_GEN_ACIFC_WINDOW_1            20
#define PEVC_ID_GEN_TC0_A0                    21 /* EVS */
#define PEVC_ID_GEN_TC0_A1                    22 /* EVS */
#define PEVC_ID_GEN_TC0_A2                    23 /* EVS */
#define PEVC_ID_GEN_TC0_B0                    24 /* EVS */
#define PEVC_ID_GEN_TC0_B1                    25 /* EVS */
#define PEVC_ID_GEN_TC0_B2                    26 /* EVS */
#define PEVC_ID_GEN_ADCIFE_WM                 27
#define PEVC_ID_GEN_ADCIFE_EOC                28
#define PEVC_ID_GEN_VREGIFG_SSWRDY            29
#define PEVC_ID_GEN_PICOUART                  30 /* EVS */

#define PEVC_CHMX0_EVMX_SIZE_IMPL 5
#define PEVC_CHMX0_EVMX_MASK_IMPL 0x0000001F

#define PEVC_EVS_IMPL 0b1000111111000000000011111111111
#define PEVC_IGF_IMPL 0b0000000000000000000000000001111

