Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
// USERS / CHANNELS
#define PEVC_ID_USER_PDCA_0                   0
#define PEVC_ID_USER_PDCA_1                   1
#define PEVC_ID_USER_PDCA_2                   2
#define PEVC_ID_USER_PDCA_3                   3
#define PEVC_ID_USER_ADCIFE_SOC               4
#define PEVC_ID_USER_DACC_CONV                5
#define PEVC_ID_USER_CATB                     6
#define PEVC_ID_USER_PTC                      7
#define PEVC_ID_USER_TC1_A0                   8
#define PEVC_ID_USER_TC1_A1                   9
#define PEVC_ID_USER_TC1_A2                   10
#define PEVC_ID_USER_TC1_B0                   11
#define PEVC_ID_USER_TC1_B1                   12
#define PEVC_ID_USER_TC1_B2                   13
#define PEVC_ID_USER_ACIFC                    14
#define PEVC_ID_USER_PARC_START               15
#define PEVC_ID_USER_PARC_STOP                16
#define PEVC_ID_USER_VREGIFG_SSWREQ           17
#define PEVC_ID_USER_VREGIFG_SSWDIS           18
/* ========== Instance parameters for PM peripheral ========== */
#define PM_AWEN_LCDCA               7
#define PM_AWEN_PICOUART            6
#define PM_AWEN_TWIS0               0
#define PM_AWEN_TWIS1               1
#define PM_AWEN_USBC                2
#define PM_MCCTRL_MCSEL_DFLL0       3
#define PM_MCCTRL_MCSEL_FLO         7
#define PM_MCCTRL_MCSEL_OSC0        1
#define PM_MCCTRL_MCSEL_PLL0        2
#define PM_MCCTRL_MCSEL_RCFAST      5
#define PM_MCCTRL_MCSEL_RC1M        6
#define PM_MCCTRL_MCSEL_RC80M       4
#define PM_MCCTRL_MCSEL_SLOW        0
#define PM_PM_CLK_APB_NUM           4
#define PM_PPCR_FLASH_WAIT_BGREF_MASK 512
#define PM_PPCR_FLASH_WAIT_BOD18_MASK 1024
/* ========== Instance parameters for PTC peripheral ========== */
#define PTC_GCLK_NUM                3
#define PTC_PDCA_ID_RX              13
/* ========== Instance parameters for SCIF peripheral ========== */
#define SCIF_BOD33_IMPLEMENTED      0
#define SCIF_BOD50_IMPLEMENTED      0
#define SCIF_BR_NUM                 0
#define SCIF_DFLL_CALIB_MSB         3
#define SCIF_DFLL_COARSE_MSB        4
#define SCIF_DFLL_FINE_MSB          7
#define SCIF_DFLL_RANGE_MSB         1
#define SCIF_GCLK_EXTCLK_MSB        3
#define SCIF_GCLK_IN_MSB            1
#define SCIF_GCLK_IN_NUM            2
#define SCIF_GCLK_MSB               10
#define SCIF_GCLK_NUM               12
#define SCIF_GCLK_NUM_DFLL_REF      0
#define SCIF_GCLK_NUM_DFLL_SSG      1
#define SCIF_GCLK_NUM_EXTCLK_0      0
#define SCIF_GCLK_NUM_EXTCLK_1      1
#define SCIF_GCLK_NUM_EXTCLK_2      2
#define SCIF_GCLK_NUM_EXTCLK_3      3
#define SCIF_GCLK_NUM_EXTCLK_LSB    0
#define SCIF_GCLK_NUM_EXTCLK_MSB    3
#define SCIF_GCLK_NUM_EXTCLK_SIZE   4
#define SCIF_GCLK_NUM_FLO           4
#define SCIF_GCLK_NUM_MASTER        11
#define SCIF_GCLK_NUM_PLL           9
#define SCIF_GCLK_NUM_RC32KIFB_REF  5
#define SCIF_GC_USES_CLK_CPU        7
#define SCIF_GC_USES_CLK_HSB        8
#define SCIF_GC_USES_CLK_PBA        9
#define SCIF_GC_USES_CLK_PBB        10
#define SCIF_GC_USES_CLK_PBC        11
#define SCIF_GC_USES_CLK_PBD        12
#define SCIF_GC_USES_CLK_SLOW       0
#define SCIF_GC_USES_CLK_1K         15
#define SCIF_GC_USES_CLK_32         1
#define SCIF_GC_USES_DFLL0          2
#define SCIF_GC_USES_FLO            14
#define SCIF_GC_USES_GCLKPRESC_FP   18
#define SCIF_GC_USES_GCLKPRESC_HRP  17
#define SCIF_GC_USES_GCLK_IN0       19
#define SCIF_GC_USES_GCLK_IN1       20
#define SCIF_GC_USES_MASTER         21
#define SCIF_GC_USES_OSC0           3
#define SCIF_GC_USES_PLL0           16
#define SCIF_GC_USES_RCFAST         5
#define SCIF_GC_USES_RC1M           6
#define SCIF_GC_USES_RC32K          13
#define SCIF_GC_USES_RC80M          4
#define SCIF_OSC_NUM                1
#define SCIF_PLL_NUM                1
#define SCIF_RCFAST_CALIBRATION_MSB 6
#define SCIF_RCFAST_FRANGE_MSB      1
#define SCIF_RC80M_CALIBRATION_MSB  1
/* ========== Instance parameters for SPI peripheral ========== */
#define SPI_CS_MSB                  3
#define SPI_PDCA_ID_RX              4
#define SPI_PDCA_ID_TX              22
/* ========== Instance parameters for TC0 peripheral ========== */
#define TC0_CLK_DIV1                gen_clk_tc0
#define TC0_CLK_DIV2                2
#define TC0_CLK_DIV3                8
#define TC0_CLK_DIV4                32
#define TC0_CLK_DIV5                128
#define TC0_GCLK_NUM                5
/* ========== Instance parameters for TC1 peripheral ========== */
#define TC1_CLK_DIV1                gen_clk_tc1
#define TC1_CLK_DIV2                2
#define TC1_CLK_DIV3                8
#define TC1_CLK_DIV4                32
#define TC1_CLK_DIV5                128
#define TC1_GCLK_NUM                8
/* ========== Instance parameters for TWIM0 peripheral ========== */
#define TWIM0_PDCA_ID_RX            5
#define TWIM0_PDCA_ID_TX            23
/* ========== Instance parameters for TWIM1 peripheral ========== */
#define TWIM1_PDCA_ID_RX            6
#define TWIM1_PDCA_ID_TX            24
/* ========== Instance parameters for TWIM2 peripheral ========== */
#define TWIM2_PDCA_ID_RX            7
#define TWIM2_PDCA_ID_TX            25
/* ========== Instance parameters for TWIM3 peripheral ========== */
#define TWIM3_PDCA_ID_RX            8
#define TWIM3_PDCA_ID_TX            26
/* ========== Instance parameters for TWIS0 peripheral ========== */
#define TWIS0_PDCA_ID_RX            9
#define TWIS0_PDCA_ID_TX            27
/* ========== Instance parameters for TWIS1 peripheral ========== */
#define TWIS1_PDCA_ID_RX            10
#define TWIS1_PDCA_ID_TX            28
/* ========== Instance parameters for USART0 peripheral ========== */
#define USART0_CLK_DIV              8
#define USART0_PDCA_ID_RX           0
#define USART0_PDCA_ID_TX           18
/* ========== Instance parameters for USART1 peripheral ========== */
#define USART1_CLK_DIV              8
#define USART1_PDCA_ID_RX           1
#define USART1_PDCA_ID_TX           19
/* ========== Instance parameters for USART2 peripheral ========== */
#define USART2_CLK_DIV              8
#define USART2_PDCA_ID_RX           2
#define USART2_PDCA_ID_TX           20
/* ========== Instance parameters for USART3 peripheral ========== */
#define USART3_CLK_DIV              8
#define USART3_PDCA_ID_RX           3
#define USART3_PDCA_ID_TX           21
/* ========== Instance parameters for USBC peripheral ========== */
#define USBC_EPT_NBR                7
#define USBC_GCLK_NUM               7
#define USBC_HOST_IMPLEMENTED       1
#define USBC_OTG_IMPLEMENTED        
#define USBC_USB_UTMI_IMPLEMENTED   
/*@}*/

/* ************************************************************************** */
/**  GPIO DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */
/** \addtogroup SAM4L4_gpio GPIO Definitions */
/*@{*/

