Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define PIN_PA00                           0  /**< \brief Pin Number for PA00 */
#define GPIO_PA00                  (1u <<  0) /**< \brief GPIO Mask  for PA00 */
#define PIN_PA01                           1  /**< \brief Pin Number for PA01 */
#define GPIO_PA01                  (1u <<  1) /**< \brief GPIO Mask  for PA01 */
#define PIN_PA02                           2  /**< \brief Pin Number for PA02 */
#define GPIO_PA02                  (1u <<  2) /**< \brief GPIO Mask  for PA02 */
#define PIN_PA03                           3  /**< \brief Pin Number for PA03 */
#define GPIO_PA03                  (1u <<  3) /**< \brief GPIO Mask  for PA03 */
#define PIN_PA04                           4  /**< \brief Pin Number for PA04 */
#define GPIO_PA04                  (1u <<  4) /**< \brief GPIO Mask  for PA04 */
#define PIN_PA05                           5  /**< \brief Pin Number for PA05 */
#define GPIO_PA05                  (1u <<  5) /**< \brief GPIO Mask  for PA05 */
#define PIN_PA06                           6  /**< \brief Pin Number for PA06 */
#define GPIO_PA06                  (1u <<  6) /**< \brief GPIO Mask  for PA06 */
#define PIN_PA07                           7  /**< \brief Pin Number for PA07 */
#define GPIO_PA07                  (1u <<  7) /**< \brief GPIO Mask  for PA07 */
#define PIN_PA08                           8  /**< \brief Pin Number for PA08 */
#define GPIO_PA08                  (1u <<  8) /**< \brief GPIO Mask  for PA08 */
#define PIN_PA09                           9  /**< \brief Pin Number for PA09 */
#define GPIO_PA09                  (1u <<  9) /**< \brief GPIO Mask  for PA09 */
#define PIN_PA10                          10  /**< \brief Pin Number for PA10 */
#define GPIO_PA10                  (1u << 10) /**< \brief GPIO Mask  for PA10 */
#define PIN_PA11                          11  /**< \brief Pin Number for PA11 */
#define GPIO_PA11                  (1u << 11) /**< \brief GPIO Mask  for PA11 */
#define PIN_PA12                          12  /**< \brief Pin Number for PA12 */
#define GPIO_PA12                  (1u << 12) /**< \brief GPIO Mask  for PA12 */
#define PIN_PA13                          13  /**< \brief Pin Number for PA13 */
#define GPIO_PA13                  (1u << 13) /**< \brief GPIO Mask  for PA13 */
#define PIN_PA14                          14  /**< \brief Pin Number for PA14 */
#define GPIO_PA14                  (1u << 14) /**< \brief GPIO Mask  for PA14 */
#define PIN_PA15                          15  /**< \brief Pin Number for PA15 */
#define GPIO_PA15                  (1u << 15) /**< \brief GPIO Mask  for PA15 */
#define PIN_PA16                          16  /**< \brief Pin Number for PA16 */
#define GPIO_PA16                  (1u << 16) /**< \brief GPIO Mask  for PA16 */
#define PIN_PA17                          17  /**< \brief Pin Number for PA17 */
#define GPIO_PA17                  (1u << 17) /**< \brief GPIO Mask  for PA17 */
#define PIN_PA18                          18  /**< \brief Pin Number for PA18 */
#define GPIO_PA18                  (1u << 18) /**< \brief GPIO Mask  for PA18 */
#define PIN_PA19                          19  /**< \brief Pin Number for PA19 */
#define GPIO_PA19                  (1u << 19) /**< \brief GPIO Mask  for PA19 */
#define PIN_PA20                          20  /**< \brief Pin Number for PA20 */
#define GPIO_PA20                  (1u << 20) /**< \brief GPIO Mask  for PA20 */
#define PIN_PA21                          21  /**< \brief Pin Number for PA21 */
#define GPIO_PA21                  (1u << 21) /**< \brief GPIO Mask  for PA21 */
#define PIN_PA22                          22  /**< \brief Pin Number for PA22 */
#define GPIO_PA22                  (1u << 22) /**< \brief GPIO Mask  for PA22 */
#define PIN_PA23                          23  /**< \brief Pin Number for PA23 */
#define GPIO_PA23                  (1u << 23) /**< \brief GPIO Mask  for PA23 */
#define PIN_PA24                          24  /**< \brief Pin Number for PA24 */
#define GPIO_PA24                  (1u << 24) /**< \brief GPIO Mask  for PA24 */
#define PIN_PA25                          25  /**< \brief Pin Number for PA25 */
#define GPIO_PA25                  (1u << 25) /**< \brief GPIO Mask  for PA25 */
#define PIN_PA26                          26  /**< \brief Pin Number for PA26 */
#define GPIO_PA26                  (1u << 26) /**< \brief GPIO Mask  for PA26 */
#define PIN_PA27                          27  /**< \brief Pin Number for PA27 */
#define GPIO_PA27                  (1u << 27) /**< \brief GPIO Mask  for PA27 */
#define PIN_PA28                          28  /**< \brief Pin Number for PA28 */
#define GPIO_PA28                  (1u << 28) /**< \brief GPIO Mask  for PA28 */
#define PIN_PA29                          29  /**< \brief Pin Number for PA29 */
#define GPIO_PA29                  (1u << 29) /**< \brief GPIO Mask  for PA29 */
#define PIN_PA30                          30  /**< \brief Pin Number for PA30 */
#define GPIO_PA30                  (1u << 30) /**< \brief GPIO Mask  for PA30 */
#define PIN_PA31                          31  /**< \brief Pin Number for PA31 */
#define GPIO_PA31                  (1u << 31) /**< \brief GPIO Mask  for PA31 */
#define PIN_PB00                          32  /**< \brief Pin Number for PB00 */
#define GPIO_PB00                  (1u <<  0) /**< \brief GPIO Mask  for PB00 */
#define PIN_PB01                          33  /**< \brief Pin Number for PB01 */
#define GPIO_PB01                  (1u <<  1) /**< \brief GPIO Mask  for PB01 */
#define PIN_PB02                          34  /**< \brief Pin Number for PB02 */
#define GPIO_PB02                  (1u <<  2) /**< \brief GPIO Mask  for PB02 */
#define PIN_PB03                          35  /**< \brief Pin Number for PB03 */
#define GPIO_PB03                  (1u <<  3) /**< \brief GPIO Mask  for PB03 */
#define PIN_PB04                          36  /**< \brief Pin Number for PB04 */
#define GPIO_PB04                  (1u <<  4) /**< \brief GPIO Mask  for PB04 */
#define PIN_PB05                          37  /**< \brief Pin Number for PB05 */
#define GPIO_PB05                  (1u <<  5) /**< \brief GPIO Mask  for PB05 */
#define PIN_PB06                          38  /**< \brief Pin Number for PB06 */
#define GPIO_PB06                  (1u <<  6) /**< \brief GPIO Mask  for PB06 */
#define PIN_PB07                          39  /**< \brief Pin Number for PB07 */
#define GPIO_PB07                  (1u <<  7) /**< \brief GPIO Mask  for PB07 */
#define PIN_PB08                          40  /**< \brief Pin Number for PB08 */
#define GPIO_PB08                  (1u <<  8) /**< \brief GPIO Mask  for PB08 */
#define PIN_PB09                          41  /**< \brief Pin Number for PB09 */
#define GPIO_PB09                  (1u <<  9) /**< \brief GPIO Mask  for PB09 */
#define PIN_PB10                          42  /**< \brief Pin Number for PB10 */
#define GPIO_PB10                  (1u << 10) /**< \brief GPIO Mask  for PB10 */
#define PIN_PB11                          43  /**< \brief Pin Number for PB11 */
#define GPIO_PB11                  (1u << 11) /**< \brief GPIO Mask  for PB11 */
#define PIN_PB12                          44  /**< \brief Pin Number for PB12 */
#define GPIO_PB12                  (1u << 12) /**< \brief GPIO Mask  for PB12 */
#define PIN_PB13                          45  /**< \brief Pin Number for PB13 */
#define GPIO_PB13                  (1u << 13) /**< \brief GPIO Mask  for PB13 */
#define PIN_PB14                          46  /**< \brief Pin Number for PB14 */
#define GPIO_PB14                  (1u << 14) /**< \brief GPIO Mask  for PB14 */
#define PIN_PB15                          47  /**< \brief Pin Number for PB15 */
#define GPIO_PB15                  (1u << 15) /**< \brief GPIO Mask  for PB15 */
#define PIN_PC00                          64  /**< \brief Pin Number for PC00 */
#define GPIO_PC00                  (1u <<  0) /**< \brief GPIO Mask  for PC00 */
#define PIN_PC01                          65  /**< \brief Pin Number for PC01 */
#define GPIO_PC01                  (1u <<  1) /**< \brief GPIO Mask  for PC01 */
#define PIN_PC02                          66  /**< \brief Pin Number for PC02 */
#define GPIO_PC02                  (1u <<  2) /**< \brief GPIO Mask  for PC02 */
#define PIN_PC03                          67  /**< \brief Pin Number for PC03 */
#define GPIO_PC03                  (1u <<  3) /**< \brief GPIO Mask  for PC03 */
#define PIN_PC04                          68  /**< \brief Pin Number for PC04 */
#define GPIO_PC04                  (1u <<  4) /**< \brief GPIO Mask  for PC04 */
#define PIN_PC05                          69  /**< \brief Pin Number for PC05 */
#define GPIO_PC05                  (1u <<  5) /**< \brief GPIO Mask  for PC05 */
#define PIN_PC06                          70  /**< \brief Pin Number for PC06 */
#define GPIO_PC06                  (1u <<  6) /**< \brief GPIO Mask  for PC06 */
#define PIN_PC07                          71  /**< \brief Pin Number for PC07 */
#define GPIO_PC07                  (1u <<  7) /**< \brief GPIO Mask  for PC07 */
#define PIN_PC08                          72  /**< \brief Pin Number for PC08 */
#define GPIO_PC08                  (1u <<  8) /**< \brief GPIO Mask  for PC08 */
#define PIN_PC09                          73  /**< \brief Pin Number for PC09 */
#define GPIO_PC09                  (1u <<  9) /**< \brief GPIO Mask  for PC09 */
#define PIN_PC10                          74  /**< \brief Pin Number for PC10 */
#define GPIO_PC10                  (1u << 10) /**< \brief GPIO Mask  for PC10 */
#define PIN_PC11                          75  /**< \brief Pin Number for PC11 */
#define GPIO_PC11                  (1u << 11) /**< \brief GPIO Mask  for PC11 */
#define PIN_PC12                          76  /**< \brief Pin Number for PC12 */
#define GPIO_PC12                  (1u << 12) /**< \brief GPIO Mask  for PC12 */
#define PIN_PC13                          77  /**< \brief Pin Number for PC13 */
#define GPIO_PC13                  (1u << 13) /**< \brief GPIO Mask  for PC13 */
#define PIN_PC14                          78  /**< \brief Pin Number for PC14 */
#define GPIO_PC14                  (1u << 14) /**< \brief GPIO Mask  for PC14 */
#define PIN_PC15                          79  /**< \brief Pin Number for PC15 */
#define GPIO_PC15                  (1u << 15) /**< \brief GPIO Mask  for PC15 */
#define PIN_PC16                          80  /**< \brief Pin Number for PC16 */
#define GPIO_PC16                  (1u << 16) /**< \brief GPIO Mask  for PC16 */
#define PIN_PC17                          81  /**< \brief Pin Number for PC17 */
#define GPIO_PC17                  (1u << 17) /**< \brief GPIO Mask  for PC17 */
#define PIN_PC18                          82  /**< \brief Pin Number for PC18 */
#define GPIO_PC18                  (1u << 18) /**< \brief GPIO Mask  for PC18 */
#define PIN_PC19                          83  /**< \brief Pin Number for PC19 */
#define GPIO_PC19                  (1u << 19) /**< \brief GPIO Mask  for PC19 */
#define PIN_PC20                          84  /**< \brief Pin Number for PC20 */
#define GPIO_PC20                  (1u << 20) /**< \brief GPIO Mask  for PC20 */
#define PIN_PC21                          85  /**< \brief Pin Number for PC21 */
#define GPIO_PC21                  (1u << 21) /**< \brief GPIO Mask  for PC21 */
#define PIN_PC22                          86  /**< \brief Pin Number for PC22 */
#define GPIO_PC22                  (1u << 22) /**< \brief GPIO Mask  for PC22 */
#define PIN_PC23                          87  /**< \brief Pin Number for PC23 */
#define GPIO_PC23                  (1u << 23) /**< \brief GPIO Mask  for PC23 */
#define PIN_PC24                          88  /**< \brief Pin Number for PC24 */
#define GPIO_PC24                  (1u << 24) /**< \brief GPIO Mask  for PC24 */
#define PIN_PC25                          89  /**< \brief Pin Number for PC25 */
#define GPIO_PC25                  (1u << 25) /**< \brief GPIO Mask  for PC25 */
#define PIN_PC26                          90  /**< \brief Pin Number for PC26 */
#define GPIO_PC26                  (1u << 26) /**< \brief GPIO Mask  for PC26 */
#define PIN_PC27                          91  /**< \brief Pin Number for PC27 */
#define GPIO_PC27                  (1u << 27) /**< \brief GPIO Mask  for PC27 */
#define PIN_PC28                          92  /**< \brief Pin Number for PC28 */
#define GPIO_PC28                  (1u << 28) /**< \brief GPIO Mask  for PC28 */
#define PIN_PC29                          93  /**< \brief Pin Number for PC29 */
#define GPIO_PC29                  (1u << 29) /**< \brief GPIO Mask  for PC29 */
#define PIN_PC30                          94  /**< \brief Pin Number for PC30 */
#define GPIO_PC30                  (1u << 30) /**< \brief GPIO Mask  for PC30 */
#define PIN_PC31                          95  /**< \brief Pin Number for PC31 */
#define GPIO_PC31                  (1u << 31) /**< \brief GPIO Mask  for PC31 */
/* ========== GPIO definition for ABDACB peripheral ========== */
#define PIN_PA31C_ABDACB_CLK              31  /**< \brief ABDACB signal: CLK on PA31 mux C */
#define MUX_PA31C_ABDACB_CLK               2
#define GPIO_PA31C_ABDACB_CLK      (1u << 31)
#define PIN_PC12C_ABDACB_CLK              76  /**< \brief ABDACB signal: CLK on PC12 mux C */
#define MUX_PC12C_ABDACB_CLK               2
#define GPIO_PC12C_ABDACB_CLK      (1u << 12)
#define PIN_PA27C_ABDACB_DAC0             27  /**< \brief ABDACB signal: DAC0 on PA27 mux C */
#define MUX_PA27C_ABDACB_DAC0              2
#define GPIO_PA27C_ABDACB_DAC0     (1u << 27)
#define PIN_PB02C_ABDACB_DAC0             34  /**< \brief ABDACB signal: DAC0 on PB02 mux C */
#define MUX_PB02C_ABDACB_DAC0              2
#define GPIO_PB02C_ABDACB_DAC0     (1u <<  2)
#define PIN_PC09C_ABDACB_DAC0             73  /**< \brief ABDACB signal: DAC0 on PC09 mux C */
#define MUX_PC09C_ABDACB_DAC0              2
#define GPIO_PC09C_ABDACB_DAC0     (1u <<  9)
#define PIN_PA17B_ABDACB_DAC0             17  /**< \brief ABDACB signal: DAC0 on PA17 mux B */
#define MUX_PA17B_ABDACB_DAC0              1
#define GPIO_PA17B_ABDACB_DAC0     (1u << 17)
#define PIN_PA29C_ABDACB_DAC1             29  /**< \brief ABDACB signal: DAC1 on PA29 mux C */
#define MUX_PA29C_ABDACB_DAC1              2
#define GPIO_PA29C_ABDACB_DAC1     (1u << 29)
#define PIN_PB04C_ABDACB_DAC1             36  /**< \brief ABDACB signal: DAC1 on PB04 mux C */
#define MUX_PB04C_ABDACB_DAC1              2
#define GPIO_PB04C_ABDACB_DAC1     (1u <<  4)
#define PIN_PC13C_ABDACB_DAC1             77  /**< \brief ABDACB signal: DAC1 on PC13 mux C */
#define MUX_PC13C_ABDACB_DAC1              2
#define GPIO_PC13C_ABDACB_DAC1     (1u << 13)
#define PIN_PA19B_ABDACB_DAC1             19  /**< \brief ABDACB signal: DAC1 on PA19 mux B */
#define MUX_PA19B_ABDACB_DAC1              1
#define GPIO_PA19B_ABDACB_DAC1     (1u << 19)
#define PIN_PA28C_ABDACB_DACN0            28  /**< \brief ABDACB signal: DACN0 on PA28 mux C */
#define MUX_PA28C_ABDACB_DACN0             2
#define GPIO_PA28C_ABDACB_DACN0    (1u << 28)
#define PIN_PB03C_ABDACB_DACN0            35  /**< \brief ABDACB signal: DACN0 on PB03 mux C */
#define MUX_PB03C_ABDACB_DACN0             2
#define GPIO_PB03C_ABDACB_DACN0    (1u <<  3)
#define PIN_PC10C_ABDACB_DACN0            74  /**< \brief ABDACB signal: DACN0 on PC10 mux C */
#define MUX_PC10C_ABDACB_DACN0             2
#define GPIO_PC10C_ABDACB_DACN0    (1u << 10)
#define PIN_PA18B_ABDACB_DACN0            18  /**< \brief ABDACB signal: DACN0 on PA18 mux B */
#define MUX_PA18B_ABDACB_DACN0             1
#define GPIO_PA18B_ABDACB_DACN0    (1u << 18)
#define PIN_PA30C_ABDACB_DACN1            30  /**< \brief ABDACB signal: DACN1 on PA30 mux C */
#define MUX_PA30C_ABDACB_DACN1             2
#define GPIO_PA30C_ABDACB_DACN1    (1u << 30)
#define PIN_PB05C_ABDACB_DACN1            37  /**< \brief ABDACB signal: DACN1 on PB05 mux C */
#define MUX_PB05C_ABDACB_DACN1             2
#define GPIO_PB05C_ABDACB_DACN1    (1u <<  5)
#define PIN_PC14C_ABDACB_DACN1            78  /**< \brief ABDACB signal: DACN1 on PC14 mux C */
#define MUX_PC14C_ABDACB_DACN1             2
#define GPIO_PC14C_ABDACB_DACN1    (1u << 14)
#define PIN_PA20B_ABDACB_DACN1            20  /**< \brief ABDACB signal: DACN1 on PA20 mux B */
#define MUX_PA20B_ABDACB_DACN1             1
#define GPIO_PA20B_ABDACB_DACN1    (1u << 20)
/* ========== GPIO definition for ACIFC peripheral ========== */
#define PIN_PA06E_ACIFC_ACAN0              6  /**< \brief ACIFC signal: ACAN0 on PA06 mux E */
#define MUX_PA06E_ACIFC_ACAN0              4
#define GPIO_PA06E_ACIFC_ACAN0     (1u <<  6)
#define PIN_PC09E_ACIFC_ACAN1             73  /**< \brief ACIFC signal: ACAN1 on PC09 mux E */
#define MUX_PC09E_ACIFC_ACAN1              4
#define GPIO_PC09E_ACIFC_ACAN1     (1u <<  9)
#define PIN_PA07E_ACIFC_ACAP0              7  /**< \brief ACIFC signal: ACAP0 on PA07 mux E */
#define MUX_PA07E_ACIFC_ACAP0              4
#define GPIO_PA07E_ACIFC_ACAP0     (1u <<  7)
#define PIN_PC10E_ACIFC_ACAP1             74  /**< \brief ACIFC signal: ACAP1 on PC10 mux E */
#define MUX_PC10E_ACIFC_ACAP1              4
#define GPIO_PC10E_ACIFC_ACAP1     (1u << 10)
#define PIN_PB02E_ACIFC_ACBN0             34  /**< \brief ACIFC signal: ACBN0 on PB02 mux E */
#define MUX_PB02E_ACIFC_ACBN0              4
#define GPIO_PB02E_ACIFC_ACBN0     (1u <<  2)
#define PIN_PC13E_ACIFC_ACBN1             77  /**< \brief ACIFC signal: ACBN1 on PC13 mux E */
#define MUX_PC13E_ACIFC_ACBN1              4
#define GPIO_PC13E_ACIFC_ACBN1     (1u << 13)
#define PIN_PB03E_ACIFC_ACBP0             35  /**< \brief ACIFC signal: ACBP0 on PB03 mux E */
#define MUX_PB03E_ACIFC_ACBP0              4
#define GPIO_PB03E_ACIFC_ACBP0     (1u <<  3)
#define PIN_PC14E_ACIFC_ACBP1             78  /**< \brief ACIFC signal: ACBP1 on PC14 mux E */
#define MUX_PC14E_ACIFC_ACBP1              4
#define GPIO_PC14E_ACIFC_ACBP1     (1u << 14)
/* ========== GPIO definition for ADCIFE peripheral ========== */
#define PIN_PA04A_ADCIFE_AD0               4  /**< \brief ADCIFE signal: AD0 on PA04 mux A */
#define MUX_PA04A_ADCIFE_AD0               0
#define GPIO_PA04A_ADCIFE_AD0      (1u <<  4)
#define PIN_PA05A_ADCIFE_AD1               5  /**< \brief ADCIFE signal: AD1 on PA05 mux A */
#define MUX_PA05A_ADCIFE_AD1               0
#define GPIO_PA05A_ADCIFE_AD1      (1u <<  5)
#define PIN_PA07A_ADCIFE_AD2               7  /**< \brief ADCIFE signal: AD2 on PA07 mux A */
#define MUX_PA07A_ADCIFE_AD2               0
#define GPIO_PA07A_ADCIFE_AD2      (1u <<  7)
#define PIN_PB02A_ADCIFE_AD3              34  /**< \brief ADCIFE signal: AD3 on PB02 mux A */
#define MUX_PB02A_ADCIFE_AD3               0
#define GPIO_PB02A_ADCIFE_AD3      (1u <<  2)
#define PIN_PB03A_ADCIFE_AD4              35  /**< \brief ADCIFE signal: AD4 on PB03 mux A */
#define MUX_PB03A_ADCIFE_AD4               0
#define GPIO_PB03A_ADCIFE_AD4      (1u <<  3)
#define PIN_PB04A_ADCIFE_AD5              36  /**< \brief ADCIFE signal: AD5 on PB04 mux A */
#define MUX_PB04A_ADCIFE_AD5               0
#define GPIO_PB04A_ADCIFE_AD5      (1u <<  4)
#define PIN_PB05A_ADCIFE_AD6              37  /**< \brief ADCIFE signal: AD6 on PB05 mux A */
#define MUX_PB05A_ADCIFE_AD6               0
#define GPIO_PB05A_ADCIFE_AD6      (1u <<  5)
#define PIN_PC07A_ADCIFE_AD7              71  /**< \brief ADCIFE signal: AD7 on PC07 mux A */
#define MUX_PC07A_ADCIFE_AD7               0
#define GPIO_PC07A_ADCIFE_AD7      (1u <<  7)
#define PIN_PC08A_ADCIFE_AD8              72  /**< \brief ADCIFE signal: AD8 on PC08 mux A */
#define MUX_PC08A_ADCIFE_AD8               0
#define GPIO_PC08A_ADCIFE_AD8      (1u <<  8)
#define PIN_PC09A_ADCIFE_AD9              73  /**< \brief ADCIFE signal: AD9 on PC09 mux A */
#define MUX_PC09A_ADCIFE_AD9               0
#define GPIO_PC09A_ADCIFE_AD9      (1u <<  9)
#define PIN_PC10A_ADCIFE_AD10             74  /**< \brief ADCIFE signal: AD10 on PC10 mux A */
#define MUX_PC10A_ADCIFE_AD10              0
#define GPIO_PC10A_ADCIFE_AD10     (1u << 10)
#define PIN_PC11A_ADCIFE_AD11             75  /**< \brief ADCIFE signal: AD11 on PC11 mux A */
#define MUX_PC11A_ADCIFE_AD11              0
#define GPIO_PC11A_ADCIFE_AD11     (1u << 11)
#define PIN_PC12A_ADCIFE_AD12             76  /**< \brief ADCIFE signal: AD12 on PC12 mux A */
#define MUX_PC12A_ADCIFE_AD12              0
#define GPIO_PC12A_ADCIFE_AD12     (1u << 12)
#define PIN_PC13A_ADCIFE_AD13             77  /**< \brief ADCIFE signal: AD13 on PC13 mux A */
#define MUX_PC13A_ADCIFE_AD13              0
#define GPIO_PC13A_ADCIFE_AD13     (1u << 13)
#define PIN_PC14A_ADCIFE_AD14             78  /**< \brief ADCIFE signal: AD14 on PC14 mux A */
#define MUX_PC14A_ADCIFE_AD14              0
#define GPIO_PC14A_ADCIFE_AD14     (1u << 14)
#define PIN_PA05E_ADCIFE_TRIGGER           5  /**< \brief ADCIFE signal: TRIGGER on PA05 mux E */
#define MUX_PA05E_ADCIFE_TRIGGER           4
#define GPIO_PA05E_ADCIFE_TRIGGER  (1u <<  5)
/* ========== GPIO definition for CATB peripheral ========== */
#define PIN_PA02G_CATB_DIS                 2  /**< \brief CATB signal: DIS on PA02 mux G */
#define MUX_PA02G_CATB_DIS                 6
#define GPIO_PA02G_CATB_DIS        (1u <<  2)
#define PIN_PA12G_CATB_DIS                12  /**< \brief CATB signal: DIS on PA12 mux G */
#define MUX_PA12G_CATB_DIS                 6
#define GPIO_PA12G_CATB_DIS        (1u << 12)
#define PIN_PA23G_CATB_DIS                23  /**< \brief CATB signal: DIS on PA23 mux G */
#define MUX_PA23G_CATB_DIS                 6
#define GPIO_PA23G_CATB_DIS        (1u << 23)
#define PIN_PA31G_CATB_DIS                31  /**< \brief CATB signal: DIS on PA31 mux G */
#define MUX_PA31G_CATB_DIS                 6
#define GPIO_PA31G_CATB_DIS        (1u << 31)
#define PIN_PB03G_CATB_DIS                35  /**< \brief CATB signal: DIS on PB03 mux G */
#define MUX_PB03G_CATB_DIS                 6
#define GPIO_PB03G_CATB_DIS        (1u <<  3)
#define PIN_PB12G_CATB_DIS                44  /**< \brief CATB signal: DIS on PB12 mux G */
#define MUX_PB12G_CATB_DIS                 6
#define GPIO_PB12G_CATB_DIS        (1u << 12)
#define PIN_PC05G_CATB_DIS                69  /**< \brief CATB signal: DIS on PC05 mux G */
#define MUX_PC05G_CATB_DIS                 6
#define GPIO_PC05G_CATB_DIS        (1u <<  5)
#define PIN_PC14G_CATB_DIS                78  /**< \brief CATB signal: DIS on PC14 mux G */
#define MUX_PC14G_CATB_DIS                 6
#define GPIO_PC14G_CATB_DIS        (1u << 14)
#define PIN_PC23G_CATB_DIS                87  /**< \brief CATB signal: DIS on PC23 mux G */
#define MUX_PC23G_CATB_DIS                 6
#define GPIO_PC23G_CATB_DIS        (1u << 23)
#define PIN_PA04G_CATB_SENSE0              4  /**< \brief CATB signal: SENSE0 on PA04 mux G */
#define MUX_PA04G_CATB_SENSE0              6
#define GPIO_PA04G_CATB_SENSE0     (1u <<  4)
#define PIN_PA27G_CATB_SENSE0             27  /**< \brief CATB signal: SENSE0 on PA27 mux G */
#define MUX_PA27G_CATB_SENSE0              6
#define GPIO_PA27G_CATB_SENSE0     (1u << 27)
#define PIN_PB13G_CATB_SENSE0             45  /**< \brief CATB signal: SENSE0 on PB13 mux G */
#define MUX_PB13G_CATB_SENSE0              6
#define GPIO_PB13G_CATB_SENSE0     (1u << 13)
#define PIN_PA05G_CATB_SENSE1              5  /**< \brief CATB signal: SENSE1 on PA05 mux G */
#define MUX_PA05G_CATB_SENSE1              6
#define GPIO_PA05G_CATB_SENSE1     (1u <<  5)
#define PIN_PA28G_CATB_SENSE1             28  /**< \brief CATB signal: SENSE1 on PA28 mux G */
#define MUX_PA28G_CATB_SENSE1              6
#define GPIO_PA28G_CATB_SENSE1     (1u << 28)
