Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define PIN_PB14G_CATB_SENSE1             46  /**< \brief CATB signal: SENSE1 on PB14 mux G */
#define MUX_PB14G_CATB_SENSE1              6
#define GPIO_PB14G_CATB_SENSE1     (1u << 14)
#define PIN_PA06G_CATB_SENSE2              6  /**< \brief CATB signal: SENSE2 on PA06 mux G */
#define MUX_PA06G_CATB_SENSE2              6
#define GPIO_PA06G_CATB_SENSE2     (1u <<  6)
#define PIN_PA29G_CATB_SENSE2             29  /**< \brief CATB signal: SENSE2 on PA29 mux G */
#define MUX_PA29G_CATB_SENSE2              6
#define GPIO_PA29G_CATB_SENSE2     (1u << 29)
#define PIN_PB15G_CATB_SENSE2             47  /**< \brief CATB signal: SENSE2 on PB15 mux G */
#define MUX_PB15G_CATB_SENSE2              6
#define GPIO_PB15G_CATB_SENSE2     (1u << 15)
#define PIN_PA07G_CATB_SENSE3              7  /**< \brief CATB signal: SENSE3 on PA07 mux G */
#define MUX_PA07G_CATB_SENSE3              6
#define GPIO_PA07G_CATB_SENSE3     (1u <<  7)
#define PIN_PA30G_CATB_SENSE3             30  /**< \brief CATB signal: SENSE3 on PA30 mux G */
#define MUX_PA30G_CATB_SENSE3              6
#define GPIO_PA30G_CATB_SENSE3     (1u << 30)
#define PIN_PC00G_CATB_SENSE3             64  /**< \brief CATB signal: SENSE3 on PC00 mux G */
#define MUX_PC00G_CATB_SENSE3              6
#define GPIO_PC00G_CATB_SENSE3     (1u <<  0)
#define PIN_PA08G_CATB_SENSE4              8  /**< \brief CATB signal: SENSE4 on PA08 mux G */
#define MUX_PA08G_CATB_SENSE4              6
#define GPIO_PA08G_CATB_SENSE4     (1u <<  8)
#define PIN_PC01G_CATB_SENSE4             65  /**< \brief CATB signal: SENSE4 on PC01 mux G */
#define MUX_PC01G_CATB_SENSE4              6
#define GPIO_PC01G_CATB_SENSE4     (1u <<  1)
#define PIN_PA09G_CATB_SENSE5              9  /**< \brief CATB signal: SENSE5 on PA09 mux G */
#define MUX_PA09G_CATB_SENSE5              6
#define GPIO_PA09G_CATB_SENSE5     (1u <<  9)
#define PIN_PC02G_CATB_SENSE5             66  /**< \brief CATB signal: SENSE5 on PC02 mux G */
#define MUX_PC02G_CATB_SENSE5              6
#define GPIO_PC02G_CATB_SENSE5     (1u <<  2)
#define PIN_PA10G_CATB_SENSE6             10  /**< \brief CATB signal: SENSE6 on PA10 mux G */
#define MUX_PA10G_CATB_SENSE6              6
#define GPIO_PA10G_CATB_SENSE6     (1u << 10)
#define PIN_PC03G_CATB_SENSE6             67  /**< \brief CATB signal: SENSE6 on PC03 mux G */
#define MUX_PC03G_CATB_SENSE6              6
#define GPIO_PC03G_CATB_SENSE6     (1u <<  3)
#define PIN_PA11G_CATB_SENSE7             11  /**< \brief CATB signal: SENSE7 on PA11 mux G */
#define MUX_PA11G_CATB_SENSE7              6
#define GPIO_PA11G_CATB_SENSE7     (1u << 11)
#define PIN_PC04G_CATB_SENSE7             68  /**< \brief CATB signal: SENSE7 on PC04 mux G */
#define MUX_PC04G_CATB_SENSE7              6
#define GPIO_PC04G_CATB_SENSE7     (1u <<  4)
#define PIN_PA13G_CATB_SENSE8             13  /**< \brief CATB signal: SENSE8 on PA13 mux G */
#define MUX_PA13G_CATB_SENSE8              6
#define GPIO_PA13G_CATB_SENSE8     (1u << 13)
#define PIN_PC06G_CATB_SENSE8             70  /**< \brief CATB signal: SENSE8 on PC06 mux G */
#define MUX_PC06G_CATB_SENSE8              6
#define GPIO_PC06G_CATB_SENSE8     (1u <<  6)
#define PIN_PA14G_CATB_SENSE9             14  /**< \brief CATB signal: SENSE9 on PA14 mux G */
#define MUX_PA14G_CATB_SENSE9              6
#define GPIO_PA14G_CATB_SENSE9     (1u << 14)
#define PIN_PC07G_CATB_SENSE9             71  /**< \brief CATB signal: SENSE9 on PC07 mux G */
#define MUX_PC07G_CATB_SENSE9              6
#define GPIO_PC07G_CATB_SENSE9     (1u <<  7)
#define PIN_PA15G_CATB_SENSE10            15  /**< \brief CATB signal: SENSE10 on PA15 mux G */
#define MUX_PA15G_CATB_SENSE10             6
#define GPIO_PA15G_CATB_SENSE10    (1u << 15)
#define PIN_PC08G_CATB_SENSE10            72  /**< \brief CATB signal: SENSE10 on PC08 mux G */
#define MUX_PC08G_CATB_SENSE10             6
#define GPIO_PC08G_CATB_SENSE10    (1u <<  8)
#define PIN_PA16G_CATB_SENSE11            16  /**< \brief CATB signal: SENSE11 on PA16 mux G */
#define MUX_PA16G_CATB_SENSE11             6
#define GPIO_PA16G_CATB_SENSE11    (1u << 16)
#define PIN_PC09G_CATB_SENSE11            73  /**< \brief CATB signal: SENSE11 on PC09 mux G */
#define MUX_PC09G_CATB_SENSE11             6
#define GPIO_PC09G_CATB_SENSE11    (1u <<  9)
#define PIN_PA17G_CATB_SENSE12            17  /**< \brief CATB signal: SENSE12 on PA17 mux G */
#define MUX_PA17G_CATB_SENSE12             6
#define GPIO_PA17G_CATB_SENSE12    (1u << 17)
#define PIN_PC10G_CATB_SENSE12            74  /**< \brief CATB signal: SENSE12 on PC10 mux G */
#define MUX_PC10G_CATB_SENSE12             6
#define GPIO_PC10G_CATB_SENSE12    (1u << 10)
#define PIN_PA18G_CATB_SENSE13            18  /**< \brief CATB signal: SENSE13 on PA18 mux G */
#define MUX_PA18G_CATB_SENSE13             6
#define GPIO_PA18G_CATB_SENSE13    (1u << 18)
#define PIN_PC11G_CATB_SENSE13            75  /**< \brief CATB signal: SENSE13 on PC11 mux G */
#define MUX_PC11G_CATB_SENSE13             6
#define GPIO_PC11G_CATB_SENSE13    (1u << 11)
#define PIN_PA19G_CATB_SENSE14            19  /**< \brief CATB signal: SENSE14 on PA19 mux G */
#define MUX_PA19G_CATB_SENSE14             6
#define GPIO_PA19G_CATB_SENSE14    (1u << 19)
#define PIN_PC12G_CATB_SENSE14            76  /**< \brief CATB signal: SENSE14 on PC12 mux G */
#define MUX_PC12G_CATB_SENSE14             6
#define GPIO_PC12G_CATB_SENSE14    (1u << 12)
#define PIN_PA20G_CATB_SENSE15            20  /**< \brief CATB signal: SENSE15 on PA20 mux G */
#define MUX_PA20G_CATB_SENSE15             6
#define GPIO_PA20G_CATB_SENSE15    (1u << 20)
#define PIN_PC13G_CATB_SENSE15            77  /**< \brief CATB signal: SENSE15 on PC13 mux G */
#define MUX_PC13G_CATB_SENSE15             6
#define GPIO_PC13G_CATB_SENSE15    (1u << 13)
#define PIN_PA21G_CATB_SENSE16            21  /**< \brief CATB signal: SENSE16 on PA21 mux G */
#define MUX_PA21G_CATB_SENSE16             6
#define GPIO_PA21G_CATB_SENSE16    (1u << 21)
#define PIN_PC15G_CATB_SENSE16            79  /**< \brief CATB signal: SENSE16 on PC15 mux G */
#define MUX_PC15G_CATB_SENSE16             6
#define GPIO_PC15G_CATB_SENSE16    (1u << 15)
#define PIN_PA22G_CATB_SENSE17            22  /**< \brief CATB signal: SENSE17 on PA22 mux G */
#define MUX_PA22G_CATB_SENSE17             6
#define GPIO_PA22G_CATB_SENSE17    (1u << 22)
#define PIN_PC16G_CATB_SENSE17            80  /**< \brief CATB signal: SENSE17 on PC16 mux G */
#define MUX_PC16G_CATB_SENSE17             6
#define GPIO_PC16G_CATB_SENSE17    (1u << 16)
#define PIN_PA24G_CATB_SENSE18            24  /**< \brief CATB signal: SENSE18 on PA24 mux G */
#define MUX_PA24G_CATB_SENSE18             6
#define GPIO_PA24G_CATB_SENSE18    (1u << 24)
#define PIN_PC17G_CATB_SENSE18            81  /**< \brief CATB signal: SENSE18 on PC17 mux G */
#define MUX_PC17G_CATB_SENSE18             6
#define GPIO_PC17G_CATB_SENSE18    (1u << 17)
#define PIN_PA25G_CATB_SENSE19            25  /**< \brief CATB signal: SENSE19 on PA25 mux G */
#define MUX_PA25G_CATB_SENSE19             6
#define GPIO_PA25G_CATB_SENSE19    (1u << 25)
#define PIN_PC18G_CATB_SENSE19            82  /**< \brief CATB signal: SENSE19 on PC18 mux G */
#define MUX_PC18G_CATB_SENSE19             6
#define GPIO_PC18G_CATB_SENSE19    (1u << 18)
#define PIN_PA26G_CATB_SENSE20            26  /**< \brief CATB signal: SENSE20 on PA26 mux G */
#define MUX_PA26G_CATB_SENSE20             6
#define GPIO_PA26G_CATB_SENSE20    (1u << 26)
#define PIN_PC19G_CATB_SENSE20            83  /**< \brief CATB signal: SENSE20 on PC19 mux G */
#define MUX_PC19G_CATB_SENSE20             6
#define GPIO_PC19G_CATB_SENSE20    (1u << 19)
#define PIN_PB00G_CATB_SENSE21            32  /**< \brief CATB signal: SENSE21 on PB00 mux G */
#define MUX_PB00G_CATB_SENSE21             6
#define GPIO_PB00G_CATB_SENSE21    (1u <<  0)
#define PIN_PC20G_CATB_SENSE21            84  /**< \brief CATB signal: SENSE21 on PC20 mux G */
#define MUX_PC20G_CATB_SENSE21             6
#define GPIO_PC20G_CATB_SENSE21    (1u << 20)
#define PIN_PB01G_CATB_SENSE22            33  /**< \brief CATB signal: SENSE22 on PB01 mux G */
#define MUX_PB01G_CATB_SENSE22             6
#define GPIO_PB01G_CATB_SENSE22    (1u <<  1)
#define PIN_PC21G_CATB_SENSE22            85  /**< \brief CATB signal: SENSE22 on PC21 mux G */
#define MUX_PC21G_CATB_SENSE22             6
#define GPIO_PC21G_CATB_SENSE22    (1u << 21)
#define PIN_PB02G_CATB_SENSE23            34  /**< \brief CATB signal: SENSE23 on PB02 mux G */
#define MUX_PB02G_CATB_SENSE23             6
#define GPIO_PB02G_CATB_SENSE23    (1u <<  2)
#define PIN_PC22G_CATB_SENSE23            86  /**< \brief CATB signal: SENSE23 on PC22 mux G */
#define MUX_PC22G_CATB_SENSE23             6
#define GPIO_PC22G_CATB_SENSE23    (1u << 22)
#define PIN_PB04G_CATB_SENSE24            36  /**< \brief CATB signal: SENSE24 on PB04 mux G */
#define MUX_PB04G_CATB_SENSE24             6
#define GPIO_PB04G_CATB_SENSE24    (1u <<  4)
#define PIN_PC24G_CATB_SENSE24            88  /**< \brief CATB signal: SENSE24 on PC24 mux G */
#define MUX_PC24G_CATB_SENSE24             6
#define GPIO_PC24G_CATB_SENSE24    (1u << 24)
#define PIN_PB05G_CATB_SENSE25            37  /**< \brief CATB signal: SENSE25 on PB05 mux G */
#define MUX_PB05G_CATB_SENSE25             6
#define GPIO_PB05G_CATB_SENSE25    (1u <<  5)
#define PIN_PC25G_CATB_SENSE25            89  /**< \brief CATB signal: SENSE25 on PC25 mux G */
#define MUX_PC25G_CATB_SENSE25             6
#define GPIO_PC25G_CATB_SENSE25    (1u << 25)
#define PIN_PB06G_CATB_SENSE26            38  /**< \brief CATB signal: SENSE26 on PB06 mux G */
#define MUX_PB06G_CATB_SENSE26             6
#define GPIO_PB06G_CATB_SENSE26    (1u <<  6)
#define PIN_PC26G_CATB_SENSE26            90  /**< \brief CATB signal: SENSE26 on PC26 mux G */
#define MUX_PC26G_CATB_SENSE26             6
#define GPIO_PC26G_CATB_SENSE26    (1u << 26)
#define PIN_PB07G_CATB_SENSE27            39  /**< \brief CATB signal: SENSE27 on PB07 mux G */
#define MUX_PB07G_CATB_SENSE27             6
#define GPIO_PB07G_CATB_SENSE27    (1u <<  7)
#define PIN_PC27G_CATB_SENSE27            91  /**< \brief CATB signal: SENSE27 on PC27 mux G */
#define MUX_PC27G_CATB_SENSE27             6
#define GPIO_PC27G_CATB_SENSE27    (1u << 27)
#define PIN_PB08G_CATB_SENSE28            40  /**< \brief CATB signal: SENSE28 on PB08 mux G */
#define MUX_PB08G_CATB_SENSE28             6
#define GPIO_PB08G_CATB_SENSE28    (1u <<  8)
#define PIN_PC28G_CATB_SENSE28            92  /**< \brief CATB signal: SENSE28 on PC28 mux G */
#define MUX_PC28G_CATB_SENSE28             6
#define GPIO_PC28G_CATB_SENSE28    (1u << 28)
#define PIN_PB09G_CATB_SENSE29            41  /**< \brief CATB signal: SENSE29 on PB09 mux G */
#define MUX_PB09G_CATB_SENSE29             6
#define GPIO_PB09G_CATB_SENSE29    (1u <<  9)
#define PIN_PC29G_CATB_SENSE29            93  /**< \brief CATB signal: SENSE29 on PC29 mux G */
#define MUX_PC29G_CATB_SENSE29             6
#define GPIO_PC29G_CATB_SENSE29    (1u << 29)
#define PIN_PB10G_CATB_SENSE30            42  /**< \brief CATB signal: SENSE30 on PB10 mux G */
#define MUX_PB10G_CATB_SENSE30             6
#define GPIO_PB10G_CATB_SENSE30    (1u << 10)
#define PIN_PC30G_CATB_SENSE30            94  /**< \brief CATB signal: SENSE30 on PC30 mux G */
#define MUX_PC30G_CATB_SENSE30             6
#define GPIO_PC30G_CATB_SENSE30    (1u << 30)
#define PIN_PB11G_CATB_SENSE31            43  /**< \brief CATB signal: SENSE31 on PB11 mux G */
#define MUX_PB11G_CATB_SENSE31             6
#define GPIO_PB11G_CATB_SENSE31    (1u << 11)
#define PIN_PC31G_CATB_SENSE31            95  /**< \brief CATB signal: SENSE31 on PC31 mux G */
#define MUX_PC31G_CATB_SENSE31             6
#define GPIO_PC31G_CATB_SENSE31    (1u << 31)
/* ========== GPIO definition for DACC peripheral ========== */
#define PIN_PB04E_DACC_EXT_TRIG0          36  /**< \brief DACC signal: EXT_TRIG0 on PB04 mux E */
#define MUX_PB04E_DACC_EXT_TRIG0           4
#define GPIO_PB04E_DACC_EXT_TRIG0  (1u <<  4)
#define PIN_PA06A_DACC_VOUT                6  /**< \brief DACC signal: VOUT on PA06 mux A */
#define MUX_PA06A_DACC_VOUT                0
#define GPIO_PA06A_DACC_VOUT       (1u <<  6)
/* ========== GPIO definition for EIC peripheral ========== */
#define PIN_PB01C_EIC_EXTINT0             33  /**< \brief EIC signal: EXTINT0 on PB01 mux C */
#define MUX_PB01C_EIC_EXTINT0              2
#define GPIO_PB01C_EIC_EXTINT0     (1u <<  1)
#define PIN_PA06C_EIC_EXTINT1              6  /**< \brief EIC signal: EXTINT1 on PA06 mux C */
#define MUX_PA06C_EIC_EXTINT1              2
#define GPIO_PA06C_EIC_EXTINT1     (1u <<  6)
#define PIN_PA16C_EIC_EXTINT1             16  /**< \brief EIC signal: EXTINT1 on PA16 mux C */
#define MUX_PA16C_EIC_EXTINT1              2
#define GPIO_PA16C_EIC_EXTINT1     (1u << 16)
#define PIN_PC24B_EIC_EXTINT1             88  /**< \brief EIC signal: EXTINT1 on PC24 mux B */
#define MUX_PC24B_EIC_EXTINT1              1
#define GPIO_PC24B_EIC_EXTINT1     (1u << 24)
#define PIN_PA04C_EIC_EXTINT2              4  /**< \brief EIC signal: EXTINT2 on PA04 mux C */
#define MUX_PA04C_EIC_EXTINT2              2
#define GPIO_PA04C_EIC_EXTINT2     (1u <<  4)
#define PIN_PA17C_EIC_EXTINT2             17  /**< \brief EIC signal: EXTINT2 on PA17 mux C */
#define MUX_PA17C_EIC_EXTINT2              2
#define GPIO_PA17C_EIC_EXTINT2     (1u << 17)
#define PIN_PC25B_EIC_EXTINT2             89  /**< \brief EIC signal: EXTINT2 on PC25 mux B */
#define MUX_PC25B_EIC_EXTINT2              1
#define GPIO_PC25B_EIC_EXTINT2     (1u << 25)
#define PIN_PA05C_EIC_EXTINT3              5  /**< \brief EIC signal: EXTINT3 on PA05 mux C */
#define MUX_PA05C_EIC_EXTINT3              2
#define GPIO_PA05C_EIC_EXTINT3     (1u <<  5)
#define PIN_PA18C_EIC_EXTINT3             18  /**< \brief EIC signal: EXTINT3 on PA18 mux C */
#define MUX_PA18C_EIC_EXTINT3              2
#define GPIO_PA18C_EIC_EXTINT3     (1u << 18)
#define PIN_PC26B_EIC_EXTINT3             90  /**< \brief EIC signal: EXTINT3 on PC26 mux B */
#define MUX_PC26B_EIC_EXTINT3              1
#define GPIO_PC26B_EIC_EXTINT3     (1u << 26)
#define PIN_PA07C_EIC_EXTINT4              7  /**< \brief EIC signal: EXTINT4 on PA07 mux C */
#define MUX_PA07C_EIC_EXTINT4              2
#define GPIO_PA07C_EIC_EXTINT4     (1u <<  7)
#define PIN_PA19C_EIC_EXTINT4             19  /**< \brief EIC signal: EXTINT4 on PA19 mux C */
#define MUX_PA19C_EIC_EXTINT4              2
#define GPIO_PA19C_EIC_EXTINT4     (1u << 19)
#define PIN_PC27B_EIC_EXTINT4             91  /**< \brief EIC signal: EXTINT4 on PC27 mux B */
#define MUX_PC27B_EIC_EXTINT4              1
#define GPIO_PC27B_EIC_EXTINT4     (1u << 27)
#define PIN_PA20C_EIC_EXTINT5             20  /**< \brief EIC signal: EXTINT5 on PA20 mux C */
#define MUX_PA20C_EIC_EXTINT5              2
#define GPIO_PA20C_EIC_EXTINT5     (1u << 20)
#define PIN_PC03B_EIC_EXTINT5             67  /**< \brief EIC signal: EXTINT5 on PC03 mux B */
#define MUX_PC03B_EIC_EXTINT5              1
#define GPIO_PC03B_EIC_EXTINT5     (1u <<  3)
#define PIN_PA21C_EIC_EXTINT6             21  /**< \brief EIC signal: EXTINT6 on PA21 mux C */
#define MUX_PA21C_EIC_EXTINT6              2
#define GPIO_PA21C_EIC_EXTINT6     (1u << 21)
#define PIN_PC04B_EIC_EXTINT6             68  /**< \brief EIC signal: EXTINT6 on PC04 mux B */
#define MUX_PC04B_EIC_EXTINT6              1
#define GPIO_PC04B_EIC_EXTINT6     (1u <<  4)
#define PIN_PA22C_EIC_EXTINT7             22  /**< \brief EIC signal: EXTINT7 on PA22 mux C */
#define MUX_PA22C_EIC_EXTINT7              2
#define GPIO_PA22C_EIC_EXTINT7     (1u << 22)
#define PIN_PC05B_EIC_EXTINT7             69  /**< \brief EIC signal: EXTINT7 on PC05 mux B */
#define MUX_PC05B_EIC_EXTINT7              1
#define GPIO_PC05B_EIC_EXTINT7     (1u <<  5)
#define PIN_PA23C_EIC_EXTINT8             23  /**< \brief EIC signal: EXTINT8 on PA23 mux C */
#define MUX_PA23C_EIC_EXTINT8              2
#define GPIO_PA23C_EIC_EXTINT8     (1u << 23)
#define PIN_PC06B_EIC_EXTINT8             70  /**< \brief EIC signal: EXTINT8 on PC06 mux B */
#define MUX_PC06B_EIC_EXTINT8              1
#define GPIO_PC06B_EIC_EXTINT8     (1u <<  6)
/* ========== GPIO definition for GLOC peripheral ========== */
#define PIN_PA06D_GLOC_IN0                 6  /**< \brief GLOC signal: IN0 on PA06 mux D */
#define MUX_PA06D_GLOC_IN0                 3
#define GPIO_PA06D_GLOC_IN0        (1u <<  6)
#define PIN_PA20D_GLOC_IN0                20  /**< \brief GLOC signal: IN0 on PA20 mux D */
#define MUX_PA20D_GLOC_IN0                 3
#define GPIO_PA20D_GLOC_IN0        (1u << 20)
#define PIN_PA04D_GLOC_IN1                 4  /**< \brief GLOC signal: IN1 on PA04 mux D */
#define MUX_PA04D_GLOC_IN1                 3
#define GPIO_PA04D_GLOC_IN1        (1u <<  4)
#define PIN_PA21D_GLOC_IN1                21  /**< \brief GLOC signal: IN1 on PA21 mux D */
#define MUX_PA21D_GLOC_IN1                 3
#define GPIO_PA21D_GLOC_IN1        (1u << 21)
#define PIN_PA05D_GLOC_IN2                 5  /**< \brief GLOC signal: IN2 on PA05 mux D */
#define MUX_PA05D_GLOC_IN2                 3
#define GPIO_PA05D_GLOC_IN2        (1u <<  5)
#define PIN_PA22D_GLOC_IN2                22  /**< \brief GLOC signal: IN2 on PA22 mux D */
#define MUX_PA22D_GLOC_IN2                 3
#define GPIO_PA22D_GLOC_IN2        (1u << 22)
#define PIN_PA07D_GLOC_IN3                 7  /**< \brief GLOC signal: IN3 on PA07 mux D */
#define MUX_PA07D_GLOC_IN3                 3
#define GPIO_PA07D_GLOC_IN3        (1u <<  7)
#define PIN_PA23D_GLOC_IN3                23  /**< \brief GLOC signal: IN3 on PA23 mux D */
#define MUX_PA23D_GLOC_IN3                 3
#define GPIO_PA23D_GLOC_IN3        (1u << 23)
#define PIN_PA27D_GLOC_IN4                27  /**< \brief GLOC signal: IN4 on PA27 mux D */
#define MUX_PA27D_GLOC_IN4                 3
#define GPIO_PA27D_GLOC_IN4        (1u << 27)
#define PIN_PC15D_GLOC_IN4                79  /**< \brief GLOC signal: IN4 on PC15 mux D */
#define MUX_PC15D_GLOC_IN4                 3
#define GPIO_PC15D_GLOC_IN4        (1u << 15)
#define PIN_PB06C_GLOC_IN4                38  /**< \brief GLOC signal: IN4 on PB06 mux C */
#define MUX_PB06C_GLOC_IN4                 2
#define GPIO_PB06C_GLOC_IN4        (1u <<  6)
#define PIN_PC28C_GLOC_IN4                92  /**< \brief GLOC signal: IN4 on PC28 mux C */
#define MUX_PC28C_GLOC_IN4                 2
#define GPIO_PC28C_GLOC_IN4        (1u << 28)
#define PIN_PA28D_GLOC_IN5                28  /**< \brief GLOC signal: IN5 on PA28 mux D */
#define MUX_PA28D_GLOC_IN5                 3
#define GPIO_PA28D_GLOC_IN5        (1u << 28)
#define PIN_PC16D_GLOC_IN5                80  /**< \brief GLOC signal: IN5 on PC16 mux D */
#define MUX_PC16D_GLOC_IN5                 3
#define GPIO_PC16D_GLOC_IN5        (1u << 16)
#define PIN_PB07C_GLOC_IN5                39  /**< \brief GLOC signal: IN5 on PB07 mux C */
#define MUX_PB07C_GLOC_IN5                 2
#define GPIO_PB07C_GLOC_IN5        (1u <<  7)
#define PIN_PC29C_GLOC_IN5                93  /**< \brief GLOC signal: IN5 on PC29 mux C */
#define MUX_PC29C_GLOC_IN5                 2
#define GPIO_PC29C_GLOC_IN5        (1u << 29)
#define PIN_PA29D_GLOC_IN6                29  /**< \brief GLOC signal: IN6 on PA29 mux D */
#define MUX_PA29D_GLOC_IN6                 3
#define GPIO_PA29D_GLOC_IN6        (1u << 29)
#define PIN_PC17D_GLOC_IN6                81  /**< \brief GLOC signal: IN6 on PC17 mux D */
#define MUX_PC17D_GLOC_IN6                 3
#define GPIO_PC17D_GLOC_IN6        (1u << 17)
#define PIN_PB08C_GLOC_IN6                40  /**< \brief GLOC signal: IN6 on PB08 mux C */
#define MUX_PB08C_GLOC_IN6                 2
#define GPIO_PB08C_GLOC_IN6        (1u <<  8)
#define PIN_PC30C_GLOC_IN6                94  /**< \brief GLOC signal: IN6 on PC30 mux C */
#define MUX_PC30C_GLOC_IN6                 2
#define GPIO_PC30C_GLOC_IN6        (1u << 30)
#define PIN_PA30D_GLOC_IN7                30  /**< \brief GLOC signal: IN7 on PA30 mux D */
#define MUX_PA30D_GLOC_IN7                 3
#define GPIO_PA30D_GLOC_IN7        (1u << 30)
#define PIN_PC18D_GLOC_IN7                82  /**< \brief GLOC signal: IN7 on PC18 mux D */
#define MUX_PC18D_GLOC_IN7                 3
#define GPIO_PC18D_GLOC_IN7        (1u << 18)
#define PIN_PB09C_GLOC_IN7                41  /**< \brief GLOC signal: IN7 on PB09 mux C */
#define MUX_PB09C_GLOC_IN7                 2
#define GPIO_PB09C_GLOC_IN7        (1u <<  9)
#define PIN_PA08D_GLOC_OUT0                8  /**< \brief GLOC signal: OUT0 on PA08 mux D */
#define MUX_PA08D_GLOC_OUT0                3
#define GPIO_PA08D_GLOC_OUT0       (1u <<  8)
#define PIN_PA24D_GLOC_OUT0               24  /**< \brief GLOC signal: OUT0 on PA24 mux D */
#define MUX_PA24D_GLOC_OUT0                3
#define GPIO_PA24D_GLOC_OUT0       (1u << 24)
#define PIN_PA31D_GLOC_OUT1               31  /**< \brief GLOC signal: OUT1 on PA31 mux D */
#define MUX_PA31D_GLOC_OUT1                3
#define GPIO_PA31D_GLOC_OUT1       (1u << 31)
#define PIN_PC19D_GLOC_OUT1               83  /**< \brief GLOC signal: OUT1 on PC19 mux D */
#define MUX_PC19D_GLOC_OUT1                3
#define GPIO_PC19D_GLOC_OUT1       (1u << 19)
#define PIN_PB10C_GLOC_OUT1               42  /**< \brief GLOC signal: OUT1 on PB10 mux C */
#define MUX_PB10C_GLOC_OUT1                2
#define GPIO_PB10C_GLOC_OUT1       (1u << 10)
#define PIN_PC31C_GLOC_OUT1               95  /**< \brief GLOC signal: OUT1 on PC31 mux C */
#define MUX_PC31C_GLOC_OUT1                2
#define GPIO_PC31C_GLOC_OUT1       (1u << 31)
/* ========== GPIO definition for IISC peripheral ========== */
#define PIN_PB05D_IISC_IMCK               37  /**< \brief IISC signal: IMCK on PB05 mux D */
#define MUX_PB05D_IISC_IMCK                3
#define GPIO_PB05D_IISC_IMCK       (1u <<  5)
#define PIN_PC14D_IISC_IMCK               78  /**< \brief IISC signal: IMCK on PC14 mux D */
#define MUX_PC14D_IISC_IMCK                3
#define GPIO_PC14D_IISC_IMCK       (1u << 14)
#define PIN_PA31B_IISC_IMCK               31  /**< \brief IISC signal: IMCK on PA31 mux B */
#define MUX_PA31B_IISC_IMCK                1
#define GPIO_PA31B_IISC_IMCK       (1u << 31)
#define PIN_PB02D_IISC_ISCK               34  /**< \brief IISC signal: ISCK on PB02 mux D */
#define MUX_PB02D_IISC_ISCK                3
#define GPIO_PB02D_IISC_ISCK       (1u <<  2)
#define PIN_PC09D_IISC_ISCK               73  /**< \brief IISC signal: ISCK on PC09 mux D */
#define MUX_PC09D_IISC_ISCK                3
#define GPIO_PC09D_IISC_ISCK       (1u <<  9)
#define PIN_PA27B_IISC_ISCK               27  /**< \brief IISC signal: ISCK on PA27 mux B */
#define MUX_PA27B_IISC_ISCK                1
#define GPIO_PA27B_IISC_ISCK       (1u << 27)
#define PIN_PB03D_IISC_ISDI               35  /**< \brief IISC signal: ISDI on PB03 mux D */
#define MUX_PB03D_IISC_ISDI                3
#define GPIO_PB03D_IISC_ISDI       (1u <<  3)
#define PIN_PC10D_IISC_ISDI               74  /**< \brief IISC signal: ISDI on PC10 mux D */
#define MUX_PC10D_IISC_ISDI                3
#define GPIO_PC10D_IISC_ISDI       (1u << 10)
#define PIN_PA28B_IISC_ISDI               28  /**< \brief IISC signal: ISDI on PA28 mux B */
#define MUX_PA28B_IISC_ISDI                1
#define GPIO_PA28B_IISC_ISDI       (1u << 28)
#define PIN_PB04D_IISC_ISDO               36  /**< \brief IISC signal: ISDO on PB04 mux D */
#define MUX_PB04D_IISC_ISDO                3
#define GPIO_PB04D_IISC_ISDO       (1u <<  4)
#define PIN_PC13D_IISC_ISDO               77  /**< \brief IISC signal: ISDO on PC13 mux D */
#define MUX_PC13D_IISC_ISDO                3
