Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_PC13D_IISC_ISDO       (1u << 13)
#define PIN_PA30B_IISC_ISDO               30  /**< \brief IISC signal: ISDO on PA30 mux B */
#define MUX_PA30B_IISC_ISDO                1
#define GPIO_PA30B_IISC_ISDO       (1u << 30)
#define PIN_PB06D_IISC_IWS                38  /**< \brief IISC signal: IWS on PB06 mux D */
#define MUX_PB06D_IISC_IWS                 3
#define GPIO_PB06D_IISC_IWS        (1u <<  6)
#define PIN_PC12D_IISC_IWS                76  /**< \brief IISC signal: IWS on PC12 mux D */
#define MUX_PC12D_IISC_IWS                 3
#define GPIO_PC12D_IISC_IWS        (1u << 12)
#define PIN_PA29B_IISC_IWS                29  /**< \brief IISC signal: IWS on PA29 mux B */
#define MUX_PA29B_IISC_IWS                 1
#define GPIO_PA29B_IISC_IWS        (1u << 29)
/* ========== GPIO definition for LCDCA peripheral ========== */
#define PIN_PA12F_LCDCA_COM0              12  /**< \brief LCDCA signal: COM0 on PA12 mux F */
#define MUX_PA12F_LCDCA_COM0               5
#define GPIO_PA12F_LCDCA_COM0      (1u << 12)
#define PIN_PA11F_LCDCA_COM1              11  /**< \brief LCDCA signal: COM1 on PA11 mux F */
#define MUX_PA11F_LCDCA_COM1               5
#define GPIO_PA11F_LCDCA_COM1      (1u << 11)
#define PIN_PA10F_LCDCA_COM2              10  /**< \brief LCDCA signal: COM2 on PA10 mux F */
#define MUX_PA10F_LCDCA_COM2               5
#define GPIO_PA10F_LCDCA_COM2      (1u << 10)
#define PIN_PA09F_LCDCA_COM3               9  /**< \brief LCDCA signal: COM3 on PA09 mux F */
#define MUX_PA09F_LCDCA_COM3               5
#define GPIO_PA09F_LCDCA_COM3      (1u <<  9)
#define PIN_PC15F_LCDCA_SEG0              79  /**< \brief LCDCA signal: SEG0 on PC15 mux F */
#define MUX_PC15F_LCDCA_SEG0               5
#define GPIO_PC15F_LCDCA_SEG0      (1u << 15)
#define PIN_PC16F_LCDCA_SEG1              80  /**< \brief LCDCA signal: SEG1 on PC16 mux F */
#define MUX_PC16F_LCDCA_SEG1               5
#define GPIO_PC16F_LCDCA_SEG1      (1u << 16)
#define PIN_PC17F_LCDCA_SEG2              81  /**< \brief LCDCA signal: SEG2 on PC17 mux F */
#define MUX_PC17F_LCDCA_SEG2               5
#define GPIO_PC17F_LCDCA_SEG2      (1u << 17)
#define PIN_PC18F_LCDCA_SEG3              82  /**< \brief LCDCA signal: SEG3 on PC18 mux F */
#define MUX_PC18F_LCDCA_SEG3               5
#define GPIO_PC18F_LCDCA_SEG3      (1u << 18)
#define PIN_PC19F_LCDCA_SEG4              83  /**< \brief LCDCA signal: SEG4 on PC19 mux F */
#define MUX_PC19F_LCDCA_SEG4               5
#define GPIO_PC19F_LCDCA_SEG4      (1u << 19)
#define PIN_PA13F_LCDCA_SEG5              13  /**< \brief LCDCA signal: SEG5 on PA13 mux F */
#define MUX_PA13F_LCDCA_SEG5               5
#define GPIO_PA13F_LCDCA_SEG5      (1u << 13)
#define PIN_PA14F_LCDCA_SEG6              14  /**< \brief LCDCA signal: SEG6 on PA14 mux F */
#define MUX_PA14F_LCDCA_SEG6               5
#define GPIO_PA14F_LCDCA_SEG6      (1u << 14)
#define PIN_PA15F_LCDCA_SEG7              15  /**< \brief LCDCA signal: SEG7 on PA15 mux F */
#define MUX_PA15F_LCDCA_SEG7               5
#define GPIO_PA15F_LCDCA_SEG7      (1u << 15)
#define PIN_PA16F_LCDCA_SEG8              16  /**< \brief LCDCA signal: SEG8 on PA16 mux F */
#define MUX_PA16F_LCDCA_SEG8               5
#define GPIO_PA16F_LCDCA_SEG8      (1u << 16)
#define PIN_PA17F_LCDCA_SEG9              17  /**< \brief LCDCA signal: SEG9 on PA17 mux F */
#define MUX_PA17F_LCDCA_SEG9               5
#define GPIO_PA17F_LCDCA_SEG9      (1u << 17)
#define PIN_PC20F_LCDCA_SEG10             84  /**< \brief LCDCA signal: SEG10 on PC20 mux F */
#define MUX_PC20F_LCDCA_SEG10              5
#define GPIO_PC20F_LCDCA_SEG10     (1u << 20)
#define PIN_PC21F_LCDCA_SEG11             85  /**< \brief LCDCA signal: SEG11 on PC21 mux F */
#define MUX_PC21F_LCDCA_SEG11              5
#define GPIO_PC21F_LCDCA_SEG11     (1u << 21)
#define PIN_PC22F_LCDCA_SEG12             86  /**< \brief LCDCA signal: SEG12 on PC22 mux F */
#define MUX_PC22F_LCDCA_SEG12              5
#define GPIO_PC22F_LCDCA_SEG12     (1u << 22)
#define PIN_PC23F_LCDCA_SEG13             87  /**< \brief LCDCA signal: SEG13 on PC23 mux F */
#define MUX_PC23F_LCDCA_SEG13              5
#define GPIO_PC23F_LCDCA_SEG13     (1u << 23)
#define PIN_PB08F_LCDCA_SEG14             40  /**< \brief LCDCA signal: SEG14 on PB08 mux F */
#define MUX_PB08F_LCDCA_SEG14              5
#define GPIO_PB08F_LCDCA_SEG14     (1u <<  8)
#define PIN_PB09F_LCDCA_SEG15             41  /**< \brief LCDCA signal: SEG15 on PB09 mux F */
#define MUX_PB09F_LCDCA_SEG15              5
#define GPIO_PB09F_LCDCA_SEG15     (1u <<  9)
#define PIN_PB10F_LCDCA_SEG16             42  /**< \brief LCDCA signal: SEG16 on PB10 mux F */
#define MUX_PB10F_LCDCA_SEG16              5
#define GPIO_PB10F_LCDCA_SEG16     (1u << 10)
#define PIN_PB11F_LCDCA_SEG17             43  /**< \brief LCDCA signal: SEG17 on PB11 mux F */
#define MUX_PB11F_LCDCA_SEG17              5
#define GPIO_PB11F_LCDCA_SEG17     (1u << 11)
#define PIN_PA18F_LCDCA_SEG18             18  /**< \brief LCDCA signal: SEG18 on PA18 mux F */
#define MUX_PA18F_LCDCA_SEG18              5
#define GPIO_PA18F_LCDCA_SEG18     (1u << 18)
#define PIN_PA19F_LCDCA_SEG19             19  /**< \brief LCDCA signal: SEG19 on PA19 mux F */
#define MUX_PA19F_LCDCA_SEG19              5
#define GPIO_PA19F_LCDCA_SEG19     (1u << 19)
#define PIN_PA20F_LCDCA_SEG20             20  /**< \brief LCDCA signal: SEG20 on PA20 mux F */
#define MUX_PA20F_LCDCA_SEG20              5
#define GPIO_PA20F_LCDCA_SEG20     (1u << 20)
#define PIN_PB07F_LCDCA_SEG21             39  /**< \brief LCDCA signal: SEG21 on PB07 mux F */
#define MUX_PB07F_LCDCA_SEG21              5
#define GPIO_PB07F_LCDCA_SEG21     (1u <<  7)
#define PIN_PB06F_LCDCA_SEG22             38  /**< \brief LCDCA signal: SEG22 on PB06 mux F */
#define MUX_PB06F_LCDCA_SEG22              5
#define GPIO_PB06F_LCDCA_SEG22     (1u <<  6)
#define PIN_PA08F_LCDCA_SEG23              8  /**< \brief LCDCA signal: SEG23 on PA08 mux F */
#define MUX_PA08F_LCDCA_SEG23              5
#define GPIO_PA08F_LCDCA_SEG23     (1u <<  8)
#define PIN_PC24F_LCDCA_SEG24             88  /**< \brief LCDCA signal: SEG24 on PC24 mux F */
#define MUX_PC24F_LCDCA_SEG24              5
#define GPIO_PC24F_LCDCA_SEG24     (1u << 24)
#define PIN_PC25F_LCDCA_SEG25             89  /**< \brief LCDCA signal: SEG25 on PC25 mux F */
#define MUX_PC25F_LCDCA_SEG25              5
#define GPIO_PC25F_LCDCA_SEG25     (1u << 25)
#define PIN_PC26F_LCDCA_SEG26             90  /**< \brief LCDCA signal: SEG26 on PC26 mux F */
#define MUX_PC26F_LCDCA_SEG26              5
#define GPIO_PC26F_LCDCA_SEG26     (1u << 26)
#define PIN_PC27F_LCDCA_SEG27             91  /**< \brief LCDCA signal: SEG27 on PC27 mux F */
#define MUX_PC27F_LCDCA_SEG27              5
#define GPIO_PC27F_LCDCA_SEG27     (1u << 27)
#define PIN_PC28F_LCDCA_SEG28             92  /**< \brief LCDCA signal: SEG28 on PC28 mux F */
#define MUX_PC28F_LCDCA_SEG28              5
#define GPIO_PC28F_LCDCA_SEG28     (1u << 28)
#define PIN_PC29F_LCDCA_SEG29             93  /**< \brief LCDCA signal: SEG29 on PC29 mux F */
#define MUX_PC29F_LCDCA_SEG29              5
#define GPIO_PC29F_LCDCA_SEG29     (1u << 29)
#define PIN_PC30F_LCDCA_SEG30             94  /**< \brief LCDCA signal: SEG30 on PC30 mux F */
#define MUX_PC30F_LCDCA_SEG30              5
#define GPIO_PC30F_LCDCA_SEG30     (1u << 30)
#define PIN_PC31F_LCDCA_SEG31             95  /**< \brief LCDCA signal: SEG31 on PC31 mux F */
#define MUX_PC31F_LCDCA_SEG31              5
#define GPIO_PC31F_LCDCA_SEG31     (1u << 31)
#define PIN_PB12F_LCDCA_SEG32             44  /**< \brief LCDCA signal: SEG32 on PB12 mux F */
#define MUX_PB12F_LCDCA_SEG32              5
#define GPIO_PB12F_LCDCA_SEG32     (1u << 12)
#define PIN_PB13F_LCDCA_SEG33             45  /**< \brief LCDCA signal: SEG33 on PB13 mux F */
#define MUX_PB13F_LCDCA_SEG33              5
#define GPIO_PB13F_LCDCA_SEG33     (1u << 13)
#define PIN_PA21F_LCDCA_SEG34             21  /**< \brief LCDCA signal: SEG34 on PA21 mux F */
#define MUX_PA21F_LCDCA_SEG34              5
#define GPIO_PA21F_LCDCA_SEG34     (1u << 21)
#define PIN_PA22F_LCDCA_SEG35             22  /**< \brief LCDCA signal: SEG35 on PA22 mux F */
#define MUX_PA22F_LCDCA_SEG35              5
#define GPIO_PA22F_LCDCA_SEG35     (1u << 22)
#define PIN_PB14F_LCDCA_SEG36             46  /**< \brief LCDCA signal: SEG36 on PB14 mux F */
#define MUX_PB14F_LCDCA_SEG36              5
#define GPIO_PB14F_LCDCA_SEG36     (1u << 14)
#define PIN_PB15F_LCDCA_SEG37             47  /**< \brief LCDCA signal: SEG37 on PB15 mux F */
#define MUX_PB15F_LCDCA_SEG37              5
#define GPIO_PB15F_LCDCA_SEG37     (1u << 15)
#define PIN_PA23F_LCDCA_SEG38             23  /**< \brief LCDCA signal: SEG38 on PA23 mux F */
#define MUX_PA23F_LCDCA_SEG38              5
#define GPIO_PA23F_LCDCA_SEG38     (1u << 23)
#define PIN_PA24F_LCDCA_SEG39             24  /**< \brief LCDCA signal: SEG39 on PA24 mux F */
#define MUX_PA24F_LCDCA_SEG39              5
#define GPIO_PA24F_LCDCA_SEG39     (1u << 24)
/* ========== GPIO definition for PARC peripheral ========== */
#define PIN_PA17D_PARC_PCCK               17  /**< \brief PARC signal: PCCK on PA17 mux D */
#define MUX_PA17D_PARC_PCCK                3
#define GPIO_PA17D_PARC_PCCK       (1u << 17)
#define PIN_PC21D_PARC_PCCK               85  /**< \brief PARC signal: PCCK on PC21 mux D */
#define MUX_PC21D_PARC_PCCK                3
#define GPIO_PC21D_PARC_PCCK       (1u << 21)
#define PIN_PA09D_PARC_PCDATA0             9  /**< \brief PARC signal: PCDATA0 on PA09 mux D */
#define MUX_PA09D_PARC_PCDATA0             3
#define GPIO_PA09D_PARC_PCDATA0    (1u <<  9)
#define PIN_PC24D_PARC_PCDATA0            88  /**< \brief PARC signal: PCDATA0 on PC24 mux D */
#define MUX_PC24D_PARC_PCDATA0             3
#define GPIO_PC24D_PARC_PCDATA0    (1u << 24)
#define PIN_PA10D_PARC_PCDATA1            10  /**< \brief PARC signal: PCDATA1 on PA10 mux D */
#define MUX_PA10D_PARC_PCDATA1             3
#define GPIO_PA10D_PARC_PCDATA1    (1u << 10)
#define PIN_PC25D_PARC_PCDATA1            89  /**< \brief PARC signal: PCDATA1 on PC25 mux D */
#define MUX_PC25D_PARC_PCDATA1             3
#define GPIO_PC25D_PARC_PCDATA1    (1u << 25)
#define PIN_PA11D_PARC_PCDATA2            11  /**< \brief PARC signal: PCDATA2 on PA11 mux D */
#define MUX_PA11D_PARC_PCDATA2             3
#define GPIO_PA11D_PARC_PCDATA2    (1u << 11)
#define PIN_PC26D_PARC_PCDATA2            90  /**< \brief PARC signal: PCDATA2 on PC26 mux D */
#define MUX_PC26D_PARC_PCDATA2             3
#define GPIO_PC26D_PARC_PCDATA2    (1u << 26)
#define PIN_PA12D_PARC_PCDATA3            12  /**< \brief PARC signal: PCDATA3 on PA12 mux D */
#define MUX_PA12D_PARC_PCDATA3             3
#define GPIO_PA12D_PARC_PCDATA3    (1u << 12)
#define PIN_PC27D_PARC_PCDATA3            91  /**< \brief PARC signal: PCDATA3 on PC27 mux D */
#define MUX_PC27D_PARC_PCDATA3             3
#define GPIO_PC27D_PARC_PCDATA3    (1u << 27)
#define PIN_PA13D_PARC_PCDATA4            13  /**< \brief PARC signal: PCDATA4 on PA13 mux D */
#define MUX_PA13D_PARC_PCDATA4             3
#define GPIO_PA13D_PARC_PCDATA4    (1u << 13)
#define PIN_PC28D_PARC_PCDATA4            92  /**< \brief PARC signal: PCDATA4 on PC28 mux D */
#define MUX_PC28D_PARC_PCDATA4             3
#define GPIO_PC28D_PARC_PCDATA4    (1u << 28)
#define PIN_PA14D_PARC_PCDATA5            14  /**< \brief PARC signal: PCDATA5 on PA14 mux D */
#define MUX_PA14D_PARC_PCDATA5             3
#define GPIO_PA14D_PARC_PCDATA5    (1u << 14)
#define PIN_PC29D_PARC_PCDATA5            93  /**< \brief PARC signal: PCDATA5 on PC29 mux D */
#define MUX_PC29D_PARC_PCDATA5             3
#define GPIO_PC29D_PARC_PCDATA5    (1u << 29)
#define PIN_PA15D_PARC_PCDATA6            15  /**< \brief PARC signal: PCDATA6 on PA15 mux D */
#define MUX_PA15D_PARC_PCDATA6             3
#define GPIO_PA15D_PARC_PCDATA6    (1u << 15)
#define PIN_PC30D_PARC_PCDATA6            94  /**< \brief PARC signal: PCDATA6 on PC30 mux D */
#define MUX_PC30D_PARC_PCDATA6             3
#define GPIO_PC30D_PARC_PCDATA6    (1u << 30)
#define PIN_PA16D_PARC_PCDATA7            16  /**< \brief PARC signal: PCDATA7 on PA16 mux D */
#define MUX_PA16D_PARC_PCDATA7             3
#define GPIO_PA16D_PARC_PCDATA7    (1u << 16)
#define PIN_PC31D_PARC_PCDATA7            95  /**< \brief PARC signal: PCDATA7 on PC31 mux D */
#define MUX_PC31D_PARC_PCDATA7             3
#define GPIO_PC31D_PARC_PCDATA7    (1u << 31)
#define PIN_PA18D_PARC_PCEN1              18  /**< \brief PARC signal: PCEN1 on PA18 mux D */
#define MUX_PA18D_PARC_PCEN1               3
#define GPIO_PA18D_PARC_PCEN1      (1u << 18)
#define PIN_PC22D_PARC_PCEN1              86  /**< \brief PARC signal: PCEN1 on PC22 mux D */
#define MUX_PC22D_PARC_PCEN1               3
#define GPIO_PC22D_PARC_PCEN1      (1u << 22)
#define PIN_PA19D_PARC_PCEN2              19  /**< \brief PARC signal: PCEN2 on PA19 mux D */
#define MUX_PA19D_PARC_PCEN2               3
#define GPIO_PA19D_PARC_PCEN2      (1u << 19)
#define PIN_PC23D_PARC_PCEN2              87  /**< \brief PARC signal: PCEN2 on PC23 mux D */
#define MUX_PC23D_PARC_PCEN2               3
#define GPIO_PC23D_PARC_PCEN2      (1u << 23)
/* ========== GPIO definition for PEVC peripheral ========== */
#define PIN_PA08C_PEVC_PAD_EVT0            8  /**< \brief PEVC signal: PAD_EVT0 on PA08 mux C */
#define MUX_PA08C_PEVC_PAD_EVT0            2
#define GPIO_PA08C_PEVC_PAD_EVT0   (1u <<  8)
#define PIN_PB12C_PEVC_PAD_EVT0           44  /**< \brief PEVC signal: PAD_EVT0 on PB12 mux C */
#define MUX_PB12C_PEVC_PAD_EVT0            2
#define GPIO_PB12C_PEVC_PAD_EVT0   (1u << 12)
#define PIN_PC07C_PEVC_PAD_EVT0           71  /**< \brief PEVC signal: PAD_EVT0 on PC07 mux C */
#define MUX_PC07C_PEVC_PAD_EVT0            2
#define GPIO_PC07C_PEVC_PAD_EVT0   (1u <<  7)
#define PIN_PC24C_PEVC_PAD_EVT0           88  /**< \brief PEVC signal: PAD_EVT0 on PC24 mux C */
#define MUX_PC24C_PEVC_PAD_EVT0            2
#define GPIO_PC24C_PEVC_PAD_EVT0   (1u << 24)
#define PIN_PA09C_PEVC_PAD_EVT1            9  /**< \brief PEVC signal: PAD_EVT1 on PA09 mux C */
#define MUX_PA09C_PEVC_PAD_EVT1            2
#define GPIO_PA09C_PEVC_PAD_EVT1   (1u <<  9)
#define PIN_PB13C_PEVC_PAD_EVT1           45  /**< \brief PEVC signal: PAD_EVT1 on PB13 mux C */
#define MUX_PB13C_PEVC_PAD_EVT1            2
#define GPIO_PB13C_PEVC_PAD_EVT1   (1u << 13)
#define PIN_PC08C_PEVC_PAD_EVT1           72  /**< \brief PEVC signal: PAD_EVT1 on PC08 mux C */
#define MUX_PC08C_PEVC_PAD_EVT1            2
#define GPIO_PC08C_PEVC_PAD_EVT1   (1u <<  8)
#define PIN_PC25C_PEVC_PAD_EVT1           89  /**< \brief PEVC signal: PAD_EVT1 on PC25 mux C */
#define MUX_PC25C_PEVC_PAD_EVT1            2
#define GPIO_PC25C_PEVC_PAD_EVT1   (1u << 25)
#define PIN_PA10C_PEVC_PAD_EVT2           10  /**< \brief PEVC signal: PAD_EVT2 on PA10 mux C */
#define MUX_PA10C_PEVC_PAD_EVT2            2
#define GPIO_PA10C_PEVC_PAD_EVT2   (1u << 10)
#define PIN_PC11C_PEVC_PAD_EVT2           75  /**< \brief PEVC signal: PAD_EVT2 on PC11 mux C */
#define MUX_PC11C_PEVC_PAD_EVT2            2
#define GPIO_PC11C_PEVC_PAD_EVT2   (1u << 11)
#define PIN_PC26C_PEVC_PAD_EVT2           90  /**< \brief PEVC signal: PAD_EVT2 on PC26 mux C */
#define MUX_PC26C_PEVC_PAD_EVT2            2
#define GPIO_PC26C_PEVC_PAD_EVT2   (1u << 26)
#define PIN_PB09B_PEVC_PAD_EVT2           41  /**< \brief PEVC signal: PAD_EVT2 on PB09 mux B */
#define MUX_PB09B_PEVC_PAD_EVT2            1
#define GPIO_PB09B_PEVC_PAD_EVT2   (1u <<  9)
#define PIN_PA11C_PEVC_PAD_EVT3           11  /**< \brief PEVC signal: PAD_EVT3 on PA11 mux C */
#define MUX_PA11C_PEVC_PAD_EVT3            2
#define GPIO_PA11C_PEVC_PAD_EVT3   (1u << 11)
#define PIN_PC27C_PEVC_PAD_EVT3           91  /**< \brief PEVC signal: PAD_EVT3 on PC27 mux C */
#define MUX_PC27C_PEVC_PAD_EVT3            2
#define GPIO_PC27C_PEVC_PAD_EVT3   (1u << 27)
#define PIN_PB10B_PEVC_PAD_EVT3           42  /**< \brief PEVC signal: PAD_EVT3 on PB10 mux B */
#define MUX_PB10B_PEVC_PAD_EVT3            1
#define GPIO_PB10B_PEVC_PAD_EVT3   (1u << 10)
/* ========== GPIO definition for PTC peripheral ========== */
#define PIN_PB02H_PTC_CAP0                34  /**< \brief PTC signal: CAP0 on PB02 mux H */
#define MUX_PB02H_PTC_CAP0                 7
#define GPIO_PB02H_PTC_CAP0        (1u <<  2)
#define PIN_PB03H_PTC_CAP1                35  /**< \brief PTC signal: CAP1 on PB03 mux H */
#define MUX_PB03H_PTC_CAP1                 7
#define GPIO_PB03H_PTC_CAP1        (1u <<  3)
#define PIN_PA04H_PTC_CAP2                 4  /**< \brief PTC signal: CAP2 on PA04 mux H */
#define MUX_PA04H_PTC_CAP2                 7
#define GPIO_PA04H_PTC_CAP2        (1u <<  4)
#define PIN_PA05H_PTC_CAP3                 5  /**< \brief PTC signal: CAP3 on PA05 mux H */
#define MUX_PA05H_PTC_CAP3                 7
#define GPIO_PA05H_PTC_CAP3        (1u <<  5)
#define PIN_PA06H_PTC_CAP4                 6  /**< \brief PTC signal: CAP4 on PA06 mux H */
#define MUX_PA06H_PTC_CAP4                 7
#define GPIO_PA06H_PTC_CAP4        (1u <<  6)
#define PIN_PA07H_PTC_CAP5                 7  /**< \brief PTC signal: CAP5 on PA07 mux H */
#define MUX_PA07H_PTC_CAP5                 7
#define GPIO_PA07H_PTC_CAP5        (1u <<  7)
#define PIN_PB04H_PTC_CAP6                36  /**< \brief PTC signal: CAP6 on PB04 mux H */
#define MUX_PB04H_PTC_CAP6                 7
#define GPIO_PB04H_PTC_CAP6        (1u <<  4)
#define PIN_PB05H_PTC_CAP7                37  /**< \brief PTC signal: CAP7 on PB05 mux H */
#define MUX_PB05H_PTC_CAP7                 7
#define GPIO_PB05H_PTC_CAP7        (1u <<  5)
#define PIN_PC07H_PTC_CAP8                71  /**< \brief PTC signal: CAP8 on PC07 mux H */
#define MUX_PC07H_PTC_CAP8                 7
#define GPIO_PC07H_PTC_CAP8        (1u <<  7)
#define PIN_PC08H_PTC_CAP9                72  /**< \brief PTC signal: CAP9 on PC08 mux H */
#define MUX_PC08H_PTC_CAP9                 7
#define GPIO_PC08H_PTC_CAP9        (1u <<  8)
#define PIN_PC09H_PTC_CAP10               73  /**< \brief PTC signal: CAP10 on PC09 mux H */
#define MUX_PC09H_PTC_CAP10                7
#define GPIO_PC09H_PTC_CAP10       (1u <<  9)
#define PIN_PC10H_PTC_CAP11               74  /**< \brief PTC signal: CAP11 on PC10 mux H */
#define MUX_PC10H_PTC_CAP11                7
#define GPIO_PC10H_PTC_CAP11       (1u << 10)
#define PIN_PC11H_PTC_CAP12               75  /**< \brief PTC signal: CAP12 on PC11 mux H */
#define MUX_PC11H_PTC_CAP12                7
#define GPIO_PC11H_PTC_CAP12       (1u << 11)
#define PIN_PC12H_PTC_CAP13               76  /**< \brief PTC signal: CAP13 on PC12 mux H */
#define MUX_PC12H_PTC_CAP13                7
#define GPIO_PC12H_PTC_CAP13       (1u << 12)
#define PIN_PC13H_PTC_CAP14               77  /**< \brief PTC signal: CAP14 on PC13 mux H */
#define MUX_PC13H_PTC_CAP14                7
#define GPIO_PC13H_PTC_CAP14       (1u << 13)
#define PIN_PC14H_PTC_CAP15               78  /**< \brief PTC signal: CAP15 on PC14 mux H */
#define MUX_PC14H_PTC_CAP15                7
#define GPIO_PC14H_PTC_CAP15       (1u << 14)
#define PIN_PB07H_PTC_CAP16               39  /**< \brief PTC signal: CAP16 on PB07 mux H */
#define MUX_PB07H_PTC_CAP16                7
#define GPIO_PB07H_PTC_CAP16       (1u <<  7)
#define PIN_PB06H_PTC_CAP17               38  /**< \brief PTC signal: CAP17 on PB06 mux H */
#define MUX_PB06H_PTC_CAP17                7
#define GPIO_PB06H_PTC_CAP17       (1u <<  6)
#define PIN_PA08H_PTC_CAP18                8  /**< \brief PTC signal: CAP18 on PA08 mux H */
#define MUX_PA08H_PTC_CAP18                7
#define GPIO_PA08H_PTC_CAP18       (1u <<  8)
#define PIN_PA09H_PTC_CAP19                9  /**< \brief PTC signal: CAP19 on PA09 mux H */
#define MUX_PA09H_PTC_CAP19                7
#define GPIO_PA09H_PTC_CAP19       (1u <<  9)
#define PIN_PA10H_PTC_CAP20               10  /**< \brief PTC signal: CAP20 on PA10 mux H */
#define MUX_PA10H_PTC_CAP20                7
#define GPIO_PA10H_PTC_CAP20       (1u << 10)
#define PIN_PA11H_PTC_CAP21               11  /**< \brief PTC signal: CAP21 on PA11 mux H */
#define MUX_PA11H_PTC_CAP21                7
#define GPIO_PA11H_PTC_CAP21       (1u << 11)
#define PIN_PA12H_PTC_CAP22               12  /**< \brief PTC signal: CAP22 on PA12 mux H */
#define MUX_PA12H_PTC_CAP22                7
#define GPIO_PA12H_PTC_CAP22       (1u << 12)
#define PIN_PA27H_PTC_CAP23               27  /**< \brief PTC signal: CAP23 on PA27 mux H */
#define MUX_PA27H_PTC_CAP23                7
#define GPIO_PA27H_PTC_CAP23       (1u << 27)
#define PIN_PA28H_PTC_CAP24               28  /**< \brief PTC signal: CAP24 on PA28 mux H */
#define MUX_PA28H_PTC_CAP24                7
#define GPIO_PA28H_PTC_CAP24       (1u << 28)
#define PIN_PA29H_PTC_CAP25               29  /**< \brief PTC signal: CAP25 on PA29 mux H */
#define MUX_PA29H_PTC_CAP25                7
#define GPIO_PA29H_PTC_CAP25       (1u << 29)
#define PIN_PA30H_PTC_CAP26               30  /**< \brief PTC signal: CAP26 on PA30 mux H */
#define MUX_PA30H_PTC_CAP26                7
#define GPIO_PA30H_PTC_CAP26       (1u << 30)
#define PIN_PA31H_PTC_CAP27               31  /**< \brief PTC signal: CAP27 on PA31 mux H */
#define MUX_PA31H_PTC_CAP27                7
#define GPIO_PA31H_PTC_CAP27       (1u << 31)
#define PIN_PC15H_PTC_CAP28               79  /**< \brief PTC signal: CAP28 on PC15 mux H */
#define MUX_PC15H_PTC_CAP28                7
#define GPIO_PC15H_PTC_CAP28       (1u << 15)
#define PIN_PC16H_PTC_CAP29               80  /**< \brief PTC signal: CAP29 on PC16 mux H */
#define MUX_PC16H_PTC_CAP29                7
#define GPIO_PC16H_PTC_CAP29       (1u << 16)
#define PIN_PC17H_PTC_CAP30               81  /**< \brief PTC signal: CAP30 on PC17 mux H */
#define MUX_PC17H_PTC_CAP30                7
#define GPIO_PC17H_PTC_CAP30       (1u << 17)
#define PIN_PC18H_PTC_CAP31               82  /**< \brief PTC signal: CAP31 on PC18 mux H */
#define MUX_PC18H_PTC_CAP31                7
#define GPIO_PC18H_PTC_CAP31       (1u << 18)
#define PIN_PA13H_PTC_DIS                 13  /**< \brief PTC signal: DIS on PA13 mux H */
#define MUX_PA13H_PTC_DIS                  7
#define GPIO_PA13H_PTC_DIS         (1u << 13)
#define PIN_PA24H_PTC_DIS                 24  /**< \brief PTC signal: DIS on PA24 mux H */
#define MUX_PA24H_PTC_DIS                  7
#define GPIO_PA24H_PTC_DIS         (1u << 24)
#define PIN_PB00H_PTC_DIS                 32  /**< \brief PTC signal: DIS on PB00 mux H */
#define MUX_PB00H_PTC_DIS                  7
#define GPIO_PB00H_PTC_DIS         (1u <<  0)
#define PIN_PB01H_PTC_DIS                 33  /**< \brief PTC signal: DIS on PB01 mux H */
#define MUX_PB01H_PTC_DIS                  7
#define GPIO_PB01H_PTC_DIS         (1u <<  1)
#define PIN_PC00H_PTC_DIS                 64  /**< \brief PTC signal: DIS on PC00 mux H */
#define MUX_PC00H_PTC_DIS                  7
#define GPIO_PC00H_PTC_DIS         (1u <<  0)
#define PIN_PC19H_PTC_DIS                 83  /**< \brief PTC signal: DIS on PC19 mux H */
#define MUX_PC19H_PTC_DIS                  7
#define GPIO_PC19H_PTC_DIS         (1u << 19)
/* ========== GPIO definition for SCIF peripheral ========== */
#define PIN_PA19E_SCIF_GCLK0              19  /**< \brief SCIF signal: GCLK0 on PA19 mux E */
#define MUX_PA19E_SCIF_GCLK0               4
#define GPIO_PA19E_SCIF_GCLK0      (1u << 19)
#define PIN_PB10E_SCIF_GCLK0              42  /**< \brief SCIF signal: GCLK0 on PB10 mux E */
#define MUX_PB10E_SCIF_GCLK0               4
#define GPIO_PB10E_SCIF_GCLK0      (1u << 10)
