Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define PIN_PC26E_SCIF_GCLK0              90  /**< \brief SCIF signal: GCLK0 on PC26 mux E */
#define MUX_PC26E_SCIF_GCLK0               4
#define GPIO_PC26E_SCIF_GCLK0      (1u << 26)
#define PIN_PA02A_SCIF_GCLK0               2  /**< \brief SCIF signal: GCLK0 on PA02 mux A */
#define MUX_PA02A_SCIF_GCLK0               0
#define GPIO_PA02A_SCIF_GCLK0      (1u <<  2)
#define PIN_PA20E_SCIF_GCLK1              20  /**< \brief SCIF signal: GCLK1 on PA20 mux E */
#define MUX_PA20E_SCIF_GCLK1               4
#define GPIO_PA20E_SCIF_GCLK1      (1u << 20)
#define PIN_PB11E_SCIF_GCLK1              43  /**< \brief SCIF signal: GCLK1 on PB11 mux E */
#define MUX_PB11E_SCIF_GCLK1               4
#define GPIO_PB11E_SCIF_GCLK1      (1u << 11)
#define PIN_PC27E_SCIF_GCLK1              91  /**< \brief SCIF signal: GCLK1 on PC27 mux E */
#define MUX_PC27E_SCIF_GCLK1               4
#define GPIO_PC27E_SCIF_GCLK1      (1u << 27)
#define PIN_PB12E_SCIF_GCLK2              44  /**< \brief SCIF signal: GCLK2 on PB12 mux E */
#define MUX_PB12E_SCIF_GCLK2               4
#define GPIO_PB12E_SCIF_GCLK2      (1u << 12)
#define PIN_PC28E_SCIF_GCLK2              92  /**< \brief SCIF signal: GCLK2 on PC28 mux E */
#define MUX_PC28E_SCIF_GCLK2               4
#define GPIO_PC28E_SCIF_GCLK2      (1u << 28)
#define PIN_PB13E_SCIF_GCLK3              45  /**< \brief SCIF signal: GCLK3 on PB13 mux E */
#define MUX_PB13E_SCIF_GCLK3               4
#define GPIO_PB13E_SCIF_GCLK3      (1u << 13)
#define PIN_PC29E_SCIF_GCLK3              93  /**< \brief SCIF signal: GCLK3 on PC29 mux E */
#define MUX_PC29E_SCIF_GCLK3               4
#define GPIO_PC29E_SCIF_GCLK3      (1u << 29)
#define PIN_PA23E_SCIF_GCLK_IN0           23  /**< \brief SCIF signal: GCLK_IN0 on PA23 mux E */
#define MUX_PA23E_SCIF_GCLK_IN0            4
#define GPIO_PA23E_SCIF_GCLK_IN0   (1u << 23)
#define PIN_PB14E_SCIF_GCLK_IN0           46  /**< \brief SCIF signal: GCLK_IN0 on PB14 mux E */
#define MUX_PB14E_SCIF_GCLK_IN0            4
#define GPIO_PB14E_SCIF_GCLK_IN0   (1u << 14)
#define PIN_PC30E_SCIF_GCLK_IN0           94  /**< \brief SCIF signal: GCLK_IN0 on PC30 mux E */
#define MUX_PC30E_SCIF_GCLK_IN0            4
#define GPIO_PC30E_SCIF_GCLK_IN0   (1u << 30)
#define PIN_PA24E_SCIF_GCLK_IN1           24  /**< \brief SCIF signal: GCLK_IN1 on PA24 mux E */
#define MUX_PA24E_SCIF_GCLK_IN1            4
#define GPIO_PA24E_SCIF_GCLK_IN1   (1u << 24)
#define PIN_PB15E_SCIF_GCLK_IN1           47  /**< \brief SCIF signal: GCLK_IN1 on PB15 mux E */
#define MUX_PB15E_SCIF_GCLK_IN1            4
#define GPIO_PB15E_SCIF_GCLK_IN1   (1u << 15)
#define PIN_PC31E_SCIF_GCLK_IN1           95  /**< \brief SCIF signal: GCLK_IN1 on PC31 mux E */
#define MUX_PC31E_SCIF_GCLK_IN1            4
#define GPIO_PC31E_SCIF_GCLK_IN1   (1u << 31)
/* ========== GPIO definition for SPI peripheral ========== */
#define PIN_PA03B_SPI_MISO                 3  /**< \brief SPI signal: MISO on PA03 mux B */
#define MUX_PA03B_SPI_MISO                 1
#define GPIO_PA03B_SPI_MISO        (1u <<  3)
#define PIN_PB14B_SPI_MISO                46  /**< \brief SPI signal: MISO on PB14 mux B */
#define MUX_PB14B_SPI_MISO                 1
#define GPIO_PB14B_SPI_MISO        (1u << 14)
#define PIN_PC28B_SPI_MISO                92  /**< \brief SPI signal: MISO on PC28 mux B */
#define MUX_PC28B_SPI_MISO                 1
#define GPIO_PC28B_SPI_MISO        (1u << 28)
#define PIN_PA21A_SPI_MISO                21  /**< \brief SPI signal: MISO on PA21 mux A */
#define MUX_PA21A_SPI_MISO                 0
#define GPIO_PA21A_SPI_MISO        (1u << 21)
#define PIN_PA27A_SPI_MISO                27  /**< \brief SPI signal: MISO on PA27 mux A */
#define MUX_PA27A_SPI_MISO                 0
#define GPIO_PA27A_SPI_MISO        (1u << 27)
#define PIN_PC04A_SPI_MISO                68  /**< \brief SPI signal: MISO on PC04 mux A */
#define MUX_PC04A_SPI_MISO                 0
#define GPIO_PC04A_SPI_MISO        (1u <<  4)
#define PIN_PB15B_SPI_MOSI                47  /**< \brief SPI signal: MOSI on PB15 mux B */
#define MUX_PB15B_SPI_MOSI                 1
#define GPIO_PB15B_SPI_MOSI        (1u << 15)
#define PIN_PC29B_SPI_MOSI                93  /**< \brief SPI signal: MOSI on PC29 mux B */
#define MUX_PC29B_SPI_MOSI                 1
#define GPIO_PC29B_SPI_MOSI        (1u << 29)
#define PIN_PA22A_SPI_MOSI                22  /**< \brief SPI signal: MOSI on PA22 mux A */
#define MUX_PA22A_SPI_MOSI                 0
#define GPIO_PA22A_SPI_MOSI        (1u << 22)
#define PIN_PA28A_SPI_MOSI                28  /**< \brief SPI signal: MOSI on PA28 mux A */
#define MUX_PA28A_SPI_MOSI                 0
#define GPIO_PA28A_SPI_MOSI        (1u << 28)
#define PIN_PC05A_SPI_MOSI                69  /**< \brief SPI signal: MOSI on PC05 mux A */
#define MUX_PC05A_SPI_MOSI                 0
#define GPIO_PC05A_SPI_MOSI        (1u <<  5)
#define PIN_PA02B_SPI_NPCS0                2  /**< \brief SPI signal: NPCS0 on PA02 mux B */
#define MUX_PA02B_SPI_NPCS0                1
#define GPIO_PA02B_SPI_NPCS0       (1u <<  2)
#define PIN_PC31B_SPI_NPCS0               95  /**< \brief SPI signal: NPCS0 on PC31 mux B */
#define MUX_PC31B_SPI_NPCS0                1
#define GPIO_PC31B_SPI_NPCS0       (1u << 31)
#define PIN_PA24A_SPI_NPCS0               24  /**< \brief SPI signal: NPCS0 on PA24 mux A */
#define MUX_PA24A_SPI_NPCS0                0
#define GPIO_PA24A_SPI_NPCS0       (1u << 24)
#define PIN_PA30A_SPI_NPCS0               30  /**< \brief SPI signal: NPCS0 on PA30 mux A */
#define MUX_PA30A_SPI_NPCS0                0
#define GPIO_PA30A_SPI_NPCS0       (1u << 30)
#define PIN_PC03A_SPI_NPCS0               67  /**< \brief SPI signal: NPCS0 on PC03 mux A */
#define MUX_PC03A_SPI_NPCS0                0
#define GPIO_PC03A_SPI_NPCS0       (1u <<  3)
#define PIN_PA13C_SPI_NPCS1               13  /**< \brief SPI signal: NPCS1 on PA13 mux C */
#define MUX_PA13C_SPI_NPCS1                2
#define GPIO_PA13C_SPI_NPCS1       (1u << 13)
#define PIN_PB13B_SPI_NPCS1               45  /**< \brief SPI signal: NPCS1 on PB13 mux B */
#define MUX_PB13B_SPI_NPCS1                1
#define GPIO_PB13B_SPI_NPCS1       (1u << 13)
#define PIN_PA31A_SPI_NPCS1               31  /**< \brief SPI signal: NPCS1 on PA31 mux A */
#define MUX_PA31A_SPI_NPCS1                0
#define GPIO_PA31A_SPI_NPCS1       (1u << 31)
#define PIN_PC02A_SPI_NPCS1               66  /**< \brief SPI signal: NPCS1 on PC02 mux A */
#define MUX_PC02A_SPI_NPCS1                0
#define GPIO_PC02A_SPI_NPCS1       (1u <<  2)
#define PIN_PA14C_SPI_NPCS2               14  /**< \brief SPI signal: NPCS2 on PA14 mux C */
#define MUX_PA14C_SPI_NPCS2                2
#define GPIO_PA14C_SPI_NPCS2       (1u << 14)
#define PIN_PB11B_SPI_NPCS2               43  /**< \brief SPI signal: NPCS2 on PB11 mux B */
#define MUX_PB11B_SPI_NPCS2                1
#define GPIO_PB11B_SPI_NPCS2       (1u << 11)
#define PIN_PC00A_SPI_NPCS2               64  /**< \brief SPI signal: NPCS2 on PC00 mux A */
#define MUX_PC00A_SPI_NPCS2                0
#define GPIO_PC00A_SPI_NPCS2       (1u <<  0)
#define PIN_PA15C_SPI_NPCS3               15  /**< \brief SPI signal: NPCS3 on PA15 mux C */
#define MUX_PA15C_SPI_NPCS3                2
#define GPIO_PA15C_SPI_NPCS3       (1u << 15)
#define PIN_PB12B_SPI_NPCS3               44  /**< \brief SPI signal: NPCS3 on PB12 mux B */
#define MUX_PB12B_SPI_NPCS3                1
#define GPIO_PB12B_SPI_NPCS3       (1u << 12)
#define PIN_PC01A_SPI_NPCS3               65  /**< \brief SPI signal: NPCS3 on PC01 mux A */
#define MUX_PC01A_SPI_NPCS3                0
#define GPIO_PC01A_SPI_NPCS3       (1u <<  1)
#define PIN_PC30B_SPI_SCK                 94  /**< \brief SPI signal: SCK on PC30 mux B */
#define MUX_PC30B_SPI_SCK                  1
#define GPIO_PC30B_SPI_SCK         (1u << 30)
#define PIN_PA23A_SPI_SCK                 23  /**< \brief SPI signal: SCK on PA23 mux A */
#define MUX_PA23A_SPI_SCK                  0
#define GPIO_PA23A_SPI_SCK         (1u << 23)
#define PIN_PA29A_SPI_SCK                 29  /**< \brief SPI signal: SCK on PA29 mux A */
#define MUX_PA29A_SPI_SCK                  0
#define GPIO_PA29A_SPI_SCK         (1u << 29)
#define PIN_PC06A_SPI_SCK                 70  /**< \brief SPI signal: SCK on PC06 mux A */
#define MUX_PC06A_SPI_SCK                  0
#define GPIO_PC06A_SPI_SCK         (1u <<  6)
/* ========== GPIO definition for TC0 peripheral ========== */
#define PIN_PB07D_TC0_A0                  39  /**< \brief TC0 signal: A0 on PB07 mux D */
#define MUX_PB07D_TC0_A0                   3
#define GPIO_PB07D_TC0_A0          (1u <<  7)
#define PIN_PA08B_TC0_A0                   8  /**< \brief TC0 signal: A0 on PA08 mux B */
#define MUX_PA08B_TC0_A0                   1
#define GPIO_PA08B_TC0_A0          (1u <<  8)
#define PIN_PB09D_TC0_A1                  41  /**< \brief TC0 signal: A1 on PB09 mux D */
#define MUX_PB09D_TC0_A1                   3
#define GPIO_PB09D_TC0_A1          (1u <<  9)
#define PIN_PA10B_TC0_A1                  10  /**< \brief TC0 signal: A1 on PA10 mux B */
#define MUX_PA10B_TC0_A1                   1
#define GPIO_PA10B_TC0_A1          (1u << 10)
#define PIN_PB11D_TC0_A2                  43  /**< \brief TC0 signal: A2 on PB11 mux D */
#define MUX_PB11D_TC0_A2                   3
#define GPIO_PB11D_TC0_A2          (1u << 11)
#define PIN_PA12B_TC0_A2                  12  /**< \brief TC0 signal: A2 on PA12 mux B */
#define MUX_PA12B_TC0_A2                   1
#define GPIO_PA12B_TC0_A2          (1u << 12)
#define PIN_PB08D_TC0_B0                  40  /**< \brief TC0 signal: B0 on PB08 mux D */
#define MUX_PB08D_TC0_B0                   3
#define GPIO_PB08D_TC0_B0          (1u <<  8)
#define PIN_PA09B_TC0_B0                   9  /**< \brief TC0 signal: B0 on PA09 mux B */
#define MUX_PA09B_TC0_B0                   1
#define GPIO_PA09B_TC0_B0          (1u <<  9)
#define PIN_PB10D_TC0_B1                  42  /**< \brief TC0 signal: B1 on PB10 mux D */
#define MUX_PB10D_TC0_B1                   3
#define GPIO_PB10D_TC0_B1          (1u << 10)
#define PIN_PA11B_TC0_B1                  11  /**< \brief TC0 signal: B1 on PA11 mux B */
#define MUX_PA11B_TC0_B1                   1
#define GPIO_PA11B_TC0_B1          (1u << 11)
#define PIN_PB12D_TC0_B2                  44  /**< \brief TC0 signal: B2 on PB12 mux D */
#define MUX_PB12D_TC0_B2                   3
#define GPIO_PB12D_TC0_B2          (1u << 12)
#define PIN_PA13B_TC0_B2                  13  /**< \brief TC0 signal: B2 on PA13 mux B */
#define MUX_PA13B_TC0_B2                   1
#define GPIO_PA13B_TC0_B2          (1u << 13)
#define PIN_PB13D_TC0_CLK0                45  /**< \brief TC0 signal: CLK0 on PB13 mux D */
#define MUX_PB13D_TC0_CLK0                 3
#define GPIO_PB13D_TC0_CLK0        (1u << 13)
#define PIN_PA14B_TC0_CLK0                14  /**< \brief TC0 signal: CLK0 on PA14 mux B */
#define MUX_PA14B_TC0_CLK0                 1
#define GPIO_PA14B_TC0_CLK0        (1u << 14)
#define PIN_PB14D_TC0_CLK1                46  /**< \brief TC0 signal: CLK1 on PB14 mux D */
#define MUX_PB14D_TC0_CLK1                 3
#define GPIO_PB14D_TC0_CLK1        (1u << 14)
#define PIN_PA15B_TC0_CLK1                15  /**< \brief TC0 signal: CLK1 on PA15 mux B */
#define MUX_PA15B_TC0_CLK1                 1
#define GPIO_PA15B_TC0_CLK1        (1u << 15)
#define PIN_PB15D_TC0_CLK2                47  /**< \brief TC0 signal: CLK2 on PB15 mux D */
#define MUX_PB15D_TC0_CLK2                 3
#define GPIO_PB15D_TC0_CLK2        (1u << 15)
#define PIN_PA16B_TC0_CLK2                16  /**< \brief TC0 signal: CLK2 on PA16 mux B */
#define MUX_PA16B_TC0_CLK2                 1
#define GPIO_PA16B_TC0_CLK2        (1u << 16)
/* ========== GPIO definition for TC1 peripheral ========== */
#define PIN_PC00D_TC1_A0                  64  /**< \brief TC1 signal: A0 on PC00 mux D */
#define MUX_PC00D_TC1_A0                   3
#define GPIO_PC00D_TC1_A0          (1u <<  0)
#define PIN_PC15A_TC1_A0                  79  /**< \brief TC1 signal: A0 on PC15 mux A */
#define MUX_PC15A_TC1_A0                   0
#define GPIO_PC15A_TC1_A0          (1u << 15)
#define PIN_PC02D_TC1_A1                  66  /**< \brief TC1 signal: A1 on PC02 mux D */
#define MUX_PC02D_TC1_A1                   3
#define GPIO_PC02D_TC1_A1          (1u <<  2)
#define PIN_PC17A_TC1_A1                  81  /**< \brief TC1 signal: A1 on PC17 mux A */
#define MUX_PC17A_TC1_A1                   0
#define GPIO_PC17A_TC1_A1          (1u << 17)
#define PIN_PC04D_TC1_A2                  68  /**< \brief TC1 signal: A2 on PC04 mux D */
#define MUX_PC04D_TC1_A2                   3
#define GPIO_PC04D_TC1_A2          (1u <<  4)
#define PIN_PC19A_TC1_A2                  83  /**< \brief TC1 signal: A2 on PC19 mux A */
#define MUX_PC19A_TC1_A2                   0
#define GPIO_PC19A_TC1_A2          (1u << 19)
#define PIN_PC01D_TC1_B0                  65  /**< \brief TC1 signal: B0 on PC01 mux D */
#define MUX_PC01D_TC1_B0                   3
#define GPIO_PC01D_TC1_B0          (1u <<  1)
#define PIN_PC16A_TC1_B0                  80  /**< \brief TC1 signal: B0 on PC16 mux A */
#define MUX_PC16A_TC1_B0                   0
#define GPIO_PC16A_TC1_B0          (1u << 16)
#define PIN_PC03D_TC1_B1                  67  /**< \brief TC1 signal: B1 on PC03 mux D */
#define MUX_PC03D_TC1_B1                   3
#define GPIO_PC03D_TC1_B1          (1u <<  3)
#define PIN_PC18A_TC1_B1                  82  /**< \brief TC1 signal: B1 on PC18 mux A */
#define MUX_PC18A_TC1_B1                   0
#define GPIO_PC18A_TC1_B1          (1u << 18)
#define PIN_PC05D_TC1_B2                  69  /**< \brief TC1 signal: B2 on PC05 mux D */
#define MUX_PC05D_TC1_B2                   3
#define GPIO_PC05D_TC1_B2          (1u <<  5)
#define PIN_PC20A_TC1_B2                  84  /**< \brief TC1 signal: B2 on PC20 mux A */
#define MUX_PC20A_TC1_B2                   0
#define GPIO_PC20A_TC1_B2          (1u << 20)
#define PIN_PC06D_TC1_CLK0                70  /**< \brief TC1 signal: CLK0 on PC06 mux D */
#define MUX_PC06D_TC1_CLK0                 3
#define GPIO_PC06D_TC1_CLK0        (1u <<  6)
#define PIN_PC21A_TC1_CLK0                85  /**< \brief TC1 signal: CLK0 on PC21 mux A */
#define MUX_PC21A_TC1_CLK0                 0
#define GPIO_PC21A_TC1_CLK0        (1u << 21)
#define PIN_PC07D_TC1_CLK1                71  /**< \brief TC1 signal: CLK1 on PC07 mux D */
#define MUX_PC07D_TC1_CLK1                 3
#define GPIO_PC07D_TC1_CLK1        (1u <<  7)
#define PIN_PC22A_TC1_CLK1                86  /**< \brief TC1 signal: CLK1 on PC22 mux A */
#define MUX_PC22A_TC1_CLK1                 0
#define GPIO_PC22A_TC1_CLK1        (1u << 22)
#define PIN_PC08D_TC1_CLK2                72  /**< \brief TC1 signal: CLK2 on PC08 mux D */
#define MUX_PC08D_TC1_CLK2                 3
#define GPIO_PC08D_TC1_CLK2        (1u <<  8)
#define PIN_PC23A_TC1_CLK2                87  /**< \brief TC1 signal: CLK2 on PC23 mux A */
#define MUX_PC23A_TC1_CLK2                 0
#define GPIO_PC23A_TC1_CLK2        (1u << 23)
/* ========== GPIO definition for TWIMS0 peripheral ========== */
#define PIN_PA24B_TWIMS0_TWCK             24  /**< \brief TWIMS0 signal: TWCK on PA24 mux B */
#define MUX_PA24B_TWIMS0_TWCK              1
#define GPIO_PA24B_TWIMS0_TWCK     (1u << 24)
#define PIN_PA23B_TWIMS0_TWD              23  /**< \brief TWIMS0 signal: TWD on PA23 mux B */
#define MUX_PA23B_TWIMS0_TWD               1
#define GPIO_PA23B_TWIMS0_TWD      (1u << 23)
/* ========== GPIO definition for TWIMS1 peripheral ========== */
#define PIN_PB01A_TWIMS1_TWCK             33  /**< \brief TWIMS1 signal: TWCK on PB01 mux A */
#define MUX_PB01A_TWIMS1_TWCK              0
#define GPIO_PB01A_TWIMS1_TWCK     (1u <<  1)
#define PIN_PB00A_TWIMS1_TWD              32  /**< \brief TWIMS1 signal: TWD on PB00 mux A */
#define MUX_PB00A_TWIMS1_TWD               0
#define GPIO_PB00A_TWIMS1_TWD      (1u <<  0)
/* ========== GPIO definition for TWIMS2 peripheral ========== */
#define PIN_PA22E_TWIMS2_TWCK             22  /**< \brief TWIMS2 signal: TWCK on PA22 mux E */
#define MUX_PA22E_TWIMS2_TWCK              4
#define GPIO_PA22E_TWIMS2_TWCK     (1u << 22)
#define PIN_PA21E_TWIMS2_TWD              21  /**< \brief TWIMS2 signal: TWD on PA21 mux E */
#define MUX_PA21E_TWIMS2_TWD               4
#define GPIO_PA21E_TWIMS2_TWD      (1u << 21)
/* ========== GPIO definition for TWIMS3 peripheral ========== */
#define PIN_PB15C_TWIMS3_TWCK             47  /**< \brief TWIMS3 signal: TWCK on PB15 mux C */
#define MUX_PB15C_TWIMS3_TWCK              2
#define GPIO_PB15C_TWIMS3_TWCK     (1u << 15)
#define PIN_PB14C_TWIMS3_TWD              46  /**< \brief TWIMS3 signal: TWD on PB14 mux C */
#define MUX_PB14C_TWIMS3_TWD               2
#define GPIO_PB14C_TWIMS3_TWD      (1u << 14)
/* ========== GPIO definition for USART0 peripheral ========== */
#define PIN_PA04B_USART0_CLK               4  /**< \brief USART0 signal: CLK on PA04 mux B */
#define MUX_PA04B_USART0_CLK               1
#define GPIO_PA04B_USART0_CLK      (1u <<  4)
#define PIN_PC00B_USART0_CLK              64  /**< \brief USART0 signal: CLK on PC00 mux B */
#define MUX_PC00B_USART0_CLK               1
#define GPIO_PC00B_USART0_CLK      (1u <<  0)
#define PIN_PA10A_USART0_CLK              10  /**< \brief USART0 signal: CLK on PA10 mux A */
#define MUX_PA10A_USART0_CLK               0
#define GPIO_PA10A_USART0_CLK      (1u << 10)
#define PIN_PB13A_USART0_CLK              45  /**< \brief USART0 signal: CLK on PB13 mux A */
#define MUX_PB13A_USART0_CLK               0
#define GPIO_PB13A_USART0_CLK      (1u << 13)
#define PIN_PC02B_USART0_CTS              66  /**< \brief USART0 signal: CTS on PC02 mux B */
#define MUX_PC02B_USART0_CTS               1
#define GPIO_PC02B_USART0_CTS      (1u <<  2)
#define PIN_PA09A_USART0_CTS               9  /**< \brief USART0 signal: CTS on PA09 mux A */
#define MUX_PA09A_USART0_CTS               0
#define GPIO_PA09A_USART0_CTS      (1u <<  9)
#define PIN_PB11A_USART0_CTS              43  /**< \brief USART0 signal: CTS on PB11 mux A */
#define MUX_PB11A_USART0_CTS               0
#define GPIO_PB11A_USART0_CTS      (1u << 11)
#define PIN_PA06B_USART0_RTS               6  /**< \brief USART0 signal: RTS on PA06 mux B */
#define MUX_PA06B_USART0_RTS               1
#define GPIO_PA06B_USART0_RTS      (1u <<  6)
#define PIN_PC01B_USART0_RTS              65  /**< \brief USART0 signal: RTS on PC01 mux B */
#define MUX_PC01B_USART0_RTS               1
#define GPIO_PC01B_USART0_RTS      (1u <<  1)
#define PIN_PA08A_USART0_RTS               8  /**< \brief USART0 signal: RTS on PA08 mux A */
#define MUX_PA08A_USART0_RTS               0
#define GPIO_PA08A_USART0_RTS      (1u <<  8)
#define PIN_PB12A_USART0_RTS              44  /**< \brief USART0 signal: RTS on PB12 mux A */
#define MUX_PB12A_USART0_RTS               0
#define GPIO_PB12A_USART0_RTS      (1u << 12)
#define PIN_PC02C_USART0_RXD              66  /**< \brief USART0 signal: RXD on PC02 mux C */
#define MUX_PC02C_USART0_RXD               2
#define GPIO_PC02C_USART0_RXD      (1u <<  2)
#define PIN_PA05B_USART0_RXD               5  /**< \brief USART0 signal: RXD on PA05 mux B */
#define MUX_PA05B_USART0_RXD               1
#define GPIO_PA05B_USART0_RXD      (1u <<  5)
#define PIN_PB00B_USART0_RXD              32  /**< \brief USART0 signal: RXD on PB00 mux B */
#define MUX_PB00B_USART0_RXD               1
#define GPIO_PB00B_USART0_RXD      (1u <<  0)
#define PIN_PA11A_USART0_RXD              11  /**< \brief USART0 signal: RXD on PA11 mux A */
#define MUX_PA11A_USART0_RXD               0
#define GPIO_PA11A_USART0_RXD      (1u << 11)
#define PIN_PB14A_USART0_RXD              46  /**< \brief USART0 signal: RXD on PB14 mux A */
#define MUX_PB14A_USART0_RXD               0
#define GPIO_PB14A_USART0_RXD      (1u << 14)
#define PIN_PC03C_USART0_TXD              67  /**< \brief USART0 signal: TXD on PC03 mux C */
#define MUX_PC03C_USART0_TXD               2
#define GPIO_PC03C_USART0_TXD      (1u <<  3)
#define PIN_PA07B_USART0_TXD               7  /**< \brief USART0 signal: TXD on PA07 mux B */
#define MUX_PA07B_USART0_TXD               1
#define GPIO_PA07B_USART0_TXD      (1u <<  7)
#define PIN_PB01B_USART0_TXD              33  /**< \brief USART0 signal: TXD on PB01 mux B */
#define MUX_PB01B_USART0_TXD               1
#define GPIO_PB01B_USART0_TXD      (1u <<  1)
#define PIN_PA12A_USART0_TXD              12  /**< \brief USART0 signal: TXD on PA12 mux A */
#define MUX_PA12A_USART0_TXD               0
#define GPIO_PA12A_USART0_TXD      (1u << 12)
#define PIN_PB15A_USART0_TXD              47  /**< \brief USART0 signal: TXD on PB15 mux A */
#define MUX_PB15A_USART0_TXD               0
#define GPIO_PB15A_USART0_TXD      (1u << 15)
/* ========== GPIO definition for USART1 peripheral ========== */
#define PIN_PB03B_USART1_CLK              35  /**< \brief USART1 signal: CLK on PB03 mux B */
#define MUX_PB03B_USART1_CLK               1
#define GPIO_PB03B_USART1_CLK      (1u <<  3)
#define PIN_PA14A_USART1_CLK              14  /**< \brief USART1 signal: CLK on PA14 mux A */
#define MUX_PA14A_USART1_CLK               0
#define GPIO_PA14A_USART1_CLK      (1u << 14)
#define PIN_PC25A_USART1_CLK              89  /**< \brief USART1 signal: CLK on PC25 mux A */
#define MUX_PC25A_USART1_CLK               0
#define GPIO_PC25A_USART1_CLK      (1u << 25)
#define PIN_PA21B_USART1_CTS              21  /**< \brief USART1 signal: CTS on PA21 mux B */
#define MUX_PA21B_USART1_CTS               1
#define GPIO_PA21B_USART1_CTS      (1u << 21)
#define PIN_PB02B_USART1_RTS              34  /**< \brief USART1 signal: RTS on PB02 mux B */
#define MUX_PB02B_USART1_RTS               1
#define GPIO_PB02B_USART1_RTS      (1u <<  2)
#define PIN_PA13A_USART1_RTS              13  /**< \brief USART1 signal: RTS on PA13 mux A */
#define MUX_PA13A_USART1_RTS               0
#define GPIO_PA13A_USART1_RTS      (1u << 13)
#define PIN_PC24A_USART1_RTS              88  /**< \brief USART1 signal: RTS on PC24 mux A */
#define MUX_PC24A_USART1_RTS               0
#define GPIO_PC24A_USART1_RTS      (1u << 24)
#define PIN_PB04B_USART1_RXD              36  /**< \brief USART1 signal: RXD on PB04 mux B */
#define MUX_PB04B_USART1_RXD               1
#define GPIO_PB04B_USART1_RXD      (1u <<  4)
#define PIN_PA15A_USART1_RXD              15  /**< \brief USART1 signal: RXD on PA15 mux A */
#define MUX_PA15A_USART1_RXD               0
#define GPIO_PA15A_USART1_RXD      (1u << 15)
#define PIN_PC26A_USART1_RXD              90  /**< \brief USART1 signal: RXD on PC26 mux A */
#define MUX_PC26A_USART1_RXD               0
#define GPIO_PC26A_USART1_RXD      (1u << 26)
#define PIN_PB05B_USART1_TXD              37  /**< \brief USART1 signal: TXD on PB05 mux B */
#define MUX_PB05B_USART1_TXD               1
#define GPIO_PB05B_USART1_TXD      (1u <<  5)
#define PIN_PA16A_USART1_TXD              16  /**< \brief USART1 signal: TXD on PA16 mux A */
#define MUX_PA16A_USART1_TXD               0
#define GPIO_PA16A_USART1_TXD      (1u << 16)
#define PIN_PC27A_USART1_TXD              91  /**< \brief USART1 signal: TXD on PC27 mux A */
#define MUX_PC27A_USART1_TXD               0
#define GPIO_PC27A_USART1_TXD      (1u << 27)
/* ========== GPIO definition for USART2 peripheral ========== */
#define PIN_PC08B_USART2_CLK              72  /**< \brief USART2 signal: CLK on PC08 mux B */
#define MUX_PC08B_USART2_CLK               1
#define GPIO_PC08B_USART2_CLK      (1u <<  8)
#define PIN_PA18A_USART2_CLK              18  /**< \brief USART2 signal: CLK on PA18 mux A */
#define MUX_PA18A_USART2_CLK               0
