Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#define GPIO_PA18A_USART2_CLK      (1u << 18)
#define PIN_PC08E_USART2_CTS              72  /**< \brief USART2 signal: CTS on PC08 mux E */
#define MUX_PC08E_USART2_CTS               4
#define GPIO_PC08E_USART2_CTS      (1u <<  8)
#define PIN_PA22B_USART2_CTS              22  /**< \brief USART2 signal: CTS on PA22 mux B */
#define MUX_PA22B_USART2_CTS               1
#define GPIO_PA22B_USART2_CTS      (1u << 22)
#define PIN_PC07B_USART2_RTS              71  /**< \brief USART2 signal: RTS on PC07 mux B */
#define MUX_PC07B_USART2_RTS               1
#define GPIO_PC07B_USART2_RTS      (1u <<  7)
#define PIN_PA17A_USART2_RTS              17  /**< \brief USART2 signal: RTS on PA17 mux A */
#define MUX_PA17A_USART2_RTS               0
#define GPIO_PA17A_USART2_RTS      (1u << 17)
#define PIN_PA25B_USART2_RXD              25  /**< \brief USART2 signal: RXD on PA25 mux B */
#define MUX_PA25B_USART2_RXD               1
#define GPIO_PA25B_USART2_RXD      (1u << 25)
#define PIN_PC11B_USART2_RXD              75  /**< \brief USART2 signal: RXD on PC11 mux B */
#define MUX_PC11B_USART2_RXD               1
#define GPIO_PC11B_USART2_RXD      (1u << 11)
#define PIN_PA19A_USART2_RXD              19  /**< \brief USART2 signal: RXD on PA19 mux A */
#define MUX_PA19A_USART2_RXD               0
#define GPIO_PA19A_USART2_RXD      (1u << 19)
#define PIN_PA26B_USART2_TXD              26  /**< \brief USART2 signal: TXD on PA26 mux B */
#define MUX_PA26B_USART2_TXD               1
#define GPIO_PA26B_USART2_TXD      (1u << 26)
#define PIN_PC12B_USART2_TXD              76  /**< \brief USART2 signal: TXD on PC12 mux B */
#define MUX_PC12B_USART2_TXD               1
#define GPIO_PC12B_USART2_TXD      (1u << 12)
#define PIN_PA20A_USART2_TXD              20  /**< \brief USART2 signal: TXD on PA20 mux A */
#define MUX_PA20A_USART2_TXD               0
#define GPIO_PA20A_USART2_TXD      (1u << 20)
/* ========== GPIO definition for USART3 peripheral ========== */
#define PIN_PA29E_USART3_CLK              29  /**< \brief USART3 signal: CLK on PA29 mux E */
#define MUX_PA29E_USART3_CLK               4
#define GPIO_PA29E_USART3_CLK      (1u << 29)
#define PIN_PC14B_USART3_CLK              78  /**< \brief USART3 signal: CLK on PC14 mux B */
#define MUX_PC14B_USART3_CLK               1
#define GPIO_PC14B_USART3_CLK      (1u << 14)
#define PIN_PB08A_USART3_CLK              40  /**< \brief USART3 signal: CLK on PB08 mux A */
#define MUX_PB08A_USART3_CLK               0
#define GPIO_PB08A_USART3_CLK      (1u <<  8)
#define PIN_PC31A_USART3_CLK              95  /**< \brief USART3 signal: CLK on PC31 mux A */
#define MUX_PC31A_USART3_CLK               0
#define GPIO_PC31A_USART3_CLK      (1u << 31)
#define PIN_PA28E_USART3_CTS              28  /**< \brief USART3 signal: CTS on PA28 mux E */
#define MUX_PA28E_USART3_CTS               4
#define GPIO_PA28E_USART3_CTS      (1u << 28)
#define PIN_PB07A_USART3_CTS              39  /**< \brief USART3 signal: CTS on PB07 mux A */
#define MUX_PB07A_USART3_CTS               0
#define GPIO_PB07A_USART3_CTS      (1u <<  7)
#define PIN_PA27E_USART3_RTS              27  /**< \brief USART3 signal: RTS on PA27 mux E */
#define MUX_PA27E_USART3_RTS               4
#define GPIO_PA27E_USART3_RTS      (1u << 27)
#define PIN_PC13B_USART3_RTS              77  /**< \brief USART3 signal: RTS on PC13 mux B */
#define MUX_PC13B_USART3_RTS               1
#define GPIO_PC13B_USART3_RTS      (1u << 13)
#define PIN_PB06A_USART3_RTS              38  /**< \brief USART3 signal: RTS on PB06 mux A */
#define MUX_PB06A_USART3_RTS               0
#define GPIO_PB06A_USART3_RTS      (1u <<  6)
#define PIN_PC30A_USART3_RTS              94  /**< \brief USART3 signal: RTS on PC30 mux A */
#define MUX_PC30A_USART3_RTS               0
#define GPIO_PC30A_USART3_RTS      (1u << 30)
#define PIN_PA30E_USART3_RXD              30  /**< \brief USART3 signal: RXD on PA30 mux E */
#define MUX_PA30E_USART3_RXD               4
#define GPIO_PA30E_USART3_RXD      (1u << 30)
#define PIN_PC09B_USART3_RXD              73  /**< \brief USART3 signal: RXD on PC09 mux B */
#define MUX_PC09B_USART3_RXD               1
#define GPIO_PC09B_USART3_RXD      (1u <<  9)
#define PIN_PB09A_USART3_RXD              41  /**< \brief USART3 signal: RXD on PB09 mux A */
#define MUX_PB09A_USART3_RXD               0
#define GPIO_PB09A_USART3_RXD      (1u <<  9)
#define PIN_PC28A_USART3_RXD              92  /**< \brief USART3 signal: RXD on PC28 mux A */
#define MUX_PC28A_USART3_RXD               0
#define GPIO_PC28A_USART3_RXD      (1u << 28)
#define PIN_PA31E_USART3_TXD              31  /**< \brief USART3 signal: TXD on PA31 mux E */
#define MUX_PA31E_USART3_TXD               4
#define GPIO_PA31E_USART3_TXD      (1u << 31)
#define PIN_PC10B_USART3_TXD              74  /**< \brief USART3 signal: TXD on PC10 mux B */
#define MUX_PC10B_USART3_TXD               1
#define GPIO_PC10B_USART3_TXD      (1u << 10)
#define PIN_PB10A_USART3_TXD              42  /**< \brief USART3 signal: TXD on PB10 mux A */
#define MUX_PB10A_USART3_TXD               0
#define GPIO_PB10A_USART3_TXD      (1u << 10)
#define PIN_PC29A_USART3_TXD              93  /**< \brief USART3 signal: TXD on PC29 mux A */
#define MUX_PC29A_USART3_TXD               0
#define GPIO_PC29A_USART3_TXD      (1u << 29)
/* ========== GPIO definition for USBC peripheral ========== */
#define PIN_PA25A_USBC_DM                 25  /**< \brief USBC signal: DM on PA25 mux A */
#define MUX_PA25A_USBC_DM                  0
#define GPIO_PA25A_USBC_DM         (1u << 25)
#define PIN_PA26A_USBC_DP                 26  /**< \brief USBC signal: DP on PA26 mux A */
#define MUX_PA26A_USBC_DP                  0
#define GPIO_PA26A_USBC_DP         (1u << 26)
/*@}*/

/* ************************************************************************** */
/**  MEMORY MAPPING DEFINITIONS FOR SAM4L4 */
/* ************************************************************************** */

#if defined __ATSAM4LC2A__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LC2B__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LC2C__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LC4A__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LC4B__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LC4C__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LS2A__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

