Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/sam4l/bootloader/sam/utils/cmsis/sam4l/include/sam4l4.h
#elif defined __ATSAM4LS2B__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LS2C__
  #define FLASH_SIZE          0x20000 /* 128 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   256
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LS4A__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LS4B__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */

#elif defined __ATSAM4LS4C__
  #define FLASH_SIZE          0x40000 /* 256 kB */
  #define FLASH_PAGE_SIZE     512
  #define FLASH_NB_OF_PAGES   512
  #define FLASH_USER_PAGE_SIZE 512
  #define HRAMC0_SIZE         0x8000 /* 32 kB */
  #define HRAMC1_SIZE         0xc00 /* 3 kB */
#else
  #error Library does not support the specified device.
#endif

#define FLASH_ADDR            (0x00000000u) /**< FLASH base address */
#define FLASH_USER_PAGE_ADDR  (0x00800000u) /**< FLASH_USER_PAGE base address */
#define HRAMC0_ADDR           (0x20000000u) /**< HRAMC0 base address */
#define HRAMC1_ADDR           (0x21000000u) /**< HRAMC1 base address */

#include "sam4l4_patch_asf.h"

#ifdef __cplusplus
}
#endif

/*@}*/

#endif /* SAM4L4_H */
